000010 IDENTIFICATION DIVISION.
000020   PROGRAM-ID. "bil02400".
000030*PROGRAM-NAME. EXTRACT OLD/NEW 545 & 875 FILE TOTALS.
000040   AUTHOR. JACK MASON.
000050   INSTALLATION. DELUXE CORPORATION.
000060   DATE-WRITTEN. 09-02-14.
000070   DATE-COMPILED.
000080******************************************************************
000090*
000100*RUN INSTRUCTIONS                                         09-02-14
000110*
000120*I545O    = 545 INPUT FROM BIL478
000130*           BILLING TRANSACTION FILE - "OLD"
000140*
000150*I875O    = 875 INPUT FROM BIL602 (TRADITIONAL), BIL387 (CPO),
000160*             AND BIL382 (SYNOVUS)
000170*           WEEKLY CONSIDERATION FILE - "OLD"
000180*
000190*I545N    = 545 INPUT FROM BIL478
000200*           BILLING TRANSACTION FILE - "NEW"
000210*
000220*I875N    = 875 INPUT FROM BIL602 (TRADITIONAL), BIL387 (CPO),
000230*             AND BIL382 (SYNOVUS)
000240*           WEEKLY CONSIDERATION FILE - "NEW"
000250*
000260*OEXCEL   = TAB-DELIMITED FILE, FOR DOWNLOAD TO EXCEL, OF 545 AND
000270*             875 FILE TOTALS
000280*
000290*SYSOUT   = REVISION INFO, FILE TOTALS, AND ERROR MESSAGES
000300*
000310******************************************************************
000320*
000330*RETURN CODES                                             09-02-14
000340*
000350*  16 = RUN ABORTED.  SEE SYSOUT.
000360*         - EMPTY FILE: I545O OR I545N
000370*         - EMPTY FILE: I875O OR I875N WITH THE OTHER NOT EMPTY
000380*
000390*  04 = INFO ONLY.  RUN CONTINUED.  SEE SYSOUT.
000400*         - BOTH I875O AND I875N ARE EMPTY FILES
000410*
000420******************************************************************
000430*
000440*NARRATIVE                                                09-02-14
000450*
000460*PURPOSE:
000470*  TO EXTRACT TOTALS FROM "OLD" AND "NEW" 545 AND 875 FILES, AND
000480*    TO REPORT THE RESULTS IN A TAB-DELIMITED FILE (SUITABLE FOR
000490*    EXCEL) AND ON SYSOUT.
000500*
000510*SOURCE OF INFORMATION:
000520*  THE "OLD" 545 FILE, IN ANY ORDER.
000530*  THE "OLD" 875 FILE, IN ANY ORDER.
000540*  THE "NEW" 545 FILE, IN ANY ORDER.
000550*  THE "NEW" 875 FILE, IN ANY ORDER.
000560*
000570*PROGRAM FLOW:
000580*  IN INITIALIZATION, AFTER THE REQUIRED SYSOUT DISPLAY, THIS
000590*    PROGRAM OPENS FILES, AND PERFORMS INITIAL READS OF INPUTS.
000600*    IF EITHER INPUT 545 FILE IS EMPTY, THE PROGRAM WILL ABORT.
000610*    IF ONE INPUT 875 FILE IS EMPTY, BUT THE OTHER ISN'T, THE
000620*    PROGRAM WILL ABORT.
000630*  NEXT, THE PROGRAM READS EACH OF THE FOUR INPUT FILES UNTIL
000640*    END-OF-FILE, WHILE ACCUMULATING TOTALS OF RELEVANT FIELDS.
000650*  NEXT, THE PROGRAM BUILDS AND WRITES A TAB-DELIMITED RECORD
000660*    OF THE RELEVANT TOTALS FOR EXCEL.
000670*  NEXT, THE PROGRAM LISTS THOSE SAME TOTALS ON SYSOUT.
000680*  FINALLY, THE PROGRAM CLOSES ALL FILES, AND ENDS.
000690*
000700******************************************************************
000710*
000720*REVISION HISTORY
000730*
000740*09-02-14  PROGRAM WRITTEN.                         JACK MASON  01
000750*
000760******************************************************************
000770*
000780 ENVIRONMENT DIVISION.
000790 CONFIGURATION SECTION.
000800   SOURCE-COMPUTER. UNIX.
000810   OBJECT-COMPUTER. UNIX.
000820*
000830 INPUT-OUTPUT SECTION.
000840   FILE-CONTROL.
000850     SELECT I545O-FILE    ASSIGN RSD-I545O.
000860     SELECT I875O-FILE    ASSIGN RSD-I875O.
000870     SELECT I545N-FILE    ASSIGN RSD-I545N.
000880     SELECT I875N-FILE    ASSIGN RSD-I875N.
000890     SELECT OEXCEL-FILE   ASSIGN RSD-OEXCEL.
000900*
000910*
000920 DATA DIVISION.
000930 FILE SECTION.
000940*
000950 FD  I545O-FILE
000960*
000970 COPY T0545O.
000980*
000990*
001000 FD  I875O-FILE
001010*
001020 COPY T0875O.
001030*
001040*
001050 FD  I545N-FILE
001060*
001070 COPY T0545I.
001080*
001090*
001100 FD  I875N-FILE
001110*
001120 COPY T0875I.
001130*
001140*
001150 FD  OEXCEL-FILE
001160     RECORDING MODE IS F
001170     BLOCK CONTAINS 0 RECORDS
001180     RECORD CONTAINS 302 CHARACTERS
001190     LABEL RECORDS STANDARD.
001200   01  OEXCEL-REC.
001210     03  OX-COL-A                                PIC X.
001220     03  OX-TAB-01                               PIC X.
001230     03  OX-COL-B                                PIC X.
001240     03  OX-TAB-02                               PIC X.
001250     03  OX-OLD-TRS                              PIC Z(8)9.
001260     03  OX-TAB-03                               PIC X.
001270     03  OX-NEW-TRS                              PIC Z(8)9.
001280     03  OX-TAB-04                               PIC X.
001290     03  OX-COL-E                                PIC X.
001300     03  OX-TAB-05                               PIC X.
001310     03  OX-OLD-UNITS                            PIC -(9)9.
001320     03  OX-TAB-06                               PIC X.
001330     03  OX-NEW-UNITS                            PIC -(9)9.
001340     03  OX-TAB-07                               PIC X.
001350     03  OX-COL-H                                PIC X.
001360     03  OX-TAB-08                               PIC X.
001370     03  OX-OLD-RB                               PIC -(9)9.9(2).
001380     03  OX-TAB-09                               PIC X.
001390     03  OX-NEW-RB                               PIC -(9)9.9(2).
001400     03  OX-TAB-10                               PIC X.
001410     03  OX-COL-K                                PIC X.
001420     03  OX-TAB-11                               PIC X.
001430     03  OX-COL-L                                PIC X.
001440     03  OX-TAB-12                               PIC X.
001450     03  OX-OLD-RD                               PIC -(9)9.9(2).
001460     03  OX-TAB-13                               PIC X.
001470     03  OX-NEW-RD                               PIC -(9)9.9(2).
001480     03  OX-TAB-14                               PIC X.
001490     03  OX-COL-O                                PIC X.
001500     03  OX-TAB-15                               PIC X.
001510     03  OX-COL-P                                PIC X.
001520     03  OX-TAB-16                               PIC X.
001530     03  OX-OLD-TX                               PIC -(9)9.9(2).
001540     03  OX-TAB-17                               PIC X.
001550     03  OX-NEW-TX                               PIC -(9)9.9(2).
001560     03  OX-TAB-18                               PIC X.
001570     03  OX-COL-S                                PIC X.
001580     03  OX-TAB-19                               PIC X.
001590     03  OX-COL-T                                PIC X.
001600     03  OX-TAB-20                               PIC X.
001610     03  OX-OLD-UP                               PIC -(9)9.9(2).
001620     03  OX-TAB-21                               PIC X.
001630     03  OX-NEW-UP                               PIC -(9)9.9(2).
001640     03  OX-TAB-22                               PIC X.
001650     03  OX-COL-W                                PIC X.
001660     03  OX-TAB-23                               PIC X.
001670     03  OX-COL-X                                PIC X.
001680     03  OX-TAB-24                               PIC X.
001690     03  OX-OLD-GAS                              PIC -(9)9.9(2).
001700     03  OX-TAB-25                               PIC X.
001710     03  OX-NEW-GAS                              PIC -(9)9.9(2).
001720     03  OX-TAB-26                               PIC X.
001730     03  OX-COL-AA                               PIC X.
001740     03  OX-TAB-27                               PIC X.
001750     03  OX-COL-AB                               PIC X.
001760     03  OX-TAB-28                               PIC X.
001770     03  OX-OLD-CAP                              PIC -(9)9.9(2).
001780     03  OX-TAB-29                               PIC X.
001790     03  OX-NEW-CAP                              PIC -(9)9.9(2).
001800     03  OX-TAB-30                               PIC X.
001810     03  OX-COL-AE                               PIC X.
001820     03  OX-TAB-31                               PIC X.
001830     03  OX-COL-AF                               PIC X.
001840     03  OX-TAB-32                               PIC X.
001850     03  OX-OLD-RA                               PIC -(9)9.9(2).
001860     03  OX-TAB-33                               PIC X.
001870     03  OX-NEW-RA                               PIC -(9)9.9(2).
001880     03  OX-TAB-34                               PIC X.
001890     03  OX-COL-AI                               PIC X.
001900     03  OX-TAB-35                               PIC X.
001910     03  OX-COL-AJ                               PIC X.
001920     03  OX-TAB-36                               PIC X.
001930     03  OX-OLD-NET                              PIC -(9)9.9(2).
001940     03  OX-TAB-37                               PIC X.
001950     03  OX-NEW-NET                              PIC -(9)9.9(2).
001960     03  OX-TAB-38                               PIC X.
001970*
001980*
001990 WORKING-STORAGE SECTION.
002000*
002010 01  WS-FLAGS-AND-SUCH                           VALUE SPACES.
002020   03  WS-I545O-FILE-FLAG         PIC X.
002030     88  END-I545O-FILE             VALUE 'E'.
002040   03  WS-I875O-FILE-FLAG         PIC X.
002050     88  END-I875O-FILE             VALUE 'E'.
002060   03  WS-I545N-FILE-FLAG         PIC X.
002070     88  END-I545N-FILE             VALUE 'E'.
002080   03  WS-I875N-FILE-FLAG         PIC X.
002090     88  END-I875N-FILE             VALUE 'E'.
002100   03  WS-RETURN-04-FLAG          PIC X.
002110     88  RETURN-04                  VALUE 'Y'.
002120*
002130 01  WS-ACCUMULATORS.
002140   03  WS-A-I545O-TRANS           PIC S9(9)      COMP-3  VALUE +0.
002150   03  WS-A-I545O-UNITS           PIC S9(9)      COMP-3  VALUE +0.
002160   03  WS-A-I545O-N-B             PIC S9(9)V9(2) COMP-3  VALUE +0.
002170   03  WS-A-I545O-N-D             PIC S9(9)V9(2) COMP-3  VALUE +0.
002180   03  WS-A-I545O-R-B             PIC S9(9)V9(2) COMP-3  VALUE +0.
002190   03  WS-A-I545O-R-D             PIC S9(9)V9(2) COMP-3  VALUE +0.
002200   03  WS-A-I545O-TAX             PIC S9(9)V9(2) COMP-3  VALUE +0.
002210   03  WS-A-I545O-UPCH            PIC S9(9)V9(2) COMP-3  VALUE +0.
002220   03  WS-A-I545O-GAS             PIC S9(9)V9(2) COMP-3  VALUE +0.
002230   03  WS-A-I545O-CAPS            PIC S9(9)V9(2) COMP-3  VALUE +0.
002240   03  WS-A-I875O-ACCR            PIC S9(9)V9(2) COMP-3  VALUE +0.
002250   03  WS-A-OLD-NET               PIC S9(9)V9(2) COMP-3  VALUE +0.
002260   03  WS-A-I545N-TRANS           PIC S9(9)      COMP-3  VALUE +0.
002270   03  WS-A-I545N-UNITS           PIC S9(9)      COMP-3  VALUE +0.
002280   03  WS-A-I545N-N-B             PIC S9(9)V9(2) COMP-3  VALUE +0.
002290   03  WS-A-I545N-N-D             PIC S9(9)V9(2) COMP-3  VALUE +0.
002300   03  WS-A-I545N-R-B             PIC S9(9)V9(2) COMP-3  VALUE +0.
002310   03  WS-A-I545N-R-D             PIC S9(9)V9(2) COMP-3  VALUE +0.
002320   03  WS-A-I545N-TAX             PIC S9(9)V9(2) COMP-3  VALUE +0.
002330   03  WS-A-I545N-UPCH            PIC S9(9)V9(2) COMP-3  VALUE +0.
002340   03  WS-A-I545N-GAS             PIC S9(9)V9(2) COMP-3  VALUE +0.
002350   03  WS-A-I545N-CAPS            PIC S9(9)V9(2) COMP-3  VALUE +0.
002360   03  WS-A-I875N-ACCR            PIC S9(9)V9(2) COMP-3  VALUE +0.
002370   03  WS-A-NEW-NET               PIC S9(9)V9(2) COMP-3  VALUE +0.
002380*
002390 01  WS-SYSOUT-CAPTIONS.
002400   03  WS-S-CAPT-TR            PIC X(15)  VALUE '   TRANSACTIONS'.
002410   03  WS-S-CAPT-UN            PIC X(15)  VALUE '          UNITS'.
002420   03  WS-S-CAPT-NB            PIC X(15)  VALUE '    NORMAL BASE'.
002430   03  WS-S-CAPT-ND            PIC X(15)  VALUE 'NORMAL DELIVERY'.
002440   03  WS-S-CAPT-RB            PIC X(15)  VALUE '    REPORT BASE'.
002450   03  WS-S-CAPT-RD            PIC X(15)  VALUE 'REPORT DELIVERY'.
002460   03  WS-S-CAPT-TX            PIC X(15)  VALUE '            TAX'.
002470   03  WS-S-CAPT-UP            PIC X(15)  VALUE '       UPCHARGE'.
002480   03  WS-S-CAPT-GA            PIC X(15)  VALUE 'GAS ADJUSTMENTS'.
002490   03  WS-S-CAPT-CA            PIC X(15)  VALUE '   CAPS APPLIED'.
002500   03  WS-S-CAPT-RA            PIC X(15)  VALUE 'REBATE ACCRUALS'.
002510   03  WS-S-CAPT-NR            PIC X(15)  VALUE '    NET REVENUE'.
002520*
002530 01  WS-SYSOUT-REPORT-LINES.
002540   03  WS-SRL-HEADING             PIC X(48)      VALUE
002550               '          TOTALS:         OLD             NEW   '.
002560   03  WS-SRL-DETAIL                             VALUE SPACE.
002570     05  FILLER                   PIC X(2).
002580     05  WS-SRL-D-CAPT            PIC X(15).
002590     05  WS-SRL-D-AMT-O-X         PIC X(15).
002600     05  WS-SRL-D-AMT-O  REDEFINES  WS-SRL-D-AMT-O-X
002610                               PIC ----,---,--9.99.
002620     05  FILLER  REDEFINES  WS-SRL-D-AMT-O.
002630       07  WS-SRL-D-QTY-O      PIC ----,---,--9.
002640       07  FILLER              PIC X(3).
002650     05  FILLER                   PIC X.
002660     05  WS-SRL-D-AMT-N-X         PIC X(15).
002670     05  WS-SRL-D-AMT-N  REDEFINES  WS-SRL-D-AMT-N-X
002680                               PIC ----,---,--9.99.
002690     05  FILLER  REDEFINES  WS-SRL-D-AMT-N.
002700       07  WS-SRL-D-QTY-N      PIC ----,---,--9.
002710       07  FILLER              PIC X(3).
002720*
002730*
002740 01  WS-CLOSING-DISPLAYS.
002750   03  WS-RETURN-CODE-LINE.
002760     05  FILLER                  PIC X(14) VALUE 'RETURN CODE = '.
002770     05  WS-RETURN-CODE           PIC 9(2)       DISPLAY VALUE 00.
002780     05  FILLER                   PIC X          VALUE '.'.
002790*
002800 COPY CPY004.
002810*
002820*
002830 01  WS-PROGRAM-NUMBER            PIC X(8)       VALUE 'BIL02401'.
002840 01  WS-REVISION-DATE             PIC X(8)       VALUE '09-02-14'.
002850*
002860*
002870 PROCEDURE DIVISION.
002880*
002890*
002900   0000-MAIN-LINE.
002910     PERFORM 8000-INITIALIZE.
002920     PERFORM 1000-PROCESS-INPUTS.
002930     PERFORM 2000-REPORT-TO-EXCEL.
002940     PERFORM 3000-REPORT-TO-SYSOUT.
002950     PERFORM 9000-CLOSE.
002960     STOP RUN.
002970*
002980*
002990   1000-PROCESS-INPUTS.
003000     PERFORM
003010         WITH TEST BEFORE
003020         UNTIL END-I545O-FILE
003030       ADD 1 TO WS-A-I545O-TRANS
003040       ADD O545-UNITS TO WS-A-I545O-UNITS
003050       ADD O545-NORMAL-BASE TO WS-A-I545O-N-B
003060       ADD O545-NORMAL-DELIVERY TO WS-A-I545O-N-D
003070       ADD O545-REPORT-BASE TO WS-A-I545O-R-B
003080       ADD O545-REPORT-DELIVERY TO WS-A-I545O-R-D
003090       ADD O545-TAX TO WS-A-I545O-TAX
003100       ADD O545-UPCHARGE TO WS-A-I545O-UPCH
003110       ADD O545-GAS-ADJUSTMENTS TO WS-A-I545O-GAS
003120       ADD O545-CAPS-APPLIED TO WS-A-I545O-CAPS
003130       PERFORM 1100-READ-I545O-FILE
003140     END-PERFORM.
003150     PERFORM
003160         WITH TEST BEFORE
003170         UNTIL END-I875O-FILE
003180       SUBTRACT O875-WEEK-CONSIDERATION FROM WS-A-I875O-ACCR
003190       PERFORM 1200-READ-I875O-FILE
003200     END-PERFORM.
003210     ADD WS-A-I545O-R-B WS-A-I545O-R-D WS-A-I875O-ACCR GIVING
003220           WS-A-OLD-NET.
003230     PERFORM
003240         WITH TEST BEFORE
003250         UNTIL END-I545N-FILE
003260       ADD 1 TO WS-A-I545N-TRANS
003270       ADD I545-UNITS TO WS-A-I545N-UNITS
003280       ADD I545-NORMAL-BASE TO WS-A-I545N-N-B
003290       ADD I545-NORMAL-DELIVERY TO WS-A-I545N-N-D
003300       ADD I545-REPORT-BASE TO WS-A-I545N-R-B
003310       ADD I545-REPORT-DELIVERY TO WS-A-I545N-R-D
003320       ADD I545-TAX TO WS-A-I545N-TAX
003330       ADD I545-UPCHARGE TO WS-A-I545N-UPCH
003340       ADD I545-GAS-ADJUSTMENTS TO WS-A-I545N-GAS
003350       ADD I545-CAPS-APPLIED TO WS-A-I545N-CAPS
003360       PERFORM 1300-READ-I545N-FILE
003370     END-PERFORM.
003380     PERFORM
003390         WITH TEST BEFORE
003400         UNTIL END-I875N-FILE
003410       SUBTRACT I875-WEEK-CONSIDERATION FROM WS-A-I875N-ACCR
003420       PERFORM 1400-READ-I875N-FILE
003430     END-PERFORM.
003440     ADD WS-A-I545N-R-B WS-A-I545N-R-D WS-A-I875N-ACCR GIVING
003450           WS-A-NEW-NET.
003460*
003470   1100-READ-I545O-FILE.
003480     READ I545O-FILE
003490       AT END
003500         MOVE 'E' TO WS-I545O-FILE-FLAG
003510     END-READ.
003520*
003530   1200-READ-I875O-FILE.
003540     READ I875O-FILE
003550       AT END
003560         MOVE 'E' TO WS-I875O-FILE-FLAG
003570     END-READ.
003580*
003590   1300-READ-I545N-FILE.
003600     READ I545N-FILE
003610       AT END
003620         MOVE 'E' TO WS-I545N-FILE-FLAG
003630     END-READ.
003640*
003650   1400-READ-I875N-FILE.
003660     READ I875N-FILE
003670       AT END
003680         MOVE 'E' TO WS-I875N-FILE-FLAG
003690     END-READ.
003700*
003710*
003720   2000-REPORT-TO-EXCEL.
003730     MOVE SPACE TO OEXCEL-REC.
003740     MOVE X'09' TO OX-TAB-01 OX-TAB-02 OX-TAB-03 OX-TAB-04
003750           OX-TAB-05 OX-TAB-06 OX-TAB-07 OX-TAB-08 OX-TAB-09
003760           OX-TAB-10 OX-TAB-11 OX-TAB-12 OX-TAB-13 OX-TAB-14
003770           OX-TAB-15 OX-TAB-16 OX-TAB-17 OX-TAB-18 OX-TAB-19
003780           OX-TAB-20 OX-TAB-21 OX-TAB-22 OX-TAB-23 OX-TAB-24
003790           OX-TAB-25 OX-TAB-26 OX-TAB-27 OX-TAB-28 OX-TAB-29
003800           OX-TAB-30 OX-TAB-31 OX-TAB-32 OX-TAB-33 OX-TAB-34
003810           OX-TAB-35 OX-TAB-36 OX-TAB-37 OX-TAB-38.
003820     MOVE WS-A-I545O-TRANS TO OX-OLD-TRS.
003830     MOVE WS-A-I545N-TRANS TO OX-NEW-TRS.
003840     MOVE WS-A-I545O-UNITS TO OX-OLD-UNITS.
003850     MOVE WS-A-I545N-UNITS TO OX-NEW-UNITS.
003860     MOVE WS-A-I545O-R-B TO OX-OLD-RB.
003870     MOVE WS-A-I545N-R-B TO OX-NEW-RB.
003880     MOVE WS-A-I545O-R-D TO OX-OLD-RD.
003890     MOVE WS-A-I545N-R-D TO OX-NEW-RD.
003900     MOVE WS-A-I545O-TAX TO OX-OLD-TX.
003910     MOVE WS-A-I545N-TAX TO OX-NEW-TX.
003920     MOVE WS-A-I545O-UPCH TO OX-OLD-UP.
003930     MOVE WS-A-I545N-UPCH TO OX-NEW-UP.
003940     MOVE WS-A-I545O-GAS TO OX-OLD-GAS.
003950     MOVE WS-A-I545N-GAS TO OX-NEW-GAS.
003960     MOVE WS-A-I545O-CAPS TO OX-OLD-CAP.
003970     MOVE WS-A-I545N-CAPS TO OX-NEW-CAP.
003980     MOVE WS-A-I875O-ACCR TO OX-OLD-RA.
003990     MOVE WS-A-I875N-ACCR TO OX-NEW-RA.
004000     MOVE WS-A-OLD-NET TO OX-OLD-NET.
004010     MOVE WS-A-NEW-NET TO OX-NEW-NET.
004020     WRITE OEXCEL-REC.
004030*
004040*
004050   3000-REPORT-TO-SYSOUT.
004060     DISPLAY WS-SRL-HEADING UPON SYSOUT.
004070     MOVE WS-S-CAPT-TR TO WS-SRL-D-CAPT.
004080     MOVE WS-A-I545O-TRANS TO WS-SRL-D-QTY-O.
004090     MOVE WS-A-I545N-TRANS TO WS-SRL-D-QTY-N.
004100     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004110     MOVE WS-S-CAPT-UN TO WS-SRL-D-CAPT.
004120     MOVE WS-A-I545O-UNITS TO WS-SRL-D-QTY-O.
004130     MOVE WS-A-I545N-UNITS TO WS-SRL-D-QTY-N.
004140     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004150     MOVE WS-S-CAPT-NB TO WS-SRL-D-CAPT.
004160     MOVE WS-A-I545O-N-B TO WS-SRL-D-AMT-O.
004170     MOVE WS-A-I545N-N-B TO WS-SRL-D-AMT-N.
004180     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004190     MOVE WS-S-CAPT-ND TO WS-SRL-D-CAPT.
004200     MOVE WS-A-I545O-N-D TO WS-SRL-D-AMT-O.
004210     MOVE WS-A-I545N-N-D TO WS-SRL-D-AMT-N.
004220     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004230     MOVE WS-S-CAPT-RB TO WS-SRL-D-CAPT.
004240     MOVE WS-A-I545O-R-B TO WS-SRL-D-AMT-O.
004250     MOVE WS-A-I545N-R-B TO WS-SRL-D-AMT-N.
004260     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004270     MOVE WS-S-CAPT-RD TO WS-SRL-D-CAPT.
004280     MOVE WS-A-I545O-R-D TO WS-SRL-D-AMT-O.
004290     MOVE WS-A-I545N-R-D TO WS-SRL-D-AMT-N.
004300     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004310     MOVE WS-S-CAPT-TX TO WS-SRL-D-CAPT.
004320     MOVE WS-A-I545O-TAX TO WS-SRL-D-AMT-O.
004330     MOVE WS-A-I545N-TAX TO WS-SRL-D-AMT-N.
004340     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004350     MOVE WS-S-CAPT-UP TO WS-SRL-D-CAPT.
004360     MOVE WS-A-I545O-UPCH TO WS-SRL-D-AMT-O.
004370     MOVE WS-A-I545N-UPCH TO WS-SRL-D-AMT-N.
004380     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004390     MOVE WS-S-CAPT-GA TO WS-SRL-D-CAPT.
004400     MOVE WS-A-I545O-GAS TO WS-SRL-D-AMT-O.
004410     MOVE WS-A-I545N-GAS TO WS-SRL-D-AMT-N.
004420     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004430     MOVE WS-S-CAPT-CA TO WS-SRL-D-CAPT.
004440     MOVE WS-A-I545O-CAPS TO WS-SRL-D-AMT-O.
004450     MOVE WS-A-I545N-CAPS TO WS-SRL-D-AMT-N.
004460     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004470     MOVE WS-S-CAPT-RA TO WS-SRL-D-CAPT.
004480     MOVE WS-A-I875O-ACCR TO WS-SRL-D-AMT-O.
004490     MOVE WS-A-I875N-ACCR TO WS-SRL-D-AMT-N.
004500     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004510     MOVE WS-S-CAPT-NR TO WS-SRL-D-CAPT.
004520     MOVE WS-A-OLD-NET TO WS-SRL-D-AMT-O.
004530     MOVE WS-A-NEW-NET TO WS-SRL-D-AMT-N.
004540     DISPLAY WS-SRL-DETAIL UPON SYSOUT.
004550*
004560*
004570   8000-INITIALIZE.
004580*
004590 COPY CPY005.
004600*
004610*
004620     OPEN OUTPUT OEXCEL-FILE
004630         INPUT I875N-FILE I545N-FILE I875O-FILE I545O-FILE.
004640     PERFORM 1100-READ-I545O-FILE.
004650     IF END-I545O-FILE
004660       DISPLAY '* I545O IS AN EMPTY FILE *' UPON SYSOUT
004670       GO TO 9900-DISPLAY-ABORT.
004680     PERFORM 1300-READ-I545N-FILE.
004690     IF END-I545N-FILE
004700       DISPLAY '* I545N IS AN EMPTY FILE *' UPON SYSOUT
004710       GO TO 9900-DISPLAY-ABORT.
004720     PERFORM 1200-READ-I875O-FILE.
004730     PERFORM 1400-READ-I875N-FILE.
004740     IF END-I875O-FILE
004750       IF END-I875N-FILE
004760         DISPLAY 'I875O & I875N ARE EMPTY FILES.' UPON SYSOUT
004770         MOVE 'Y' TO WS-RETURN-04-FLAG
004780       ELSE
004790         DISPLAY '* I875O IS AN EMPTY FILE, WHILE I875N IS NOT *'
004800               UPON SYSOUT
004810         GO TO 9900-DISPLAY-ABORT
004820     ELSE
004830       IF END-I875N-FILE
004840         DISPLAY '* I875N IS AN EMPTY FILE, WHILE I875O IS NOT *'
004850               UPON SYSOUT
004860         GO TO 9900-DISPLAY-ABORT.
004870*
004880*
004890   9000-CLOSE.
004900     CLOSE OEXCEL-FILE I875N-FILE I545N-FILE I875O-FILE
004910           I545O-FILE.
004920     IF RETURN-04
004930       MOVE 04 TO RETURN-CODE WS-RETURN-CODE.
004940     DISPLAY WS-RETURN-CODE-LINE UPON SYSOUT.
004950*
004960*
004970   9900-DISPLAY-ABORT.
004980     DISPLAY '* ' WS-PROGRAM-NUMBER ' * RUN ABORTED *'
004990           UPON SYSOUT.
005000     MOVE 16 TO RETURN-CODE WS-RETURN-CODE.
005010     DISPLAY WS-RETURN-CODE-LINE UPON SYSOUT.
005020     STOP RUN.
005030*
005040*
