000010 cbl sql('QUALIFIER CICS BINDFILE')
000020 IDENTIFICATION DIVISION.
000030   PROGRAM-ID. "bil02300".
000040*PROGRAM-NAME. AUDIT 552/554/877/8934 PRODUCTS.
000050   AUTHOR. JACK MASON, DAHL CONSULTING.
000060   INSTALLATION. DELUXE CORPORATION.
000070   DATE-WRITTEN. 02-14-11.
000080   DATE-COMPILED.
000090******************************************************************        
000100*
000110*RUN INSTRUCTIONS                                         02-14-11
000120*
000130*I58      = 58 INPUT FROM BIL570                       LRECL=250
000140*           UNIVERSAL PRODUCT CODE FILE
000150*
000160*I551     = 551 INPUT FROM BIL511             VARIABLE LRECL=1273
000170*           MASTER PRICE FILE
000180*
000190*I552U    = 552 INPUT FROM BIL506             VARIABLE LRECL=14069
000200*           PRICE ADJUSTMENT (GAS) FILE - "U" FILE
000210*
000220*I552T    = 552 INPUT FROM BIL506             VARIABLE LRECL=14069
000230*           PRICE ADJUSTMENT (GAS) FILE - "T" FILE
000240*
000250*I554U    = 554 INPUT FROM BIL508             VARIABLE LRECL=27459
000260*           UPCHARGE FILE - "U" FILE
000270*
000280*I554T    = 554 INPUT FROM BIL507             VARIABLE LRECL=27459
000290*           UPCHARGE FILE - "T" FILE
000300*
000310*I877     = 877 INPUT FROM BIL616                      LRECL=182
000320*           CONSIDERATION CONTROL FILE
000330*
000340*I8934    = 8934 INPUT FROM BIL160            VARIABLE LRECL=7246
000350*           CLUB PROGRAMS UPDATE FILE - "SPACE" FILE
000360*
000370*I8934T   = 8934 INPUT FROM BIL160            VARIABLE LRECL=7246
000380*           CLUB PROGRAMS UPDATE FILE - "T" FILE
000390*
000400*I1128P   = C1128 INPUT FROM PARMLIB                   LRECL=80
000410*           NATIONAL REBATE/G.A.S. EXCLUSION FILE
000420*
000430*I1130P   = C1130 INPUT FROM PARMLIB                   LRECL=80
000440*           REGIONAL I1128P OVERRIDE FILE
000450*
000460*I1220P   = C1220 INPUT FROM PARMLIB                   LRECL=80
000470*           PRICE DESIGNATION CODE TRANSLATION TABLE
000480*
000490*PRINTER1 = NONFUNCTIONING ENTRIES/RECORDS
000500*                         132 CHARACTERS PER LINE (FBA LRECL=133)
000510*
000520*SYSOUT   = REVISION INFO & ERROR MESSAGES; ANY PAPER
000530*
000540******************************************************************        
000550*
000560*RETURN CODES                                             02-14-11
000570*
000580*  16 = RUN ABORTED.  SEE SYSOUT.
000590*         - EMPTY FILE (EXCEPT "TEST" AND I1130P FILES)
000600*         - SEQUENCE ERROR
000610*         - TABLE OVERFLOW
000620*         - VSAM ERROR (EXCEPT ON CLOSE)
000630*         - I1220P MISSING GENERIC PRICE DESIGNATION 'A1', OR
000640*             POINTS IT TO A PRICE DESIGNATION NOT ON I551
000650*
000660*  08 = ERROR.  RUN CONTINUED.  SEE SYSOUT.
000670*         - MISSING I551 RECORD FOR I58 PRODUCT
000680*
000690*  07 = WARNING.  RUN CONTINUED.  SEE SYSOUT.
000700*         - TABLE OVER 80% FULL
000710*
000720*  04 = INFO ONLY.  RUN CONTINUED.  SEE SYSOUT.
000730*         - EMPTY I1130P OR "TEST" FILE
000740*         - VSAM ERROR ON CLOSE
000750*
000760******************************************************************        
000770*
000780*NARRATIVE                                                02-14-11
000790*
000800*PURPOSE:
000810*  TO IDENTIFY PRODUCT ENTRIES (OR 877 PRODUCT RECORDS) WHICH WILL
000820*    NOT FUNCTION DUE TO ABSENCE OF ANY MATCHING 58 FILE PRODUCTS
000830*    OR TO HAVING ALL MATCHING PRODUCTS BLOCKED (BY OTHER ENTRIES/
000840*    RECORDS AND/OR BY C1128 WITHOUT OVERRIDE).
000850*
000860*SOURCE OF INFORMATION:
000870*  THE 58 FILE IN PRODUCT, DQ ORDER
000880*    SORT FIELDS=(1,16,A),
000890*    NO SORT SHOULD BE NEEDED - FILE MAINTAINED IN THIS ORDER.
000900*  THE 551 FILE - VSAM.
000910*  THE 552U FILE - VSAM.
000920*  THE 552T FILE - VSAM.
000930*  THE 554U FILE - VSAM.
000940*  THE 554T FILE - VSAM.
000950*  THE 877 FILE IN CONSID#, REC TYPE, SEQ# ORDER
000960*    SORT FIELDS=(1,9,A),
000970*    NO SORT SHOULD BE NEEDED - FILE MAINTAINED IN THIS ORDER.
000980*  THE 8934 FILE - VSAM.
000990*  THE 8934T FILE - VSAM.
001000*  THE C1128 CARDS IN ANY ORDER.
001010*  THE C1130 CARDS IN CONSID# ORDER
001020*    SORT FIELDS=(1,5,A).
001030*  THE C1220 CARD.
001040*
001050*PROGRAM FLOW:
001060*  IN INITIALIZATION, AFTER THE MANDITORY SYSOUT DISPLAY, THIS
001070*    PROGRAM OPENS FILES, PERFORMS INITIAL READS (CHECKING AGAINST
001080*    EMPTY INPUTS), OBTAINS THE CURRENT PRICE DESIGNATION FROM
001090*    I1220P'S TRANSLATION OF GENERIC 'A1', AND INSTALLS THE DATE
001100*    INTO THE PRINT FILE'S HEADING1.
001110*  NEXT, THE PROGRAM BUILDS A TABLE OF PRODUCT INFORMATION.
001120*    - FIRST IT BUILDS A TEMPORARY TABLE OF ALL C1128 CARDS WITH
001130*      AN EXPENSE CODE OF '**'.
001140*    - THEN IT BUILDS A TABLE OF 58 NON-GENRIC PRODUCT RECORDS,
001150*      WHILE APPENDING THE 551 ATTRIBUTE (FROM THE CURRENT PRICE
001160*      DESIGNATION) AND (WHERE APPLICABLE) THE C1128 CODE.  THE
001170*      ATTRIBUTE WILL BE USED IN PROCESSING THE 554 FILES.  THE
001180*      C1128 CODE IS FOR THE 552 AND 877 FILES.
001190*  FOR THE DURATION OF THE RUN, THE PROGRAM PROCESSES EACH RECORD
001200*    TYPE (552A, 552G, 552S, 554, 877, 8934), LIVE RECORDS FIRST,
001210*    AND THEN TEST (EXCEPT FOR 877 WHICH HAS NONE).
001220*  THESE ROUTINES VARY SLIGHTLY; FOR EXAMPLE, THE 554 IS CHECKED
001230*    MORE-SPECIFIC FIRST, WHILE THE 877 IS CHECKED IN "SEQUENCE
001240*    NUMBER" ORDER.  BUT GENERALLY THEY CHECK THAT EACH ENTRY OR
001250*    RECORD CAN FUNCTION - THAT IT HAS AT LEAST ONE 58 PRODUCT
001260*    MATCH THAT IS NOT BLOCKED BY AN EARLIER ENTRY/RECORD, AND
001270*    (WHERE APPLICABLE) ISN'T BLOCKED BY AN UNOVERRIDDEN C1128.
001280*  ANY INSTANCES WHERE AN ENTRY (OR 877 '5' RECORD) DOES NOT HAVE
001290*    AN UNOBSTRUCTED MATCH ARE REPORTED ON PRINTER1.
001300*  WHEN ALL RECORD TYPES HAVE BEEN PROCESSED, THE PROGRAM CLOSES
001310*    FILES AND ENDS.
001320*
001330******************************************************************        
001340*
001350*REVISION HISTORY
001360*
001370*02-14-11  PROGRAM WRITTEN.  PART OF SIMPLIFICATION PROJECT.
001380*          IMS ISSUE=JDBT-6VJSF9.                   JACK MASON  01
001390*
001400******************************************************************        
001410*
001420 ENVIRONMENT DIVISION.
001430 CONFIGURATION SECTION.
001440   SOURCE-COMPUTER. UNIX.   
001450   OBJECT-COMPUTER. UNIX.   
001460*
001470 INPUT-OUTPUT SECTION.
001480   FILE-CONTROL.
001490     SELECT I58-FILE      ASSIGN RSD-I58.
001500     SELECT I551-FILE     ASSIGN I551
001510                            ORGANIZATION IS INDEXED
001520                            ACCESS MODE IS DYNAMIC
001530                            RECORD KEY IS I551-MP-KEY
001540                            FILE STATUS IS WS-I551-FILE-STATUS.
001550     SELECT I552U-FILE    ASSIGN I552U
001560                            ORGANIZATION IS INDEXED
001570                            ACCESS MODE IS SEQUENTIAL
001580                            RECORD KEY IS I552-KEY
001590                            FILE STATUS IS WS-I552U-FILE-STATUS.
001600     SELECT I552T-FILE    ASSIGN I552T
001610                            ORGANIZATION IS INDEXED
001620                            ACCESS MODE IS SEQUENTIAL
001630                            RECORD KEY IS O552-KEY
001640                            FILE STATUS IS WS-I552T-FILE-STATUS.
001650     SELECT I554U-FILE    ASSIGN I554U
001660                            ORGANIZATION IS INDEXED
001670                            ACCESS MODE IS SEQUENTIAL
001680                            RECORD KEY IS I554-KEY
001690                            FILE STATUS IS WS-I554U-FILE-STATUS.
001700     SELECT I554T-FILE    ASSIGN I554T
001710                            ORGANIZATION IS INDEXED
001720                            ACCESS MODE IS SEQUENTIAL
001730                            RECORD KEY IS O554-KEY
001740                            FILE STATUS IS WS-I554T-FILE-STATUS.
001750     SELECT I877-FILE     ASSIGN RSD-I877.
001760     SELECT I8934-FILE    ASSIGN I8934
001770                            ORGANIZATION IS INDEXED
001780                            ACCESS MODE IS SEQUENTIAL
001790                            RECORD KEY IS I8934-KEY
001800                            FILE STATUS IS WS-I8934-FILE-STATUS.
001810     SELECT I8934T-FILE   ASSIGN I8934T
001820                            ORGANIZATION IS INDEXED
001830                            ACCESS MODE IS SEQUENTIAL
001840                            RECORD KEY IS O8934-KEY
001850                            FILE STATUS IS WS-I8934T-FILE-STATUS.
001860     SELECT I1128P-FILE   ASSIGN RSD-I1128P.
001870     SELECT I1130P-FILE   ASSIGN RSD-I1130P.
001880     SELECT I1220P-FILE   ASSIGN RSD-I1220P.
001890     SELECT PRINTER1-FILE ASSIGN PRINTER1 
001900                            ORGANIZATION IS LINE SEQUENTIAL.
001910*
001920 DATA DIVISION.
001930 FILE SECTION.
001940*
001950 FD  I58-FILE
001960*
001970 COPY T0058I.
001980*
001990*
002000 FD  I551-FILE
002010*
002020 COPY T0551I.
002030*
002040*
002050 FD  I552U-FILE
002060*
002070 COPY T0552I.
002080*
002090*
002100 FD  I552T-FILE
002110*
002120 COPY T0552O.
002130*
002140*
002150 FD  I554U-FILE
002160*
002170 COPY T0554I.
002180*
002190*
002200 FD  I554T-FILE
002210*
002220 COPY T0554O.
002230*
002240*
002250 FD  I877-FILE
002260*
002270 COPY T0877I.
002280*
002290*
002300 FD  I8934-FILE
002310*
002320 COPY T8934I.
002330*
002340*
002350 FD  I8934T-FILE
002360*
002370 COPY T8934O.
002380*
002390*
002400 FD  I1128P-FILE
002410     RECORDING MODE IS F
002420     BLOCK CONTAINS 0 RECORDS
002430     RECORD CONTAINS 80 CHARACTERS
002440     LABEL RECORDS STANDARD.
002450   01  I1128P-REC.
002460     03  I1128P-PROD-13.
002470       05  I1128P-PROD-EXP                       PIC X(2).
002480       05  I1128P-PROD-11                        PIC X(11).
002490     03  FILLER                                  PIC X.
002500     03  I1128P-BLOCK-CODE                       PIC X.
002510     03  FILLER                                  PIC X(65).
002520*
002530 FD  I1130P-FILE
002540     RECORDING MODE IS F
002550     BLOCK CONTAINS 0 RECORDS
002560     RECORD CONTAINS 80 CHARACTERS
002570     LABEL RECORDS STANDARD.
002580   01  I1130P-REC.
002590     03  I1130P-CONSID-NBR                       PIC X(5).
002600     03  FILLER                                  PIC X.
002610     03  I1130P-PROD-13                          PIC X(13).
002620     03  FILLER                                  PIC X(61).
002630*
002640 FD  I1220P-FILE
002650     RECORDING MODE IS F
002660     BLOCK CONTAINS 0 RECORDS
002670     RECORD CONTAINS 80 CHARACTERS
002680     LABEL RECORDS STANDARD.
002690   01  I1220P-REC.
002700     03  I1220P-PR-DES-PAIRS.
002710       05  I1220P-PR-DES-PAIR
002720                                                 OCCURS 10 TIMES
002730                                                 INDEXED BY
002740                                                   I1220P-IX.
002750         07  I1220P-GENERIC-PR-DES               PIC X(2).
002760         07  I1220P-SPECIFIC-PR-DES              PIC X(2).
002770     03  FILLER                                  PIC X(40).
002780*
002790 FD  PRINTER1-FILE
002800     RECORDING MODE IS F
002810     BLOCK CONTAINS 0 RECORDS
002820     RECORD CONTAINS 132 CHARACTERS
002830     LABEL RECORDS OMITTED.
002840   01  PR1-REC                                   PIC X(132).
002850*
002860 WORKING-STORAGE SECTION.
002870*
002880 COPY TDLXMIGE.
002890     EXEC SQL INCLUDE SQLCA END-EXEC.
002900*
002910 01  WS-FLAGS-AND-SUCH                           VALUE SPACES.
002920   03  WS-I551-FILE-STATUS        PIC X(2).
002930     88  WS-I551-SUCCESSFUL         VALUE '00'.
002940     88  WS-I551-END-OF-FILE        VALUE '10'.
002950     88  WS-I551-NO-SUCH-RECORD     VALUES '20', '23'.
002960     88  WS-I551-SUCCESSFUL-OPEN    VALUES '00', '97'.
002970   03  WS-I552U-FILE-STATUS       PIC X(2).
002980     88  WS-I552U-SUCCESSFUL        VALUE '00'.
002990     88  WS-I552U-END-OF-FILE       VALUE '10'.
003000     88  WS-I552U-SUCCESSFUL-OPEN   VALUES '00', '97'.
003010   03  WS-I552T-FILE-STATUS       PIC X(2).
003020     88  WS-I552T-SUCCESSFUL        VALUE '00'.
003030     88  WS-I552T-END-OF-FILE       VALUE '10'.
003040     88  WS-I552T-SUCCESSFUL-OPEN   VALUES '00', '97'.
003050   03  WS-I554U-FILE-STATUS       PIC X(2).
003060     88  WS-I554U-SUCCESSFUL        VALUE '00'.
003070     88  WS-I554U-END-OF-FILE       VALUE '10'.
003080     88  WS-I554U-SUCCESSFUL-OPEN   VALUES '00', '97'.
003090   03  WS-I554T-FILE-STATUS       PIC X(2).
003100     88  WS-I554T-SUCCESSFUL        VALUE '00'.
003110     88  WS-I554T-END-OF-FILE       VALUE '10'.
003120     88  WS-I554T-SUCCESSFUL-OPEN   VALUES '00', '97'.
003130   03  WS-I8934-FILE-STATUS       PIC X(2).
003140     88  WS-I8934-SUCCESSFUL        VALUE '00'.
003150     88  WS-I8934-END-OF-FILE       VALUE '10'.
003160     88  WS-I8934-SUCCESSFUL-OPEN   VALUES '00', '97'.
003170   03  WS-I8934T-FILE-STATUS      PIC X(2).
003180     88  WS-I8934T-SUCCESSFUL       VALUE '00'.
003190     88  WS-I8934T-END-OF-FILE      VALUE '10'.
003200     88  WS-I8934T-SUCCESSFUL-OPEN  VALUES '00', '97'.
003210   03  WS-I551-FILE-FLAG          PIC X.
003220     88  OPENED-I551-FILE           VALUE 'Y'.
003230   03  WS-I552U-FILE-FLAG         PIC X.
003240     88  OPENED-I552U-FILE          VALUE 'Y'.
003250   03  WS-I552T-FILE-FLAG         PIC X.
003260     88  OPENED-I552T-FILE          VALUE 'Y'.
003270   03  WS-I554U-FILE-FLAG         PIC X.
003280     88  OPENED-I554U-FILE          VALUE 'Y'.
003290   03  WS-I554T-FILE-FLAG         PIC X.
003300     88  OPENED-I554T-FILE          VALUE 'Y'.
003310   03  WS-I8934-FILE-FLAG         PIC X.
003320     88  OPENED-I8934-FILE          VALUE 'Y'.
003330   03  WS-I8934T-FILE-FLAG        PIC X.
003340     88  OPENED-I8934T-FILE         VALUE 'Y'.
003350   03  WS-I58-FILE-FLAG           PIC X.
003360     88  END-I58-FILE               VALUE 'E'.
003370   03  WS-I877-FILE-FLAG          PIC X.
003380     88  END-I877-FILE              VALUE 'E'.
003390   03  WS-I1128P-FILE-FLAG        PIC X.
003400     88  END-I1128P-FILE            VALUE 'E'.
003410   03  WS-I1130P-FILE-FLAG        PIC X.
003420     88  END-I1130P-FILE            VALUE 'E'.
003430   03  WS-FOUND-FLAG              PIC X.
003440     88  STILL-LOOKING              VALUE SPACE.
003450     88  FOUND-IT                   VALUE 'Y'.
003460     88  NOT-FOUND                  VALUE 'N'.
003470   03  WS-ENTRY-FLAGS.
003480     05  WS-ENTRY-GOOD-MATCH-FLAG PIC X.
003490       88  GOOD-MATCH-FOUND         VALUE 'Y'.
003500     05  WS-ENTRY-C1128-FLAG      PIC X.
003510       88  C1128-BLOCK-FOUND        VALUE 'Y'.
003520     05  WS-ENTRY-OTHER-FLAG      PIC X.
003530       88  OTHER-BLOCK-FOUND        VALUE 'Y'.
003540   03  WS-RETURN-08-FLAG          PIC X.
003550     88  RETURN-08                  VALUE 'Y'.
003560   03  WS-RETURN-07-FLAG          PIC X.
003570     88  RETURN-07                  VALUE 'Y'.
003580   03  WS-RETURN-04-FLAG          PIC X.
003590     88  RETURN-04                  VALUE 'Y'.
003600*
003610 01  WS-SEQUENCES                                VALUE LOW-VALUES.
003620   03  WS-I58-SEQ.
003630     05  WS-I58-SEQ-PROD-10       PIC X(10).
003640     05  WS-I58-SEQ-PROD-SFX      PIC X.
003650     05  WS-I58-SEQ-DQ            PIC X(5).
003660   03  WS-I877-SEQ.
003670     05  WS-I877-CONSID-NBR       PIC X(5).
003680     05  WS-I877-REC-TYPE         PIC X.
003690     05  WS-I877-REC-NBR          PIC X(3).
003700   03  WS-I1130P-CONSID-NBR       PIC X(5).
003710*
003720 01  WS-PRINT-CONTROLS.
003730   03  WS-LINE-COUNT              PIC 9(3)       COMP VALUE 90.
003740*
003750 01  WS-HEADINGS-ETC.
003760   03  WS-HEADING-1.
003770     05  FILLER                   PIC X          VALUE '-'.
003780     05  WS-HD1-PROGRAM-NUMBER    PIC X(8)       VALUE SPACE.
003790     05  FILLER                   PIC X(38)      VALUE '-'.
003800     05  WS-HD1-CENTER            PIC X(38)      VALUE SPACE.
003810     05  FILLER                   PIC X(27)      VALUE SPACE.
003820     05  FILLER                   PIC X(10)    VALUE 'RUN DATE: '.
003830     05  WS-HD1-RUN-DATE                       VALUE '  -  -    '.
003840       07  WS-HD1-RUN-MONTH       PIC X(2).
003850       07  FILLER                 PIC X.
003860       07  WS-HD1-RUN-DAY         PIC X(2).
003870       07  FILLER                 PIC X.
003880       07  WS-HD1-RUN-YEAR        PIC X(4).
003890   03  WS-HEADING-2               PIC X(132)   VALUE SPACE.
003900   03  WS-DETAIL-LINE             PIC X(132)   VALUE SPACE.
003910   03  WS-DTL-552AS-LINE  REDEFINES  WS-DETAIL-LINE.
003920     05  FILLER                   PIC X(2).
003930     05  WS-DTL-552AS-FILE        PIC X(4).
003940     05  FILLER                   PIC X(2).
003950     05  WS-DTL-552AS-REC-KEY     PIC X(46).
003960     05  FILLER                   PIC X(3).
003970     05  WS-DTL-552AS-PROD-13     PIC X(13).
003980     05  FILLER                   PIC X(2).
003990     05  WS-DTL-552AS-DQ          PIC X(5).
004000     05  FILLER                   PIC X(3).
004010     05  WS-DTL-552AS-REO         PIC X.
004020     05  FILLER                   PIC X(4).
004030     05  WS-DTL-552AS-UNITS       PIC X(2).
004040     05  FILLER                   PIC X(4).
004050     05  WS-DTL-552AS-ORD-CH      PIC X.
004060     05  FILLER                   PIC X(4).
004070     05  WS-DTL-552AS-REASON      PIC X(36).
004080   03  WS-DTL-552G-LINE  REDEFINES  WS-DETAIL-LINE.
004090     05  FILLER                   PIC X(2).
004100     05  WS-DTL-552G-FILE         PIC X(4).
004110     05  FILLER                   PIC X(2).
004120     05  WS-DTL-552G-REC-KEY      PIC X(46).
004130     05  FILLER                   PIC X(4).
004140     05  WS-DTL-552G-ENT-TYP      PIC X.
004150     05  FILLER                   PIC X(3).
004160     05  WS-DTL-552G-PROD-13      PIC X(13).
004170     05  FILLER                   PIC X(2).
004180     05  WS-DTL-552G-DQ           PIC X(5).
004190     05  FILLER                   PIC X(3).
004200     05  WS-DTL-552G-MAIL-METH    PIC X.
004210     05  FILLER                   PIC X(4).
004220     05  WS-DTL-552G-PR-SRCE      PIC X.
004230     05  FILLER                   PIC X(5).
004240     05  WS-DTL-552G-REASON       PIC X(36).
004250   03  WS-DTL-554-LINE  REDEFINES  WS-DETAIL-LINE.
004260     05  FILLER                   PIC X(2).
004270     05  WS-DTL-554-FILE          PIC X(4).
004280     05  FILLER                   PIC X(2).
004290     05  WS-DTL-554-REC-KEY       PIC X(46).
004300     05  FILLER                   PIC X(2).
004310     05  WS-DTL-554-PROD-13       PIC X(13).
004320     05  FILLER                   PIC X.
004330     05  WS-DTL-554-DQ            PIC X(5).
004340     05  FILLER                   PIC X(2).
004350     05  WS-DTL-554-UNITS         PIC X(2).
004360     05  FILLER                   PIC X(3).
004370     05  WS-DTL-554-REO           PIC X.
004380     05  FILLER                   PIC X(3).
004390     05  WS-DTL-554-AOE           PIC X.
004400     05  FILLER                   PIC X(2).
004410     05  WS-DTL-554-ATTRS         PIC X(5).
004420     05  FILLER                   PIC X(2).
004430     05  WS-DTL-554-REASON        PIC X(36).
004440   03  WS-DTL-877-LINE  REDEFINES  WS-DETAIL-LINE.
004450     05  FILLER                   PIC X(3).
004460     05  WS-DTL-877-KEY-CONSID    PIC X(5).
004470     05  FILLER                   PIC X.
004480     05  WS-DTL-877-KEY-REC-TYP   PIC X.
004490     05  FILLER                   PIC X.
004500     05  WS-DTL-877-KEY-SEQ-NBR   PIC X(3).
004510     05  FILLER                   PIC X(5).
004520     05  WS-DTL-877-PROD-13       PIC X(13).
004530     05  FILLER                   PIC X(2).
004540     05  WS-DTL-877-DQ            PIC X(5).
004550     05  FILLER                   PIC X(2).
004560     05  WS-DTL-877-UNITS         PIC X(7).
004570     05  FILLER                   PIC X(3).
004580     05  WS-DTL-877-AOE           PIC X.
004590     05  FILLER                   PIC X(4).
004600     05  WS-DTL-877-MED           PIC X.
004610     05  FILLER                   PIC X(4).
004620     05  WS-DTL-877-REO           PIC X.
004630     05  FILLER                   PIC X(3).
004640     05  WS-DTL-877-BC            PIC X(8).
004650     05  FILLER                   PIC X(2).
004660     05  WS-DTL-877-BRCH          PIC X(5).
004670     05  FILLER                   PIC X(4).
004680     05  WS-DTL-877-ORD-CH        PIC X.
004690     05  FILLER                   PIC X(6).
004700     05  WS-DTL-877-REASON        PIC X(36).
004710     05  FILLER                   PIC X(5).
004720   03  WS-DTL-8934-LINE  REDEFINES  WS-DETAIL-LINE.
004730     05  FILLER                   PIC X(2).
004740     05  WS-DTL-8934-FILE         PIC X(4).
004750     05  FILLER                   PIC X(5).
004760     05  WS-DTL-8934-KEY-HC       PIC X(5).
004770     05  FILLER                   PIC X.
004780     05  WS-DTL-8934-KEY-MBC      PIC X(8).
004790     05  FILLER                   PIC X.
004800     05  WS-DTL-8934-KEY-BC       PIC X(8).
004810     05  FILLER                   PIC X.
004820     05  WS-DTL-8934-KEY-EXP      PIC X(2).
004830     05  FILLER                   PIC X(6).
004840     05  WS-DTL-8934-PROD-10      PIC X(10).
004850     05  FILLER                   PIC X(3).
004860     05  WS-DTL-8934-IMP-QTY      PIC -(7)9.
004870     05  FILLER                   PIC X(4).
004880     05  WS-DTL-8934-REO          PIC X.
004890     05  FILLER                   PIC X(7).
004900     05  WS-DTL-8934-ORD-CH       PIC X.
004910     05  FILLER                   PIC X(7).
004920     05  WS-DTL-8934-REASON       PIC X(36).
004930     05  FILLER                   PIC X(12).
004940   03  WS-HD2-552AS.
004950     05  FILLER                   PIC X(44)
004960             VALUE '  FILE  RECORD KEY                          '.
004970     05  FILLER                   PIC X(44)
004980             VALUE '             MATCH PRODUCT   D Q   REO  UNIT'.
004990     05  FILLER                   PIC X(44)
005000             VALUE '  O C   REASON                              '.
005010   03  WS-HD2-552G.
005020     05  FILLER                   PIC X(44)
005030             VALUE '  FILE  RECORD KEY                          '.
005040     05  FILLER                   PIC X(44)
005050             VALUE '             E T  MATCH PRODUCT   D Q   M M '.
005060     05  FILLER                   PIC X(44)
005070             VALUE ' P S    REASON                              '.
005080   03  WS-HD2-554.
005090     05  FILLER                   PIC X(44)
005100             VALUE '  FILE  RECORD KEY                          '.
005110     05  FILLER                   PIC X(44)
005120             VALUE '            MATCH PRODUCT  D Q  UNIT REO AOE'.
005130     05  FILLER                   PIC X(44)
005140             VALUE ' ATTRS  REASON                              '.
005150   03  WS-HD2-877.
005160     05  FILLER                   PIC X(44)
005170             VALUE '   RECORD KEY      MATCH PRODUCT   D Q    UN'.
005180     05  FILLER                   PIC X(44)
005190             VALUE 'ITS   AOE  MED  REO  MATCH BC  BRANCH  O C  '.
005200     05  FILLER                   PIC X(44)
005210             VALUE '   REASON                                   '.
005220   03  WS-HD2-8934.
005230     05  FILLER                   PIC X(44)
005240             VALUE '  FILE     RECORD KEY                     MA'.
005250     05  FILLER                   PIC X(44)
005260             VALUE 'TCH PRODUCT  IMP QTY  REORD  ORD CH     REAS'.
005270     05  FILLER                   PIC X(44)
005280             VALUE 'ON                                          '.
005290   03  WS-HD1-CTR-552A            PIC X(38)
005300                   VALUE ' NONFUNCTIONING 552 ALTERNATE ENTRIES '.
005310   03  WS-HD1-CTR-552G            PIC X(38)
005320                   VALUE ' NONFUNCTIONING 552 GUARANTEE ENTRIES '.
005330   03  WS-HD1-CTR-552S            PIC X(38)
005340                   VALUE '  NONFUNCTIONING 552 SPECIAL ENTRIES  '.
005350   03  WS-HD1-CTR-554             PIC X(38)
005360                   VALUE '      NONFUNCTIONING 554 ENTRIES      '.
005370   03  WS-HD1-CTR-877             PIC X(38)
005380                   VALUE 'NONFUNCTIONING 877 PRODUCT (5) RECORDS'.
005390   03  WS-HD1-CTR-8934            PIC X(38)
005400                   VALUE '     NONFUNCTIONING 8934 ENTRIES      '.
005410   03  WS-DTL-RSN-NO-PROD         PIC X(36)
005420                     VALUE 'NO MATCHING 58 FILE PRODUCT RECORDS '.
005430   03  WS-DTL-RSN-NO-PR-ATTR      PIC X(36)
005440                     VALUE 'NO MATCHING 58/551 PRODUCT/ATTRS    '.
005450   03  WS-DTL-RSN-BLK-ENT         PIC X(36)
005460                     VALUE 'BLOCKED BY OTHER ENTRY/ENTRIES      '.
005470   03  WS-DTL-RSN-BLK-SEQ         PIC X(36)
005480                     VALUE 'BLOCKED BY OTHER SEQUENCE NUMBER(S) '.
005490   03  WS-DTL-RSN-BLK-C1128       PIC X(36)
005500                     VALUE 'BLOCKED BY C1128 WITHOUT OVERRIDE   '.
005510   03  WS-DTL-RSN-BLK-C1128-ENT   PIC X(36)
005520                     VALUE 'BLOCKED BY C1128 & BY OTHER ENTRIES '.
005530   03  WS-DTL-RSN-BLK-C1128-SEQ   PIC X(36)
005540                     VALUE 'BLOCKED BY C1128 & BY OTHER SEQ NBRS'.
005550   03  WS-DTL-LIVE-OR-TEST        PIC X(4)       VALUE SPACE.
005560   03  WS-END-OF-REPORT.
005570     05  FILLER                   PIC X(20)      VALUE ALL '-'.
005580     05  FILLER                 PIC X(15) VALUE ' END OF REPORT '.
005590     05  FILLER                   PIC X(20)      VALUE ALL '-'.
005600*
005610 01  WS-KEY-INFO                  PIC X(46).
005620 01  WS-552-554-KEY-INFO  REDEFINES  WS-KEY-INFO.
005630   03  WS-552-554-SHORT-KEY       PIC X(46).
005640 01  WS-877-KEY-INFO  REDEFINES  WS-KEY-INFO.
005650   03  WS-877-CONSID-NBR          PIC X(5).
005660 01  WS-8934-KEY-INFO  REDEFINES  WS-KEY-INFO.
005670   03  WS-8934-KEY.
005680     05  WS-8934-KEY-HC           PIC X(5).
005690     05  WS-8934-KEY-MBC          PIC X(8).
005700     05  WS-8934-KEY-BC           PIC X(8).
005710     05  WS-8934-KEY-EXP          PIC X(2).
005720*
005730 01  WS-CURR-INFO                 PIC X(45).
005740 01  WS-CURR-552AS-ENTRY  REDEFINES  WS-CURR-INFO.
005750   03  WS-CURR-552AS-PROD-13.
005760     05  WS-CURR-552AS-PROD-BYTE  OCCURS 13 TIMES
005770                                  PIC X.
005780   03  WS-CURR-552AS-DQ           PIC X(5).
005790   03  WS-CURR-552AS-REO          PIC X.
005800   03  WS-CURR-552AS-UNITS        PIC X(2).
005810   03  WS-CURR-552AS-ORD-CH       PIC X.
005820   03  WS-CURR-552AS-C1128-OVR    PIC X.
005830   03  WS-CURR-552AS-BLOCKER-FLG  PIC X.
005840     88  CURR-552AS-IS-BLOCKER      VALUE 'Y'.
005850 01  WS-CURR-552G-ENTRY  REDEFINES  WS-CURR-INFO.
005860   03  WS-CURR-552G-ENT-TYP       PIC X.
005870   03  WS-CURR-552G-PROD-13.
005880     05  WS-CURR-552G-PROD-BYTE   OCCURS 13 TIMES
005890                                  PIC X.
005900   03  WS-CURR-552G-DQ            PIC X(5).
005910   03  WS-CURR-552G-MAIL-METH     PIC X.
005920   03  WS-CURR-552G-PRICE-SRC     PIC X.
005930   03  WS-CURR-552G-C1128-OVR     PIC X.
005940   03  WS-CURR-552G-BLOCKER-FLG   PIC X.
005950     88  CURR-552G-IS-BLOCKER       VALUE 'Y'.
005960 01  WS-CURR-554-ENTRY  REDEFINES  WS-CURR-INFO.
005970   03  WS-CURR-554-PROD-13.
005980     05  WS-CURR-554-PROD-BYTE    OCCURS 13 TIMES
005990                                  PIC X.
006000   03  WS-CURR-554-DQ             PIC X(5).
006010   03  WS-CURR-554-UNITS          PIC X(2).
006020   03  WS-CURR-554-REO            PIC X.
006030   03  WS-CURR-554-AOE            PIC X.
006040   03  WS-CURR-554-ATTRS.
006050     05  WS-CURR-554-ATTR         OCCURS 5 TIMES
006060                                  PIC X.
006070   03  WS-CURR-554-BASIS-1        PIC X.
006080   03  WS-CURR-554-BASIS-2        PIC X.
006090   03  WS-CURR-554-BASIS-3        PIC X.
006100 01  WS-CURR-877-ENTRY  REDEFINES  WS-CURR-INFO.
006110   03  WS-CURR-877-REC-NBR        PIC X(3).
006120   03  WS-CURR-877-PROD-13.
006130     05  WS-CURR-877-PROD-BYTE    OCCURS 13 TIMES
006140                                  PIC X.
006150   03  WS-CURR-877-DQ             PIC X(5).
006160   03  WS-CURR-877-UNITS          PIC X(7).
006170   03  WS-CURR-877-AOE            PIC X.
006180   03  WS-CURR-877-MED            PIC X.
006190   03  WS-CURR-877-REO            PIC X.
006200   03  WS-CURR-877-BC             PIC X(8).
006210   03  WS-CURR-877-BRCH           PIC X(5).
006220   03  WS-CURR-877-ORD-CH         PIC X.
006230   03  WS-CURR-877-BLOCKER-FLG    PIC X.
006240     88  CURR-877-IS-BLOCKER        VALUE 'Y'.
006250 01  WS-CURR-8934-ENTRY  REDEFINES  WS-CURR-INFO.
006260   03  WS-CURR-8934-PROD-10.
006270     05  WS-CURR-8934-PROD-BYTE   OCCURS 10 TIMES
006280                                  PIC X.
006290   03  WS-CURR-8934-IMP-QTY-X.
006300     05  WS-CURR-8934-IMP-QTY-N   PIC S9(7)      DISPLAY.
006310   03  WS-CURR-8934-REO           PIC X.
006320   03  WS-CURR-8934-ORD-CH        PIC X.
006330*
006340 01  WS-CMPR-INFO                 PIC X(45).
006350 01  WS-CMPR-552AS-ENTRY  REDEFINES  WS-CMPR-INFO.
006360   03  WS-CMPR-552AS-PROD-13.
006370     05  WS-CMPR-552AS-PROD-BYTE  OCCURS 13 TIMES
006380                                  PIC X.
006390   03  WS-CMPR-552AS-DQ           PIC X(5).
006400   03  WS-CMPR-552AS-REO          PIC X.
006410   03  WS-CMPR-552AS-UNITS        PIC X(2).
006420   03  WS-CMPR-552AS-ORD-CH       PIC X.
006430   03  FILLER                     PIC X(2).
006440 01  WS-CMPR-552G-ENTRY  REDEFINES  WS-CMPR-INFO.
006450   03  WS-CMPR-552G-ENT-TYP       PIC X.
006460   03  WS-CMPR-552G-PROD-13.
006470     05  WS-CMPR-552G-PROD-BYTE   OCCURS 13 TIMES
006480                                  PIC X.
006490   03  WS-CMPR-552G-DQ            PIC X(5).
006500   03  WS-CMPR-552G-MAIL-METH     PIC X.
006510   03  WS-CMPR-552G-PRICE-SRC     PIC X.
006520   03  FILLER                     PIC X(2).
006530 01  WS-CMPR-554-ENTRY  REDEFINES  WS-CMPR-INFO.
006540   03  WS-CMPR-554-PROD-13.
006550     05  WS-CMPR-554-PROD-BYTE    OCCURS 13 TIMES
006560                                  PIC X.
006570   03  WS-CMPR-554-DQ             PIC X(5).
006580   03  WS-CMPR-554-UNITS          PIC X(2).
006590   03  WS-CMPR-554-REO            PIC X.
006600   03  WS-CMPR-554-AOE            PIC X.
006610   03  WS-CMPR-554-ATTRS.
006620     05  WS-CMPR-554-ATTR         OCCURS 5 TIMES
006630                                  PIC X.
006640   03  WS-CMPR-554-BASIS-1        PIC X.
006650   03  WS-CMPR-554-BASIS-2        PIC X.
006660   03  WS-CMPR-554-BASIS-3        PIC X.
006670 01  WS-CMPR-877-ENTRY  REDEFINES  WS-CMPR-INFO.
006680   03  WS-CMPR-877-REC-NBR        PIC X(3).
006690   03  WS-CMPR-877-PROD-13.
006700     05  WS-CMPR-877-PROD-BYTE    OCCURS 13 TIMES
006710                                  PIC X.
006720   03  WS-CMPR-877-DQ             PIC X(5).
006730   03  WS-CMPR-877-UNITS          PIC X(7).
006740   03  WS-CMPR-877-AOE            PIC X.
006750   03  WS-CMPR-877-MED            PIC X.
006760   03  WS-CMPR-877-REO            PIC X.
006770   03  WS-CMPR-877-BC             PIC X(8).
006780   03  WS-CMPR-877-BRCH           PIC X(5).
006790   03  WS-CMPR-877-ORD-CH         PIC X.
006800   03  FILLER                     PIC X.
006810 01  WS-CMPR-8934-ENTRY  REDEFINES  WS-CMPR-INFO.
006820   03  WS-CMPR-8934-PROD-10.
006830     05  WS-CMPR-8934-PROD-BYTE   OCCURS 10 TIMES
006840                                  PIC X.
006850   03  WS-CMPR-8934-IMP-QTY-X.
006860     05  WS-CMPR-8934-IMP-QTY-N   PIC S9(7)      DISPLAY.
006870   03  WS-CMPR-8934-REO           PIC X.
006880   03  WS-CMPR-8934-ORD-CH        PIC X.
006890*
006900 01  WS-C1130-PROD-13.
006910   03  WS-C1130-PROD-BYTE         OCCURS 13 TIMES
006920                                  PIC X.
006930*
006940 01  WS-58-ENTRY.
006950   03  WS-58-PROD-AND-DQ.
006960     05  WS-58-PROD-11.
006970       07  WS-58-PROD-BYTE        OCCURS 11 TIMES
006980                                  PIC X.
006990     05  WS-58-DQ.
007000       07  WS-58-DQ-N             PIC 9(5)       DISPLAY.
007010   03  WS-58-C1128-BLOCK          PIC X.
007020   03  WS-58-551-ATTR             PIC X.
007030*
007040 01  WS-58-TABLE.
007050   03  WS-58-TBL-ENT-CT           PIC 9(4)       COMP.
007060   03  WS-58-TBL-ENTRY            OCCURS 4000 TIMES
007070                                  INDEXED BY
007080                                    IX-WS-58-TBL
007090                                    IX-WS-58-TBL-MAX
007100                                    IX-WS-58-TBL-SRCH-MAX
007110                                    IX-WS-58-TBL-SRCH-MIN.
007120     05  WS-58-TBL-ENT-BYTE-1     PIC X.
007130     05  FILLER                   PIC X(17).
007140*
007150 01  WS-TABLE-SPACE.
007160   03  WS-TABLE-4K-PAGE           OCCURS 30 TIMES
007170                                  PIC X(4096).
007180 01  WS-552-AS-TABLE  REDEFINES  WS-TABLE-SPACE.
007190   03  WS-552-AS-TBL-ENT-CT       PIC 9(4)       COMP.
007200   03  WS-552-AS-TBL-ENTRY        OCCURS 2000 TIMES
007210                                  INDEXED BY
007220                                    IX-WS-552-AS-TBL
007230                                    IX-WS-552-AS-TBL-MAX
007240                                    IX-WS-552-AS-TBL-CMPR.
007250     05  WS-552-AS-TBL-PROD-KEY   PIC X(22).
007260     05  WS-552-AS-TBL-C1128-OV   PIC X.
007270     05  WS-552-AS-TBL-BLK-FLG    PIC X.
007280 01  WS-552-G-TABLE  REDEFINES  WS-TABLE-SPACE.
007290   03  WS-552-G-TBL-ENT-CT        PIC 9(4)       COMP.
007300   03  WS-552-G-TBL-ENTRY         OCCURS 2000 TIMES
007310                                  INDEXED BY
007320                                    IX-WS-552-G-TBL
007330                                    IX-WS-552-G-TBL-MAX
007340                                    IX-WS-552-G-TBL-CMPR.
007350     05  WS-552-G-TBL-PROD-KEY    PIC X(21).
007360     05  WS-552-G-TBL-C1128-OV    PIC X.
007370     05  WS-552-G-TBL-BLK-FLG     PIC X.
007380 01  WS-554-TABLE  REDEFINES  WS-TABLE-SPACE.
007390   03  WS-554-TBL-ENT-CT          PIC 9(4)       COMP.
007400   03  WS-554-TBL-ENTRY           OCCURS 4000 TIMES
007410                                  INDEXED BY
007420                                    IX-WS-554-TBL
007430                                    IX-WS-554-TBL-MAX
007440                                    IX-WS-554-TBL-CMPR.
007450     05  WS-554-TBL-PROD-KEY      PIC X(27).
007460     05  WS-554-TBL-BASIS-1       PIC X.
007470     05  WS-554-TBL-BASIS-2       PIC X.
007480     05  WS-554-TBL-BASIS-3       PIC X.
007490 01  WS-CONSID-TABLE-SPACE  REDEFINES  WS-TABLE-SPACE.
007500   03  WS-C1130-TABLE.
007510     05  WS-C1130-TBL-ENT-CT      PIC 9(3)       COMP.
007520     05  WS-C1130-TBL-ENTRY       OCCURS 300 TIMES
007530                                  INDEXED BY IX-WS-C1130-TBL
007540                                  PIC X(13).
007550   03  WS-877-TABLE.
007560     05  WS-877-TBL-ENT-CT        PIC 9(4)       COMP.
007570     05  WS-877-TBL-ENTRY         OCCURS 1000 TIMES
007580                                  INDEXED BY
007590                                    IX-WS-877-TBL
007600                                    IX-WS-877-TBL-MAX
007610                                    IX-WS-877-TBL-CMPR.
007620       07  WS-877-TBL-REC-NBR     PIC X(3).
007630       07  WS-877-TBL-MAT-FLDS    PIC X(28).
007640       07  WS-877-TBL-ADDL-MAT    PIC X(14).
007650       07  WS-877-TBL-BLK-FLG     PIC X.
007660 01  WS-8934-TABLE  REDEFINES  WS-TABLE-SPACE.
007670   03  WS-8934-TBL-ENT-CT         PIC 9(3)       COMP.
007680   03  WS-8934-TBL-ENTRY          OCCURS 100 TIMES
007690                                  INDEXED BY
007700                                    IX-WS-8934-TBL
007710                                    IX-WS-8934-TBL-MAX
007720                                    IX-WS-8934-TBL-CMPR.
007730     05  WS-8934-TBL-MATCH-FLDS   PIC X(19).
007740 01  WS-C1128-TABLE  REDEFINES  WS-TABLE-SPACE.
007750   03  WS-C1128-TBL-ENT-CT        PIC 9(3)       COMP.
007760   03  WS-C1128-TBL-ENTRY         OCCURS 240 TIMES
007770                                  INDEXED BY IX-WS-C1128-TBL
007780                                  PIC X(12).
007790*
007800 01  WS-C1128-ENTRY.
007810   03  WS-C1128-PROD-11.
007820     05  WS-C1128-PROD-BYTE       OCCURS 11 TIMES
007830                                  PIC X.
007840   03  WS-C1128-BLOCK-CODE        PIC X.
007850*
007860 01  WS-TARGET-551-KEY                           VALUE SPACE.
007870   03  FILLER                     PIC X(4).
007880   03  WS-TGT-551-PROD-AND-DQ     PIC X(16).
007890   03  WS-TGT-551-PR-DES          PIC X(2).
007900*
007910 01  WS-CLOSING-DISPLAYS.
007920   03  WS-RETURN-CODE-LINE.
007930     05  FILLER                  PIC X(14) VALUE 'RETURN CODE = '.
007940     05  WS-RETURN-CODE           PIC 9(2)       DISPLAY VALUE 00.
007950     05  FILLER                   PIC X          VALUE '.'.
007960*
007970 COPY CPY004.
007980*
007990*
008000 01  WS-PROGRAM-NUMBER            PIC X(8)       VALUE 'BIL02301'.
008010 01  WS-REVISION-DATE             PIC X(8)       VALUE '02-14-11'.
008020*
008030 PROCEDURE DIVISION.
008040*
008050 0000-SQL-DB-CONNECT.
008060     MOVE 'DLXVSAM' TO DBNAME.
008070 COPY CPYMIGUD.
008080*
008090   0000-MAIN-LINE.
008100     PERFORM 8000-INITIALIZE.
008110*                * 552 ALTERNATE *
008120     MOVE 90 TO WS-LINE-COUNT.
008130     MOVE SPACE TO WS-KEY-INFO WS-CURR-INFO WS-CMPR-INFO.
008140     MOVE WS-HD1-CTR-552A TO WS-HD1-CENTER.
008150     MOVE WS-HD2-552AS TO WS-HEADING-2.
008160     MOVE 'LIVE' TO WS-DTL-LIVE-OR-TEST.
008170     PERFORM 1000-I552U-A-S-SHORT-KEY
008180         WITH TEST BEFORE
008190         UNTIL WS-I552U-END-OF-FILE
008200             OR (I552-RECORD-TYPE GREATER 'A').
008210     MOVE 'TEST' TO WS-DTL-LIVE-OR-TEST.
008220     PERFORM 1200-I552T-A-S-SHORT-KEY
008230         WITH TEST BEFORE
008240         UNTIL WS-I552T-END-OF-FILE
008250             OR (O552-RECORD-TYPE GREATER 'A').
008260     PERFORM 7500-CHECK-FOR-NONE.
008270*                * 552 GUARANTEE *
008280     MOVE 90 TO WS-LINE-COUNT.
008290     MOVE SPACE TO WS-KEY-INFO WS-CURR-INFO WS-CMPR-INFO.
008300     MOVE WS-HD1-CTR-552G TO WS-HD1-CENTER.
008310     MOVE WS-HD2-552G TO WS-HEADING-2.
008320     MOVE 'LIVE' TO WS-DTL-LIVE-OR-TEST.
008330     PERFORM 2000-I552U-G-SHORT-KEY
008340         WITH TEST BEFORE
008350         UNTIL WS-I552U-END-OF-FILE
008360             OR (I552-RECORD-TYPE GREATER 'G').
008370     MOVE 'TEST' TO WS-DTL-LIVE-OR-TEST.
008380     PERFORM 2200-I552T-G-SHORT-KEY
008390         WITH TEST BEFORE
008400         UNTIL WS-I552T-END-OF-FILE
008410             OR (O552-RECORD-TYPE GREATER 'G').
008420     PERFORM 7500-CHECK-FOR-NONE.
008430*                * 552 SPECIAL *
008440     MOVE 90 TO WS-LINE-COUNT.
008450     MOVE SPACE TO WS-KEY-INFO WS-CURR-INFO WS-CMPR-INFO.
008460     MOVE WS-HD1-CTR-552S TO WS-HD1-CENTER.
008470     MOVE WS-HD2-552AS TO WS-HEADING-2.
008480     MOVE 'LIVE' TO WS-DTL-LIVE-OR-TEST.
008490     PERFORM 1000-I552U-A-S-SHORT-KEY
008500         WITH TEST BEFORE
008510         UNTIL WS-I552U-END-OF-FILE.
008520     MOVE 'TEST' TO WS-DTL-LIVE-OR-TEST.
008530     PERFORM 1200-I552T-A-S-SHORT-KEY
008540         WITH TEST BEFORE
008550         UNTIL WS-I552T-END-OF-FILE.
008560     PERFORM 7500-CHECK-FOR-NONE.
008570*                * 554 *
008580     MOVE 90 TO WS-LINE-COUNT.
008590     MOVE SPACE TO WS-KEY-INFO WS-CURR-INFO WS-CMPR-INFO.
008600     MOVE WS-HD1-CTR-554 TO WS-HD1-CENTER.
008610     MOVE WS-HD2-554 TO WS-HEADING-2.
008620     MOVE 'LIVE' TO WS-DTL-LIVE-OR-TEST.
008630     PERFORM 3000-I554U-SHORT-KEY
008640         WITH TEST BEFORE
008650         UNTIL WS-I554U-END-OF-FILE.
008660     MOVE 'TEST' TO WS-DTL-LIVE-OR-TEST.
008670     PERFORM 3200-I554T-SHORT-KEY
008680         WITH TEST BEFORE
008690         UNTIL WS-I554T-END-OF-FILE.
008700     PERFORM 7500-CHECK-FOR-NONE.
008710*                * 877 *
008720     MOVE 90 TO WS-LINE-COUNT.
008730     MOVE SPACE TO WS-KEY-INFO WS-CURR-INFO WS-CMPR-INFO.
008740     MOVE WS-HD1-CTR-877 TO WS-HD1-CENTER.
008750     MOVE WS-HD2-877 TO WS-HEADING-2.
008760     PERFORM 4000-I877-CONSID-NBR
008770         WITH TEST BEFORE
008780         UNTIL END-I877-FILE.
008790     PERFORM 7500-CHECK-FOR-NONE.
008800*                * 8934 *
008810     MOVE 90 TO WS-LINE-COUNT.
008820     MOVE SPACE TO WS-KEY-INFO WS-CURR-INFO WS-CMPR-INFO.
008830     MOVE WS-HD1-CTR-8934 TO WS-HD1-CENTER.
008840     MOVE WS-HD2-8934 TO WS-HEADING-2.
008850     MOVE 'LIVE' TO WS-DTL-LIVE-OR-TEST.
008860     PERFORM 5000-I8934-KEY
008870         WITH TEST BEFORE
008880         UNTIL WS-I8934-END-OF-FILE.
008890     MOVE 'TEST' TO WS-DTL-LIVE-OR-TEST.
008900     PERFORM 5200-I8934T-KEY
008910         WITH TEST BEFORE
008920         UNTIL WS-I8934T-END-OF-FILE.
008930     PERFORM 7500-CHECK-FOR-NONE.
008940     PERFORM 9000-CLOSE.
008950     STOP RUN.
008960*
008970*
008980   1000-I552U-A-S-SHORT-KEY.
008990     MOVE 0 TO WS-552-AS-TBL-ENT-CT.
009000     MOVE I552-SHORT-KEY TO WS-552-554-SHORT-KEY.
009010     PERFORM
009020         WITH TEST AFTER
009030         UNTIL WS-I552U-END-OF-FILE
009040             OR (I552-SHORT-KEY NOT EQUAL WS-552-554-SHORT-KEY)
009050       IF I552-AS-ENTRY-COUNT NOT EQUAL +0
009060         SET I552-IX-AS-ENTRY TO +1
009070         PERFORM
009080             I552-AS-ENTRY-COUNT TIMES
009090           ADD 1 TO WS-552-AS-TBL-ENT-CT
009100           MOVE I552-AS-PRODUCT-KEY (I552-IX-AS-ENTRY) TO
009110                 WS-552-AS-TBL-PROD-KEY (WS-552-AS-TBL-ENT-CT)
009120           MOVE I552-AS-C1128-OVERRIDE-FLAG (I552-IX-AS-ENTRY) TO
009130                 WS-552-AS-TBL-C1128-OV (WS-552-AS-TBL-ENT-CT)
009140           IF I552-AS-ADJUSTMENT-BASIS (I552-IX-AS-ENTRY, 1)
009150                 EQUAL SPACE
009160             MOVE 'Y' TO
009170                   WS-552-AS-TBL-BLK-FLG (WS-552-AS-TBL-ENT-CT)
009180           ELSE
009190             MOVE 'N' TO
009200                   WS-552-AS-TBL-BLK-FLG (WS-552-AS-TBL-ENT-CT)
009210           END-IF
009220           SET I552-IX-AS-ENTRY UP BY 1
009230         END-PERFORM
009240       END-IF
009250       PERFORM 1100-READ-I552U-FILE
009260     END-PERFORM.
009270     IF WS-552-AS-TBL-ENT-CT GREATER 0
009280       SET IX-WS-552-AS-TBL-MAX TO WS-552-AS-TBL-ENT-CT
009290       SET IX-WS-552-AS-TBL TO +1
009300       PERFORM 1500-CHECK-552-A-S-ENT
009310           WS-552-AS-TBL-ENT-CT TIMES.
009320*
009330   1100-READ-I552U-FILE.
009340     READ I552U-FILE NEXT RECORD.
009350     IF (NOT WS-I552U-SUCCESSFUL)
009360         AND (NOT WS-I552U-END-OF-FILE)
009370       DISPLAY '* VSAM ERROR ON I552U READ.  FILE STATUS = '
009380             WS-I552U-FILE-STATUS '. *' UPON SYSOUT
009390       GO TO 9900-DISPLAY-ABORT.
009400*
009410   1200-I552T-A-S-SHORT-KEY.
009420     MOVE 0 TO WS-552-AS-TBL-ENT-CT.
009430     MOVE O552-SHORT-KEY TO WS-552-554-SHORT-KEY.
009440     PERFORM
009450         WITH TEST AFTER
009460         UNTIL WS-I552T-END-OF-FILE
009470             OR (O552-SHORT-KEY NOT EQUAL WS-552-554-SHORT-KEY)
009480       IF O552-AS-ENTRY-COUNT NOT EQUAL +0
009490         SET O552-IX-AS-ENTRY TO +1
009500         PERFORM
009510             O552-AS-ENTRY-COUNT TIMES
009520           ADD 1 TO WS-552-AS-TBL-ENT-CT
009530           MOVE O552-AS-PRODUCT-KEY (O552-IX-AS-ENTRY) TO
009540                 WS-552-AS-TBL-PROD-KEY (WS-552-AS-TBL-ENT-CT)
009550           MOVE O552-AS-C1128-OVERRIDE-FLAG (O552-IX-AS-ENTRY) TO
009560                 WS-552-AS-TBL-C1128-OV (WS-552-AS-TBL-ENT-CT)
009570           IF O552-AS-ADJUSTMENT-BASIS (O552-IX-AS-ENTRY, 1)
009580                 EQUAL SPACE
009590             MOVE 'Y' TO
009600                   WS-552-AS-TBL-BLK-FLG (WS-552-AS-TBL-ENT-CT)
009610           ELSE
009620             MOVE 'N' TO
009630                   WS-552-AS-TBL-BLK-FLG (WS-552-AS-TBL-ENT-CT)
009640           END-IF
009650           SET O552-IX-AS-ENTRY UP BY 1
009660         END-PERFORM
009670       END-IF
009680       PERFORM 1300-READ-I552T-FILE
009690     END-PERFORM.
009700     IF WS-552-AS-TBL-ENT-CT GREATER 0
009710       SET IX-WS-552-AS-TBL-MAX TO WS-552-AS-TBL-ENT-CT
009720       SET IX-WS-552-AS-TBL TO +1
009730       PERFORM 1500-CHECK-552-A-S-ENT
009740           WS-552-AS-TBL-ENT-CT TIMES.
009750*
009760   1300-READ-I552T-FILE.
009770     READ I552T-FILE NEXT RECORD.
009780     IF (NOT WS-I552T-SUCCESSFUL)
009790         AND (NOT WS-I552T-END-OF-FILE)
009800       DISPLAY '* VSAM ERROR ON I552T READ.  FILE STATUS = '
009810             WS-I552T-FILE-STATUS '. *' UPON SYSOUT
009820       GO TO 9900-DISPLAY-ABORT.
009830*
009840   1500-CHECK-552-A-S-ENT.
009850     MOVE WS-552-AS-TBL-ENTRY (IX-WS-552-AS-TBL) TO
009860           WS-CURR-552AS-ENTRY.
009870     SET IX-WS-58-TBL-SRCH-MAX TO IX-WS-58-TBL-MAX.
009880     SET IX-WS-58-TBL-SRCH-MIN TO +1.
009890     IF WS-CURR-552AS-PROD-BYTE (3) IS NUMERIC
009900       PERFORM
009910           WITH TEST BEFORE
009920           UNTIL (IX-WS-58-TBL-SRCH-MIN NOT LESS
009930                 IX-WS-58-TBL-SRCH-MAX)
009940               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MIN)
009950                     NOT LESS WS-CURR-552AS-PROD-BYTE (3))
009960         SET IX-WS-58-TBL-SRCH-MIN UP BY 1
009970       END-PERFORM
009980       PERFORM
009990           WITH TEST BEFORE
010000           UNTIL (IX-WS-58-TBL-SRCH-MAX NOT GREATER
010010                 IX-WS-58-TBL-SRCH-MIN)
010020               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MAX)
010030                     NOT GREATER WS-CURR-552AS-PROD-BYTE (3))
010040         SET IX-WS-58-TBL-SRCH-MAX DOWN BY 1
010050       END-PERFORM.
010060     MOVE SPACE TO WS-ENTRY-FLAGS.
010070     SET IX-WS-58-TBL TO IX-WS-58-TBL-SRCH-MIN.
010080     PERFORM
010090         WITH TEST AFTER
010100         UNTIL GOOD-MATCH-FOUND
010110             OR (IX-WS-58-TBL GREATER IX-WS-58-TBL-SRCH-MAX)
010120       MOVE WS-58-TBL-ENTRY (IX-WS-58-TBL) TO WS-58-ENTRY
010130       IF (WS-CURR-552AS-PROD-BYTE (3) EQUAL '*' OR
010140                 WS-58-PROD-BYTE (1))
010150           AND (WS-CURR-552AS-PROD-BYTE (4) EQUAL '*' OR
010160                 WS-58-PROD-BYTE (2))
010170           AND (WS-CURR-552AS-PROD-BYTE (5) EQUAL '*' OR
010180                 WS-58-PROD-BYTE (3))
010190           AND (WS-CURR-552AS-PROD-BYTE (6) EQUAL '*' OR
010200                 WS-58-PROD-BYTE (4))
010210           AND (WS-CURR-552AS-PROD-BYTE (7) EQUAL '*' OR
010220                 WS-58-PROD-BYTE (5))
010230           AND (WS-CURR-552AS-PROD-BYTE (8) EQUAL '*' OR
010240                 WS-58-PROD-BYTE (6))
010250           AND (WS-CURR-552AS-PROD-BYTE (9) EQUAL '*' OR
010260                 WS-58-PROD-BYTE (7))
010270           AND (WS-CURR-552AS-PROD-BYTE (10) EQUAL '*' OR
010280                 WS-58-PROD-BYTE (8))
010290           AND (WS-CURR-552AS-PROD-BYTE (11) EQUAL '*' OR
010300                 WS-58-PROD-BYTE (9))
010310           AND (WS-CURR-552AS-PROD-BYTE (12) EQUAL '*' OR
010320                 WS-58-PROD-BYTE (10))
010330           AND (WS-CURR-552AS-PROD-BYTE (13) EQUAL '*' OR
010340                 WS-58-PROD-BYTE (11))
010350           AND (WS-CURR-552AS-DQ EQUAL SPACE OR WS-58-DQ)
010360         PERFORM 1600-VERIFY-552AS-MATCH
010370       END-IF
010380       SET IX-WS-58-TBL UP BY 1
010390     END-PERFORM.
010400     IF NOT GOOD-MATCH-FOUND
010410       PERFORM 1700-REPORT-552-AS-ENTRY.
010420     SET IX-WS-552-AS-TBL UP BY 1.
010430*
010440   1600-VERIFY-552AS-MATCH.
010450     MOVE 'Y' TO WS-ENTRY-GOOD-MATCH-FLAG.
010460     IF IX-WS-552-AS-TBL LESS IX-WS-552-AS-TBL-MAX
010470       SET IX-WS-552-AS-TBL-CMPR TO IX-WS-552-AS-TBL-MAX
010480       PERFORM
010490           WITH TEST AFTER
010500           UNTIL (NOT GOOD-MATCH-FOUND)
010510               OR (IX-WS-552-AS-TBL-CMPR NOT GREATER
010520                     IX-WS-552-AS-TBL)
010530         MOVE WS-552-AS-TBL-ENTRY (IX-WS-552-AS-TBL-CMPR) TO
010540               WS-CMPR-552AS-ENTRY
010550         IF (WS-CMPR-552AS-PROD-BYTE (1) EQUAL '*' OR
010560                   WS-CURR-552AS-PROD-BYTE (1))
010570             AND (WS-CMPR-552AS-PROD-BYTE (2) EQUAL '*' OR
010580                   WS-CURR-552AS-PROD-BYTE (2))
010590             AND (WS-CMPR-552AS-PROD-BYTE (3) EQUAL '*' OR
010600                   WS-58-PROD-BYTE (1))
010610             AND (WS-CMPR-552AS-PROD-BYTE (4) EQUAL '*' OR
010620                   WS-58-PROD-BYTE (2))
010630             AND (WS-CMPR-552AS-PROD-BYTE (5) EQUAL '*' OR
010640                   WS-58-PROD-BYTE (3))
010650             AND (WS-CMPR-552AS-PROD-BYTE (6) EQUAL '*' OR
010660                   WS-58-PROD-BYTE (4))
010670             AND (WS-CMPR-552AS-PROD-BYTE (7) EQUAL '*' OR
010680                   WS-58-PROD-BYTE (5))
010690             AND (WS-CMPR-552AS-PROD-BYTE (8) EQUAL '*' OR
010700                   WS-58-PROD-BYTE (6))
010710             AND (WS-CMPR-552AS-PROD-BYTE (9) EQUAL '*' OR
010720                   WS-58-PROD-BYTE (7))
010730             AND (WS-CMPR-552AS-PROD-BYTE (10) EQUAL '*' OR
010740                   WS-58-PROD-BYTE (8))
010750             AND (WS-CMPR-552AS-PROD-BYTE (11) EQUAL '*' OR
010760                   WS-58-PROD-BYTE (9))
010770             AND (WS-CMPR-552AS-PROD-BYTE (12) EQUAL '*' OR
010780                   WS-58-PROD-BYTE (10))
010790             AND (WS-CMPR-552AS-PROD-BYTE (13) EQUAL '*' OR
010800                   WS-58-PROD-BYTE (11))
010810             AND (WS-CMPR-552AS-DQ EQUAL SPACE OR WS-58-DQ)
010820             AND (WS-CMPR-552AS-REO EQUAL SPACE OR
010830                   WS-CURR-552AS-REO)
010840             AND (WS-CMPR-552AS-UNITS EQUAL SPACE OR
010850                   WS-CURR-552AS-UNITS)
010860             AND ((WS-CMPR-552AS-ORD-CH EQUAL SPACE OR
010870                   WS-CURR-552AS-ORD-CH)
010880                 OR ((WS-CMPR-552AS-ORD-CH EQUAL '$')
010890                     AND (WS-CURR-552AS-ORD-CH EQUAL '1' OR '7' OR
010900                           '8' OR '9' OR 'C' OR 'D'))
010910                 OR ((WS-CMPR-552AS-ORD-CH EQUAL '@')
010920                     AND (WS-CURR-552AS-ORD-CH EQUAL '2' OR '3' OR
010930                           '4' OR '5' OR '6' OR 'A' OR 'B' OR 'E'
010940                           OR 'I' OR 'J')))
010950           MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
010960           MOVE 'Y' TO WS-ENTRY-OTHER-FLAG
010970         ELSE
010980           SET IX-WS-552-AS-TBL-CMPR DOWN BY 1
010990         END-IF
011000       END-PERFORM.
011010     IF GOOD-MATCH-FOUND
011020         AND (NOT CURR-552AS-IS-BLOCKER)
011030         AND (WS-58-C1128-BLOCK EQUAL 'B' OR 'G')
011040         AND (WS-CURR-552AS-C1128-OVR NOT EQUAL 'Y')
011050       MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
011060       MOVE 'Y' TO WS-ENTRY-C1128-FLAG.
011070*
011080   1700-REPORT-552-AS-ENTRY.
011090     MOVE WS-DTL-LIVE-OR-TEST TO WS-DTL-552AS-FILE.
011100     MOVE WS-552-554-SHORT-KEY TO WS-DTL-552AS-REC-KEY.
011110     MOVE WS-CURR-552AS-PROD-13 TO WS-DTL-552AS-PROD-13.
011120     MOVE WS-CURR-552AS-DQ TO WS-DTL-552AS-DQ.
011130     MOVE WS-CURR-552AS-REO TO WS-DTL-552AS-REO.
011140     MOVE WS-CURR-552AS-UNITS TO WS-DTL-552AS-UNITS.
011150     MOVE WS-CURR-552AS-ORD-CH TO WS-DTL-552AS-ORD-CH.
011160     IF C1128-BLOCK-FOUND
011170       IF OTHER-BLOCK-FOUND
011180         MOVE WS-DTL-RSN-BLK-C1128-ENT TO WS-DTL-552AS-REASON
011190       ELSE
011200         MOVE WS-DTL-RSN-BLK-C1128 TO WS-DTL-552AS-REASON
011210     ELSE
011220       IF OTHER-BLOCK-FOUND
011230         MOVE WS-DTL-RSN-BLK-ENT TO WS-DTL-552AS-REASON
011240       ELSE
011250         MOVE WS-DTL-RSN-NO-PROD TO WS-DTL-552AS-REASON.
011260     PERFORM 7000-PRINT-DETAIL.
011270*
011280*
011290   2000-I552U-G-SHORT-KEY.
011300     MOVE 0 TO WS-552-G-TBL-ENT-CT.
011310     MOVE I552-SHORT-KEY TO WS-552-554-SHORT-KEY.
011320     PERFORM
011330         WITH TEST AFTER
011340         UNTIL WS-I552U-END-OF-FILE
011350             OR (I552-SHORT-KEY NOT EQUAL WS-552-554-SHORT-KEY)
011360       IF I552-G-ENTRY-COUNT NOT EQUAL +0
011370         SET I552-IX-G-ENTRY TO +1
011380         PERFORM
011390             I552-G-ENTRY-COUNT TIMES
011400           ADD 1 TO WS-552-G-TBL-ENT-CT
011410           MOVE I552-G-PRODUCT-KEY (I552-IX-G-ENTRY) TO
011420                 WS-552-G-TBL-PROD-KEY (WS-552-G-TBL-ENT-CT)
011430           MOVE I552-G-C1128-OVERRIDE-FLAG (I552-IX-G-ENTRY) TO
011440                 WS-552-G-TBL-C1128-OV (WS-552-G-TBL-ENT-CT)
011450           IF I552-G-ADJUSTMENT-OPTION (I552-IX-G-ENTRY)
011460                 EQUAL SPACE
011470             MOVE 'Y' TO
011480                   WS-552-G-TBL-BLK-FLG (WS-552-G-TBL-ENT-CT)
011490           ELSE
011500             MOVE 'N' TO
011510                   WS-552-G-TBL-BLK-FLG (WS-552-G-TBL-ENT-CT)
011520           END-IF
011530           SET I552-IX-G-ENTRY UP BY 1
011540         END-PERFORM
011550       END-IF
011560       PERFORM 1100-READ-I552U-FILE
011570     END-PERFORM.
011580     IF WS-552-G-TBL-ENT-CT GREATER 0
011590       SET IX-WS-552-G-TBL-MAX TO WS-552-G-TBL-ENT-CT
011600       SET IX-WS-552-G-TBL TO +1
011610       PERFORM 2500-CHECK-552-G-ENT
011620           WS-552-G-TBL-ENT-CT TIMES.
011630*
011640   2200-I552T-G-SHORT-KEY.
011650     MOVE 0 TO WS-552-G-TBL-ENT-CT.
011660     MOVE O552-SHORT-KEY TO WS-552-554-SHORT-KEY.
011670     PERFORM
011680         WITH TEST AFTER
011690         UNTIL WS-I552T-END-OF-FILE
011700             OR (O552-SHORT-KEY NOT EQUAL WS-552-554-SHORT-KEY)
011710       IF O552-G-ENTRY-COUNT NOT EQUAL +0
011720         SET O552-IX-G-ENTRY TO +1
011730         PERFORM
011740             O552-G-ENTRY-COUNT TIMES
011750           ADD 1 TO WS-552-G-TBL-ENT-CT
011760           MOVE O552-G-PRODUCT-KEY (O552-IX-G-ENTRY) TO
011770                 WS-552-G-TBL-PROD-KEY (WS-552-G-TBL-ENT-CT)
011780           MOVE O552-G-C1128-OVERRIDE-FLAG (O552-IX-G-ENTRY) TO
011790                 WS-552-G-TBL-C1128-OV (WS-552-G-TBL-ENT-CT)
011800           IF O552-G-ADJUSTMENT-OPTION (O552-IX-G-ENTRY)
011810                 EQUAL SPACE
011820             MOVE 'Y' TO
011830                   WS-552-G-TBL-BLK-FLG (WS-552-G-TBL-ENT-CT)
011840           ELSE
011850             MOVE 'N' TO
011860                   WS-552-G-TBL-BLK-FLG (WS-552-G-TBL-ENT-CT)
011870           END-IF
011880           SET O552-IX-G-ENTRY UP BY 1
011890         END-PERFORM
011900       END-IF
011910       PERFORM 1300-READ-I552T-FILE
011920     END-PERFORM.
011930     IF WS-552-G-TBL-ENT-CT GREATER 0
011940       SET IX-WS-552-G-TBL-MAX TO WS-552-G-TBL-ENT-CT
011950       SET IX-WS-552-G-TBL TO +1
011960       PERFORM 2500-CHECK-552-G-ENT
011970           WS-552-G-TBL-ENT-CT TIMES.
011980*
011990   2500-CHECK-552-G-ENT.
012000     MOVE WS-552-G-TBL-ENTRY (IX-WS-552-G-TBL) TO
012010           WS-CURR-552G-ENTRY.
012020     SET IX-WS-58-TBL-SRCH-MAX TO IX-WS-58-TBL-MAX.
012030     SET IX-WS-58-TBL-SRCH-MIN TO +1.
012040     IF WS-CURR-552G-PROD-BYTE (3) IS NUMERIC
012050       PERFORM
012060           WITH TEST BEFORE
012070           UNTIL (IX-WS-58-TBL-SRCH-MIN NOT LESS
012080                 IX-WS-58-TBL-SRCH-MAX)
012090               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MIN)
012100                     NOT LESS WS-CURR-552G-PROD-BYTE (3))
012110         SET IX-WS-58-TBL-SRCH-MIN UP BY 1
012120       END-PERFORM
012130       PERFORM
012140           WITH TEST BEFORE
012150           UNTIL (IX-WS-58-TBL-SRCH-MAX NOT GREATER
012160                 IX-WS-58-TBL-SRCH-MIN)
012170               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MAX)
012180                     NOT GREATER WS-CURR-552G-PROD-BYTE (3))
012190         SET IX-WS-58-TBL-SRCH-MAX DOWN BY 1
012200       END-PERFORM.
012210     MOVE SPACE TO WS-ENTRY-FLAGS.
012220     SET IX-WS-58-TBL TO IX-WS-58-TBL-SRCH-MIN.
012230     PERFORM
012240         WITH TEST AFTER
012250         UNTIL GOOD-MATCH-FOUND
012260             OR (IX-WS-58-TBL GREATER IX-WS-58-TBL-SRCH-MAX)
012270       MOVE WS-58-TBL-ENTRY (IX-WS-58-TBL) TO WS-58-ENTRY
012280       IF (WS-CURR-552G-PROD-BYTE (3) EQUAL '*' OR
012290                 WS-58-PROD-BYTE (1))
012300           AND (WS-CURR-552G-PROD-BYTE (4) EQUAL '*' OR
012310                 WS-58-PROD-BYTE (2))
012320           AND (WS-CURR-552G-PROD-BYTE (5) EQUAL '*' OR
012330                 WS-58-PROD-BYTE (3))
012340           AND (WS-CURR-552G-PROD-BYTE (6) EQUAL '*' OR
012350                 WS-58-PROD-BYTE (4))
012360           AND (WS-CURR-552G-PROD-BYTE (7) EQUAL '*' OR
012370                 WS-58-PROD-BYTE (5))
012380           AND (WS-CURR-552G-PROD-BYTE (8) EQUAL '*' OR
012390                 WS-58-PROD-BYTE (6))
012400           AND (WS-CURR-552G-PROD-BYTE (9) EQUAL '*' OR
012410                 WS-58-PROD-BYTE (7))
012420           AND (WS-CURR-552G-PROD-BYTE (10) EQUAL '*' OR
012430                 WS-58-PROD-BYTE (8))
012440           AND (WS-CURR-552G-PROD-BYTE (11) EQUAL '*' OR
012450                 WS-58-PROD-BYTE (9))
012460           AND (WS-CURR-552G-PROD-BYTE (12) EQUAL '*' OR
012470                 WS-58-PROD-BYTE (10))
012480           AND (WS-CURR-552G-PROD-BYTE (13) EQUAL '*' OR
012490                 WS-58-PROD-BYTE (11))
012500           AND (WS-CURR-552G-DQ EQUAL SPACE OR WS-58-DQ)
012510         PERFORM 2600-VERIFY-552G-MATCH
012520       END-IF
012530       SET IX-WS-58-TBL UP BY 1
012540     END-PERFORM.
012550     IF NOT GOOD-MATCH-FOUND
012560       PERFORM 2700-REPORT-552-G-ENTRY.
012570     SET IX-WS-552-G-TBL UP BY 1.
012580*
012590   2600-VERIFY-552G-MATCH.
012600     MOVE 'Y' TO WS-ENTRY-GOOD-MATCH-FLAG.
012610     IF IX-WS-552-G-TBL LESS IX-WS-552-G-TBL-MAX
012620       SET IX-WS-552-G-TBL-CMPR TO IX-WS-552-G-TBL-MAX
012630       PERFORM
012640           WITH TEST AFTER
012650           UNTIL (NOT GOOD-MATCH-FOUND)
012660               OR (IX-WS-552-G-TBL-CMPR NOT GREATER
012670                     IX-WS-552-G-TBL)
012680         MOVE WS-552-G-TBL-ENTRY (IX-WS-552-G-TBL-CMPR) TO
012690               WS-CMPR-552G-ENTRY
012700         IF (WS-CMPR-552G-ENT-TYP EQUAL WS-CURR-552G-ENT-TYP)
012710             AND (WS-CMPR-552G-PROD-BYTE (1) EQUAL '*' OR
012720                   WS-CURR-552G-PROD-BYTE (1))
012730             AND (WS-CMPR-552G-PROD-BYTE (2) EQUAL '*' OR
012740                   WS-CURR-552G-PROD-BYTE (2))
012750             AND (WS-CMPR-552G-PROD-BYTE (3) EQUAL '*' OR
012760                   WS-58-PROD-BYTE (1))
012770             AND (WS-CMPR-552G-PROD-BYTE (4) EQUAL '*' OR
012780                   WS-58-PROD-BYTE (2))
012790             AND (WS-CMPR-552G-PROD-BYTE (5) EQUAL '*' OR
012800                   WS-58-PROD-BYTE (3))
012810             AND (WS-CMPR-552G-PROD-BYTE (6) EQUAL '*' OR
012820                   WS-58-PROD-BYTE (4))
012830             AND (WS-CMPR-552G-PROD-BYTE (7) EQUAL '*' OR
012840                   WS-58-PROD-BYTE (5))
012850             AND (WS-CMPR-552G-PROD-BYTE (8) EQUAL '*' OR
012860                   WS-58-PROD-BYTE (6))
012870             AND (WS-CMPR-552G-PROD-BYTE (9) EQUAL '*' OR
012880                   WS-58-PROD-BYTE (7))
012890             AND (WS-CMPR-552G-PROD-BYTE (10) EQUAL '*' OR
012900                   WS-58-PROD-BYTE (8))
012910             AND (WS-CMPR-552G-PROD-BYTE (11) EQUAL '*' OR
012920                   WS-58-PROD-BYTE (9))
012930             AND (WS-CMPR-552G-PROD-BYTE (12) EQUAL '*' OR
012940                   WS-58-PROD-BYTE (10))
012950             AND (WS-CMPR-552G-PROD-BYTE (13) EQUAL '*' OR
012960                   WS-58-PROD-BYTE (11))
012970             AND (WS-CMPR-552G-DQ EQUAL SPACE OR WS-58-DQ)
012980             AND ((WS-CMPR-552G-MAIL-METH EQUAL SPACE OR
012990                   WS-CURR-552G-MAIL-METH)
013000                 OR ((WS-CMPR-552G-MAIL-METH EQUAL '$')
013010                     AND (WS-CURR-552G-MAIL-METH EQUAL
013020                           '1' OR '3' OR 'P'))
013030                 OR ((WS-CMPR-552G-MAIL-METH EQUAL '@')
013040                     AND (WS-CURR-552G-MAIL-METH EQUAL
013050                           '4' OR '5' OR 'K' OR 'R')))
013060             AND (WS-CMPR-552G-PRICE-SRC EQUAL SPACE OR
013070                   WS-CURR-552G-PRICE-SRC)
013080           MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
013090           MOVE 'Y' TO WS-ENTRY-OTHER-FLAG
013100         ELSE
013110           SET IX-WS-552-G-TBL-CMPR DOWN BY 1
013120         END-IF
013130       END-PERFORM.
013140     IF GOOD-MATCH-FOUND
013150         AND (NOT CURR-552G-IS-BLOCKER)
013160         AND (WS-58-C1128-BLOCK EQUAL 'B' OR 'G')
013170         AND (WS-CURR-552G-C1128-OVR NOT EQUAL 'Y')
013180       MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
013190       MOVE 'Y' TO WS-ENTRY-C1128-FLAG.
013200*
013210   2700-REPORT-552-G-ENTRY.
013220     MOVE WS-DTL-LIVE-OR-TEST TO WS-DTL-552G-FILE.
013230     MOVE WS-552-554-SHORT-KEY TO WS-DTL-552G-REC-KEY.
013240     MOVE WS-CURR-552G-ENT-TYP TO WS-DTL-552G-ENT-TYP.
013250     MOVE WS-CURR-552G-PROD-13 TO WS-DTL-552G-PROD-13.
013260     MOVE WS-CURR-552G-DQ TO WS-DTL-552G-DQ.
013270     MOVE WS-CURR-552G-MAIL-METH TO WS-DTL-552G-MAIL-METH.
013280     MOVE WS-CURR-552G-PRICE-SRC TO WS-DTL-552G-PR-SRCE.
013290     IF C1128-BLOCK-FOUND
013300       IF OTHER-BLOCK-FOUND
013310         MOVE WS-DTL-RSN-BLK-C1128-ENT TO WS-DTL-552G-REASON
013320       ELSE
013330         MOVE WS-DTL-RSN-BLK-C1128 TO WS-DTL-552G-REASON
013340     ELSE
013350       IF OTHER-BLOCK-FOUND
013360         MOVE WS-DTL-RSN-BLK-ENT TO WS-DTL-552G-REASON
013370       ELSE
013380         MOVE WS-DTL-RSN-NO-PROD TO WS-DTL-552G-REASON.
013390     PERFORM 7000-PRINT-DETAIL.
013400*
013410*
013420   3000-I554U-SHORT-KEY.
013430     MOVE 0 TO WS-554-TBL-ENT-CT.
013440     MOVE I554-SHORT-KEY TO WS-552-554-SHORT-KEY.
013450     PERFORM
013460         WITH TEST AFTER
013470         UNTIL WS-I554U-END-OF-FILE
013480             OR (I554-SHORT-KEY NOT EQUAL WS-552-554-SHORT-KEY)
013490       IF I554-ENTRY-COUNT NOT EQUAL +0
013500         SET I554-IX-ENTRY TO +1
013510         PERFORM
013520             I554-ENTRY-COUNT TIMES
013530           ADD 1 TO WS-554-TBL-ENT-CT
013540           MOVE I554-PRODUCT-KEY (I554-IX-ENTRY) TO
013550                 WS-554-TBL-PROD-KEY (WS-554-TBL-ENT-CT)
013560           MOVE I554-NORMAL-UPCH-1-BASIS (I554-IX-ENTRY) TO
013570                 WS-554-TBL-BASIS-1 (WS-554-TBL-ENT-CT)
013580           MOVE I554-NORMAL-UPCH-2-BASIS (I554-IX-ENTRY) TO
013590                 WS-554-TBL-BASIS-2 (WS-554-TBL-ENT-CT)
013600           MOVE I554-NORMAL-UPCH-3-BASIS (I554-IX-ENTRY) TO
013610                 WS-554-TBL-BASIS-3 (WS-554-TBL-ENT-CT)
013620           SET I554-IX-ENTRY UP BY 1
013630         END-PERFORM
013640       END-IF
013650       PERFORM 3100-READ-I554U-FILE
013660     END-PERFORM.
013670     IF WS-554-TBL-ENT-CT GREATER 0
013680       SET IX-WS-554-TBL-MAX TO WS-554-TBL-ENT-CT
013690       SET IX-WS-554-TBL TO +1
013700       PERFORM 3500-CHECK-554-ENT
013710           WS-554-TBL-ENT-CT TIMES.
013720*
013730   3100-READ-I554U-FILE.
013740     READ I554U-FILE NEXT RECORD.
013750     IF (NOT WS-I554U-SUCCESSFUL)
013760         AND (NOT WS-I554U-END-OF-FILE)
013770       DISPLAY '* VSAM ERROR ON I554U READ.  FILE STATUS = '
013780             WS-I554U-FILE-STATUS '. *' UPON SYSOUT
013790       GO TO 9900-DISPLAY-ABORT.
013800*
013810   3200-I554T-SHORT-KEY.
013820     MOVE 0 TO WS-554-TBL-ENT-CT.
013830     MOVE O554-SHORT-KEY TO WS-552-554-SHORT-KEY.
013840     PERFORM
013850         WITH TEST AFTER
013860         UNTIL WS-I554T-END-OF-FILE
013870             OR (O554-SHORT-KEY NOT EQUAL WS-552-554-SHORT-KEY)
013880       IF O554-ENTRY-COUNT NOT EQUAL +0
013890         SET O554-IX-ENTRY TO +1
013900         PERFORM
013910             O554-ENTRY-COUNT TIMES
013920           ADD 1 TO WS-554-TBL-ENT-CT
013930           MOVE O554-PRODUCT-KEY (O554-IX-ENTRY) TO
013940                 WS-554-TBL-PROD-KEY (WS-554-TBL-ENT-CT)
013950           MOVE O554-NORMAL-UPCH-1-BASIS (O554-IX-ENTRY) TO
013960                 WS-554-TBL-BASIS-1 (WS-554-TBL-ENT-CT)
013970           MOVE O554-NORMAL-UPCH-2-BASIS (O554-IX-ENTRY) TO
013980                 WS-554-TBL-BASIS-2 (WS-554-TBL-ENT-CT)
013990           MOVE O554-NORMAL-UPCH-3-BASIS (O554-IX-ENTRY) TO
014000                 WS-554-TBL-BASIS-3 (WS-554-TBL-ENT-CT)
014010           SET O554-IX-ENTRY UP BY 1
014020         END-PERFORM
014030       END-IF
014040       PERFORM 3300-READ-I554T-FILE
014050     END-PERFORM.
014060     IF WS-554-TBL-ENT-CT GREATER 0
014070       SET IX-WS-554-TBL-MAX TO WS-554-TBL-ENT-CT
014080       SET IX-WS-554-TBL TO +1
014090       PERFORM 3500-CHECK-554-ENT
014100           WS-554-TBL-ENT-CT TIMES.
014110*
014120   3300-READ-I554T-FILE.
014130     READ I554T-FILE NEXT RECORD.
014140     IF (NOT WS-I554T-SUCCESSFUL)
014150         AND (NOT WS-I554T-END-OF-FILE)
014160       DISPLAY '* VSAM ERROR ON I554T READ.  FILE STATUS = '
014170             WS-I554T-FILE-STATUS '. *' UPON SYSOUT
014180       GO TO 9900-DISPLAY-ABORT.
014190*
014200   3500-CHECK-554-ENT.
014210     MOVE WS-554-TBL-ENTRY (IX-WS-554-TBL) TO
014220           WS-CURR-554-ENTRY.
014230     SET IX-WS-58-TBL-SRCH-MAX TO IX-WS-58-TBL-MAX.
014240     SET IX-WS-58-TBL-SRCH-MIN TO +1.
014250     IF WS-CURR-554-PROD-BYTE (3) IS NUMERIC
014260       PERFORM
014270           WITH TEST BEFORE
014280           UNTIL (IX-WS-58-TBL-SRCH-MIN NOT LESS
014290                 IX-WS-58-TBL-SRCH-MAX)
014300               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MIN)
014310                     NOT LESS WS-CURR-554-PROD-BYTE (3))
014320         SET IX-WS-58-TBL-SRCH-MIN UP BY 1
014330       END-PERFORM
014340       PERFORM
014350           WITH TEST BEFORE
014360           UNTIL (IX-WS-58-TBL-SRCH-MAX NOT GREATER
014370                 IX-WS-58-TBL-SRCH-MIN)
014380               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MAX)
014390                     NOT GREATER WS-CURR-554-PROD-BYTE (3))
014400         SET IX-WS-58-TBL-SRCH-MAX DOWN BY 1
014410       END-PERFORM.
014420     MOVE SPACE TO WS-ENTRY-FLAGS.
014430     SET IX-WS-58-TBL TO IX-WS-58-TBL-SRCH-MIN.
014440     PERFORM
014450         WITH TEST AFTER
014460         UNTIL GOOD-MATCH-FOUND
014470             OR (IX-WS-58-TBL GREATER IX-WS-58-TBL-SRCH-MAX)
014480       MOVE WS-58-TBL-ENTRY (IX-WS-58-TBL) TO WS-58-ENTRY
014490       IF (WS-CURR-554-PROD-BYTE (3) EQUAL '*' OR
014500                 WS-58-PROD-BYTE (1))
014510           AND (WS-CURR-554-PROD-BYTE (4) EQUAL '*' OR
014520                 WS-58-PROD-BYTE (2))
014530           AND (WS-CURR-554-PROD-BYTE (5) EQUAL '*' OR
014540                 WS-58-PROD-BYTE (3))
014550           AND (WS-CURR-554-PROD-BYTE (6) EQUAL '*' OR
014560                 WS-58-PROD-BYTE (4))
014570           AND (WS-CURR-554-PROD-BYTE (7) EQUAL '*' OR
014580                 WS-58-PROD-BYTE (5))
014590           AND (WS-CURR-554-PROD-BYTE (8) EQUAL '*' OR
014600                 WS-58-PROD-BYTE (6))
014610           AND (WS-CURR-554-PROD-BYTE (9) EQUAL '*' OR
014620                 WS-58-PROD-BYTE (7))
014630           AND (WS-CURR-554-PROD-BYTE (10) EQUAL '*' OR
014640                 WS-58-PROD-BYTE (8))
014650           AND (WS-CURR-554-PROD-BYTE (11) EQUAL '*' OR
014660                 WS-58-PROD-BYTE (9))
014670           AND (WS-CURR-554-PROD-BYTE (12) EQUAL '*' OR
014680                 WS-58-PROD-BYTE (10))
014690           AND (WS-CURR-554-PROD-BYTE (13) EQUAL '*' OR
014700                 WS-58-PROD-BYTE (11))
014710           AND (WS-CURR-554-DQ EQUAL SPACE OR WS-58-DQ)
014720           AND (WS-58-551-ATTR NOT EQUAL '?')
014730           AND ((WS-CURR-554-ATTR (1) EQUAL '*')
014740               OR ((WS-CURR-554-ATTR (1) NOT EQUAL '-')
014750                   AND (WS-58-551-ATTR EQUAL
014760                         WS-CURR-554-ATTR (1) OR
014770                         WS-CURR-554-ATTR (2) OR
014780                         WS-CURR-554-ATTR (3) OR
014790                         WS-CURR-554-ATTR (4) OR
014800                         WS-CURR-554-ATTR (5)))
014810               OR ((WS-CURR-554-ATTR (1) EQUAL '-')
014820                   AND (WS-58-551-ATTR NOT EQUAL
014830                         WS-CURR-554-ATTR (2) AND
014840                         WS-CURR-554-ATTR (3) AND
014850                         WS-CURR-554-ATTR (4) AND
014860                         WS-CURR-554-ATTR (5))))
014870         PERFORM 3600-VERIFY-554-MATCH
014880       END-IF
014890       SET IX-WS-58-TBL UP BY 1
014900     END-PERFORM.
014910     IF NOT GOOD-MATCH-FOUND
014920       PERFORM 3700-REPORT-554-ENTRY.
014930     SET IX-WS-554-TBL UP BY 1.
014940*
014950   3600-VERIFY-554-MATCH.
014960     MOVE 'Y' TO WS-ENTRY-GOOD-MATCH-FLAG.
014970     IF IX-WS-554-TBL LESS IX-WS-554-TBL-MAX
014980       SET IX-WS-554-TBL-CMPR TO IX-WS-554-TBL-MAX
014990       PERFORM
015000           WITH TEST AFTER
015010           UNTIL (NOT GOOD-MATCH-FOUND)
015020               OR (IX-WS-554-TBL-CMPR NOT GREATER
015030                     IX-WS-554-TBL)
015040         MOVE WS-554-TBL-ENTRY (IX-WS-554-TBL-CMPR) TO
015050               WS-CMPR-554-ENTRY
015060         IF (WS-CMPR-554-PROD-BYTE (1) EQUAL '*' OR
015070                   WS-CURR-554-PROD-BYTE (1))
015080             AND (WS-CMPR-554-PROD-BYTE (2) EQUAL '*' OR
015090                   WS-CURR-554-PROD-BYTE (2))
015100             AND (WS-CMPR-554-PROD-BYTE (3) EQUAL '*' OR
015110                   WS-58-PROD-BYTE (1))
015120             AND (WS-CMPR-554-PROD-BYTE (4) EQUAL '*' OR
015130                   WS-58-PROD-BYTE (2))
015140             AND (WS-CMPR-554-PROD-BYTE (5) EQUAL '*' OR
015150                   WS-58-PROD-BYTE (3))
015160             AND (WS-CMPR-554-PROD-BYTE (6) EQUAL '*' OR
015170                   WS-58-PROD-BYTE (4))
015180             AND (WS-CMPR-554-PROD-BYTE (7) EQUAL '*' OR
015190                   WS-58-PROD-BYTE (5))
015200             AND (WS-CMPR-554-PROD-BYTE (8) EQUAL '*' OR
015210                   WS-58-PROD-BYTE (6))
015220             AND (WS-CMPR-554-PROD-BYTE (9) EQUAL '*' OR
015230                   WS-58-PROD-BYTE (7))
015240             AND (WS-CMPR-554-PROD-BYTE (10) EQUAL '*' OR
015250                   WS-58-PROD-BYTE (8))
015260             AND (WS-CMPR-554-PROD-BYTE (11) EQUAL '*' OR
015270                   WS-58-PROD-BYTE (9))
015280             AND (WS-CMPR-554-PROD-BYTE (12) EQUAL '*' OR
015290                   WS-58-PROD-BYTE (10))
015300             AND (WS-CMPR-554-PROD-BYTE (13) EQUAL '*' OR
015310                   WS-58-PROD-BYTE (11))
015320             AND (WS-CMPR-554-DQ EQUAL SPACE OR WS-58-DQ)
015330             AND (WS-CMPR-554-UNITS EQUAL SPACE OR
015340                   WS-CURR-554-UNITS)
015350             AND (WS-CMPR-554-REO EQUAL SPACE OR WS-CURR-554-REO)
015360             AND (WS-CMPR-554-AOE EQUAL SPACE OR WS-CURR-554-AOE)
015370             AND ((WS-CMPR-554-ATTR (1) EQUAL '*')
015380                 OR ((WS-CMPR-554-ATTR (1) NOT EQUAL '-')
015390                     AND (WS-58-551-ATTR EQUAL
015400                           WS-CMPR-554-ATTR (1) OR
015410                           WS-CMPR-554-ATTR (2) OR
015420                           WS-CMPR-554-ATTR (3) OR
015430                           WS-CMPR-554-ATTR (4) OR
015440                           WS-CMPR-554-ATTR (5)))
015450                 OR ((WS-CMPR-554-ATTR (1) EQUAL '-')
015460                     AND (WS-58-551-ATTR NOT EQUAL
015470                           WS-CMPR-554-ATTR (2) AND
015480                           WS-CMPR-554-ATTR (3) AND
015490                           WS-CMPR-554-ATTR (4) AND
015500                           WS-CMPR-554-ATTR (5))))
015510*                * BOTH ENTRIES DO APPLY TO THE SAME PRODUCT, BUT
015520*                 MUST CHECK FURTHER TO ENSURE THAT IT'S NOT A
015530*                 COMPOSITE WITH FLOATING STEP-2 OR -3 (EACH HAS
015540*                 A NON-BLANK VALUE IN ONE OF THE BASIS CODES THAT
015550*                 IS BLANK IN THE OTHER) *
015560           IF (((WS-CURR-554-BASIS-1 EQUAL SPACE)
015570                       AND (WS-CMPR-554-BASIS-1 NOT EQUAL SPACE))
015580                   OR ((WS-CURR-554-BASIS-2 EQUAL SPACE)
015590                       AND (WS-CMPR-554-BASIS-2 NOT EQUAL SPACE))
015600                   OR ((WS-CURR-554-BASIS-3 EQUAL SPACE)
015610                       AND (WS-CMPR-554-BASIS-3 NOT EQUAL SPACE)))
015620               AND (((WS-CMPR-554-BASIS-1 EQUAL SPACE)
015630                       AND (WS-CURR-554-BASIS-1 NOT EQUAL SPACE))
015640                   OR ((WS-CMPR-554-BASIS-2 EQUAL SPACE)
015650                       AND (WS-CURR-554-BASIS-2 NOT EQUAL SPACE))
015660                   OR ((WS-CMPR-554-BASIS-3 EQUAL SPACE)
015670                       AND (WS-CURR-554-BASIS-3 NOT EQUAL SPACE)))
015680             SET IX-WS-554-TBL-CMPR DOWN BY 1
015690           ELSE
015700             MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
015710             MOVE 'Y' TO WS-ENTRY-OTHER-FLAG
015720           END-IF
015730         ELSE
015740           SET IX-WS-554-TBL-CMPR DOWN BY 1
015750         END-IF
015760       END-PERFORM.
015770*
015780   3700-REPORT-554-ENTRY.
015790     MOVE WS-DTL-LIVE-OR-TEST TO WS-DTL-554-FILE.
015800     MOVE WS-552-554-SHORT-KEY TO WS-DTL-554-REC-KEY.
015810     MOVE WS-CURR-554-PROD-13 TO WS-DTL-554-PROD-13.
015820     MOVE WS-CURR-554-DQ TO WS-DTL-554-DQ.
015830     MOVE WS-CURR-554-UNITS TO WS-DTL-554-UNITS.
015840     MOVE WS-CURR-554-REO TO WS-DTL-554-REO.
015850     MOVE WS-CURR-554-AOE TO WS-DTL-554-AOE.
015860     MOVE WS-CURR-554-ATTRS TO WS-DTL-554-ATTRS.
015870     IF OTHER-BLOCK-FOUND
015880       MOVE WS-DTL-RSN-BLK-ENT TO WS-DTL-554-REASON
015890     ELSE
015900       MOVE WS-DTL-RSN-NO-PR-ATTR TO WS-DTL-554-REASON.
015910     PERFORM 7000-PRINT-DETAIL.
015920*
015930*
015940   4000-I877-CONSID-NBR.
015950     MOVE 0 TO WS-877-TBL-ENT-CT.
015960     MOVE WS-I877-CONSID-NBR TO WS-877-CONSID-NBR.
015970     PERFORM
015980         WITH TEST AFTER
015990         UNTIL END-I877-FILE
016000             OR (WS-I877-CONSID-NBR GREATER WS-877-CONSID-NBR)
016010       IF WS-I877-REC-TYPE EQUAL '5'
016020         ADD 1 TO WS-877-TBL-ENT-CT
016030         MOVE WS-I877-REC-NBR TO
016040               WS-877-TBL-REC-NBR (WS-877-TBL-ENT-CT)
016050         MOVE I877-5-MATCH-FIELDS TO
016060               WS-877-TBL-MAT-FLDS (WS-877-TBL-ENT-CT)
016070         MOVE I877-5-ADDL-MATCH-FIELDS TO
016080               WS-877-TBL-ADDL-MAT (WS-877-TBL-ENT-CT)
016090         IF I877-5-GROUP-CODE-1 EQUAL SPACE
016100           MOVE 'Y' TO WS-877-TBL-BLK-FLG (WS-877-TBL-ENT-CT)
016110         ELSE
016120           MOVE 'N' TO WS-877-TBL-BLK-FLG (WS-877-TBL-ENT-CT)
016130         END-IF
016140       END-IF
016150       PERFORM 4100-READ-I877-FILE
016160     END-PERFORM.
016170     IF WS-877-TBL-ENT-CT GREATER 0
016180       PERFORM 4200-BUILD-C1130-TABLE
016190       SET IX-WS-877-TBL-MAX TO WS-877-TBL-ENT-CT
016200       SET IX-WS-877-TBL TO +1
016210       PERFORM 4500-CHECK-877-ENT
016220           WS-877-TBL-ENT-CT TIMES.
016230*
016240   4100-READ-I877-FILE.
016250     READ I877-FILE
016260       AT END
016270         MOVE 'E' TO WS-I877-FILE-FLAG
016280       NOT AT END
016290         IF I877-RECORD-KEY NOT GREATER WS-I877-SEQ
016300           DISPLAY '* I877 SEQUENCE ERROR "' WS-I877-SEQ '" "'
016310                 I877-RECORD-KEY '" *' UPON SYSOUT
016320           GO TO 9900-DISPLAY-ABORT
016330         END-IF
016340         MOVE I877-RECORD-KEY TO WS-I877-SEQ
016350     END-READ.
016360*
016370   4200-BUILD-C1130-TABLE.
016380     MOVE 0 TO WS-C1130-TBL-ENT-CT.
016390     PERFORM 4300-READ-I1130P-FILE
016400         WITH TEST BEFORE
016410         UNTIL END-I1130P-FILE
016420             OR (WS-I1130P-CONSID-NBR NOT LESS WS-877-CONSID-NBR).
016430     IF WS-I1130P-CONSID-NBR EQUAL WS-877-CONSID-NBR
016440       PERFORM
016450           WITH TEST AFTER
016460           UNTIL END-I1130P-FILE
016470               OR (WS-I1130P-CONSID-NBR GREATER WS-877-CONSID-NBR)
016480         IF WS-C1130-TBL-ENT-CT NOT LESS 300
016490           DISPLAY '* C1130 TABLE OVERFLOWED FOR CONSID NUMBER "'
016500                 WS-877-CONSID-NBR '" *' UPON SYSOUT
016510           GO TO 9900-DISPLAY-ABORT
016520         END-IF
016530         ADD 1 TO WS-C1130-TBL-ENT-CT
016540         MOVE I1130P-PROD-13 TO
016550               WS-C1130-TBL-ENTRY (WS-C1130-TBL-ENT-CT)
016560         PERFORM 4300-READ-I1130P-FILE
016570       END-PERFORM
016580       IF WS-C1130-TBL-ENT-CT GREATER 240
016590         DISPLAY 'C1130 TABLE OVER 80% FULL FOR CONSID NUMBER "'
016600               WS-877-CONSID-NBR '.' UPON SYSOUT
016610         MOVE 'Y' TO WS-RETURN-07-FLAG.
016620*
016630   4300-READ-I1130P-FILE.
016640     READ I1130P-FILE
016650       AT END
016660         MOVE 'E' TO WS-I1130P-FILE-FLAG
016670       NOT AT END
016680         IF I1130P-CONSID-NBR LESS WS-I1130P-CONSID-NBR
016690           DISPLAY '* I1130P SEQUENCE ERROR "'
016700                 WS-I1130P-CONSID-NBR '" "' I1130P-CONSID-NBR
016710                 '" *' UPON SYSOUT
016720           GO TO 9900-DISPLAY-ABORT
016730         END-IF
016740         MOVE I1130P-CONSID-NBR TO WS-I1130P-CONSID-NBR
016750     END-READ.
016760*
016770   4500-CHECK-877-ENT.
016780     MOVE WS-877-TBL-ENTRY (IX-WS-877-TBL) TO WS-CURR-877-ENTRY.
016790     SET IX-WS-58-TBL-SRCH-MAX TO IX-WS-58-TBL-MAX.
016800     SET IX-WS-58-TBL-SRCH-MIN TO +1.
016810     IF WS-CURR-877-PROD-BYTE (3) IS NUMERIC
016820       PERFORM
016830           WITH TEST BEFORE
016840           UNTIL (IX-WS-58-TBL-SRCH-MIN NOT LESS
016850                 IX-WS-58-TBL-SRCH-MAX)
016860               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MIN)
016870                     NOT LESS WS-CURR-877-PROD-BYTE (3))
016880         SET IX-WS-58-TBL-SRCH-MIN UP BY 1
016890       END-PERFORM
016900       PERFORM
016910           WITH TEST BEFORE
016920           UNTIL (IX-WS-58-TBL-SRCH-MAX NOT GREATER
016930                 IX-WS-58-TBL-SRCH-MIN)
016940               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MAX)
016950                     NOT GREATER WS-CURR-877-PROD-BYTE (3))
016960         SET IX-WS-58-TBL-SRCH-MAX DOWN BY 1
016970       END-PERFORM.
016980     MOVE SPACE TO WS-ENTRY-FLAGS.
016990     SET IX-WS-58-TBL TO IX-WS-58-TBL-SRCH-MIN.
017000     PERFORM
017010         WITH TEST AFTER
017020         UNTIL GOOD-MATCH-FOUND
017030             OR (IX-WS-58-TBL GREATER IX-WS-58-TBL-SRCH-MAX)
017040       MOVE WS-58-TBL-ENTRY (IX-WS-58-TBL) TO WS-58-ENTRY
017050       IF ((WS-CURR-877-PROD-13 EQUAL SPACE)
017060               OR ((WS-CURR-877-PROD-BYTE (3) EQUAL '*' OR
017070                         WS-58-PROD-BYTE (1))
017080                   AND (WS-CURR-877-PROD-BYTE (4) EQUAL '*' OR
017090                         WS-58-PROD-BYTE (2))
017100                   AND (WS-CURR-877-PROD-BYTE (5) EQUAL '*' OR
017110                         WS-58-PROD-BYTE (3))
017120                   AND (WS-CURR-877-PROD-BYTE (6) EQUAL '*' OR
017130                         WS-58-PROD-BYTE (4))
017140                   AND (WS-CURR-877-PROD-BYTE (7) EQUAL '*' OR
017150                         WS-58-PROD-BYTE (5))
017160                   AND (WS-CURR-877-PROD-BYTE (8) EQUAL '*' OR
017170                         WS-58-PROD-BYTE (6))
017180                   AND (WS-CURR-877-PROD-BYTE (9) EQUAL '*' OR
017190                         WS-58-PROD-BYTE (7))
017200                   AND (WS-CURR-877-PROD-BYTE (10) EQUAL '*' OR
017210                         WS-58-PROD-BYTE (8))
017220                   AND (WS-CURR-877-PROD-BYTE (11) EQUAL '*' OR
017230                         WS-58-PROD-BYTE (9))
017240                   AND (WS-CURR-877-PROD-BYTE (12) EQUAL '*' OR
017250                         WS-58-PROD-BYTE (10))
017260                   AND (WS-CURR-877-PROD-BYTE (13) EQUAL '*' OR
017270                         WS-58-PROD-BYTE (11))))
017280           AND (WS-CURR-877-DQ EQUAL SPACE OR WS-58-DQ)
017290         PERFORM 4600-VERIFY-877-MATCH
017300       END-IF
017310       SET IX-WS-58-TBL UP BY 1
017320     END-PERFORM.
017330     IF NOT GOOD-MATCH-FOUND
017340       PERFORM 4700-REPORT-877-ENTRY.
017350     SET IX-WS-877-TBL UP BY 1.
017360*
017370   4600-VERIFY-877-MATCH.
017380     MOVE 'Y' TO WS-ENTRY-GOOD-MATCH-FLAG.
017390     IF IX-WS-877-TBL GREATER +1
017400       SET IX-WS-877-TBL-CMPR TO +1
017410       PERFORM
017420           WITH TEST AFTER
017430           UNTIL (NOT GOOD-MATCH-FOUND)
017440               OR (IX-WS-877-TBL-CMPR NOT LESS IX-WS-877-TBL)
017450         MOVE WS-877-TBL-ENTRY (IX-WS-877-TBL-CMPR) TO
017460               WS-CMPR-877-ENTRY
017470         IF ((WS-CMPR-877-PROD-13 EQUAL SPACE)
017480                 OR ((WS-CMPR-877-PROD-BYTE (1) EQUAL '*' OR
017490                           WS-CURR-877-PROD-BYTE (1))
017500                     AND (WS-CMPR-877-PROD-BYTE (2) EQUAL '*' OR
017510                           WS-CURR-877-PROD-BYTE (2))
017520                     AND (WS-CMPR-877-PROD-BYTE (3) EQUAL '*' OR
017530                           WS-58-PROD-BYTE (1))
017540                     AND (WS-CMPR-877-PROD-BYTE (4) EQUAL '*' OR
017550                           WS-58-PROD-BYTE (2))
017560                     AND (WS-CMPR-877-PROD-BYTE (5) EQUAL '*' OR
017570                           WS-58-PROD-BYTE (3))
017580                     AND (WS-CMPR-877-PROD-BYTE (6) EQUAL '*' OR
017590                           WS-58-PROD-BYTE (4))
017600                     AND (WS-CMPR-877-PROD-BYTE (7) EQUAL '*' OR
017610                           WS-58-PROD-BYTE (5))
017620                     AND (WS-CMPR-877-PROD-BYTE (8) EQUAL '*' OR
017630                           WS-58-PROD-BYTE (6))
017640                     AND (WS-CMPR-877-PROD-BYTE (9) EQUAL '*' OR
017650                           WS-58-PROD-BYTE (7))
017660                     AND (WS-CMPR-877-PROD-BYTE (10) EQUAL '*' OR
017670                           WS-58-PROD-BYTE (8))
017680                     AND (WS-CMPR-877-PROD-BYTE (11) EQUAL '*' OR
017690                           WS-58-PROD-BYTE (9))
017700                     AND (WS-CMPR-877-PROD-BYTE (12) EQUAL '*' OR
017710                           WS-58-PROD-BYTE (10))
017720                     AND (WS-CMPR-877-PROD-BYTE (13) EQUAL '*' OR
017730                           WS-58-PROD-BYTE (11))))
017740             AND (WS-CMPR-877-DQ EQUAL SPACE OR WS-58-DQ)
017750             AND (WS-CMPR-877-UNITS EQUAL SPACE OR
017760                   WS-CURR-877-UNITS)
017770             AND (WS-CMPR-877-AOE EQUAL SPACE OR WS-CURR-877-AOE)
017780             AND (WS-CMPR-877-MED EQUAL SPACE OR WS-CURR-877-MED)
017790             AND (WS-CMPR-877-REO EQUAL SPACE OR WS-CURR-877-REO)
017800             AND (WS-CMPR-877-BC EQUAL SPACE OR WS-CURR-877-BC)
017810             AND (WS-CMPR-877-BRCH EQUAL SPACE OR
017820                   WS-CURR-877-BRCH)
017830             AND ((WS-CMPR-877-ORD-CH EQUAL SPACE OR
017840                   WS-CURR-877-ORD-CH)
017850                 OR ((WS-CMPR-877-ORD-CH EQUAL '$')
017860                     AND (WS-CURR-877-ORD-CH EQUAL '1' OR '7' OR
017870                           '8' OR '9' OR 'C' OR 'D'))
017880                 OR ((WS-CMPR-877-ORD-CH EQUAL '@')
017890                     AND (WS-CURR-877-ORD-CH EQUAL '2' OR '3' OR
017900                           '4' OR '5' OR '6' OR 'A' OR 'B' OR 'E'
017910                           OR 'I' OR 'J')))
017920           MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
017930           MOVE 'Y' TO WS-ENTRY-OTHER-FLAG
017940         ELSE
017950           SET IX-WS-877-TBL-CMPR UP BY 1
017960         END-IF
017970       END-PERFORM.
017980     IF GOOD-MATCH-FOUND
017990         AND (NOT CURR-877-IS-BLOCKER)
018000         AND (WS-58-C1128-BLOCK EQUAL 'B' OR 'R')
018010         AND (WS-877-CONSID-NBR (1:4) NOT EQUAL '7792' AND '7793')
018020       IF WS-C1130-TBL-ENT-CT EQUAL 0
018030         MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
018040         MOVE 'Y' TO WS-ENTRY-C1128-FLAG
018050       ELSE
018060         MOVE SPACE TO WS-FOUND-FLAG
018070         SET IX-WS-C1130-TBL TO WS-C1130-TBL-ENT-CT
018080         PERFORM
018090             WITH TEST AFTER
018100             UNTIL NOT STILL-LOOKING
018110           MOVE WS-C1130-TBL-ENTRY (IX-WS-C1130-TBL) TO
018120                 WS-C1130-PROD-13
018130           IF ((WS-CURR-877-PROD-BYTE (1) EQUAL '*')
018140                   OR (WS-C1130-PROD-BYTE (1) EQUAL '*'
018150                         OR WS-CURR-877-PROD-BYTE (1)))
018160               AND ((WS-CURR-877-PROD-BYTE (2) EQUAL '*')
018170                   OR (WS-C1130-PROD-BYTE (2) EQUAL '*'
018180                         OR WS-CURR-877-PROD-BYTE (2)))
018190               AND (WS-C1130-PROD-BYTE (3) EQUAL '*' OR
018200                     WS-58-PROD-BYTE (1))
018210               AND (WS-C1130-PROD-BYTE (4) EQUAL '*' OR
018220                     WS-58-PROD-BYTE (2))
018230               AND (WS-C1130-PROD-BYTE (5) EQUAL '*' OR
018240                     WS-58-PROD-BYTE (3))
018250               AND (WS-C1130-PROD-BYTE (6) EQUAL '*' OR
018260                     WS-58-PROD-BYTE (4))
018270               AND (WS-C1130-PROD-BYTE (7) EQUAL '*' OR
018280                     WS-58-PROD-BYTE (5))
018290               AND (WS-C1130-PROD-BYTE (8) EQUAL '*' OR
018300                     WS-58-PROD-BYTE (6))
018310               AND (WS-C1130-PROD-BYTE (9) EQUAL '*' OR
018320                     WS-58-PROD-BYTE (7))
018330               AND (WS-C1130-PROD-BYTE (10) EQUAL '*' OR
018340                     WS-58-PROD-BYTE (8))
018350               AND (WS-C1130-PROD-BYTE (11) EQUAL '*' OR
018360                     WS-58-PROD-BYTE (9))
018370               AND (WS-C1130-PROD-BYTE (12) EQUAL '*' OR
018380                     WS-58-PROD-BYTE (10))
018390               AND (WS-C1130-PROD-BYTE (13) EQUAL '*' OR
018400                     WS-58-PROD-BYTE (11))
018410             MOVE 'Y' TO WS-FOUND-FLAG
018420           ELSE
018430             IF IX-WS-C1130-TBL GREATER 1
018440               SET IX-WS-C1130-TBL DOWN BY 1
018450             ELSE
018460               MOVE 'N' TO WS-FOUND-FLAG
018470               MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
018480               MOVE 'Y' TO WS-ENTRY-C1128-FLAG
018490             END-IF
018500           END-IF
018510         END-PERFORM.
018520*
018530   4700-REPORT-877-ENTRY.
018540     MOVE WS-877-CONSID-NBR TO WS-DTL-877-KEY-CONSID.
018550     MOVE '5' TO WS-DTL-877-KEY-REC-TYP.
018560     MOVE WS-CURR-877-REC-NBR TO WS-DTL-877-KEY-SEQ-NBR.
018570     MOVE WS-CURR-877-PROD-13 TO WS-DTL-877-PROD-13.
018580     MOVE WS-CURR-877-DQ TO WS-DTL-877-DQ.
018590     MOVE WS-CURR-877-UNITS TO WS-DTL-877-UNITS.
018600     MOVE WS-CURR-877-AOE TO WS-DTL-877-AOE.
018610     MOVE WS-CURR-877-MED TO WS-DTL-877-MED.
018620     MOVE WS-CURR-877-REO TO WS-DTL-877-REO.
018630     MOVE WS-CURR-877-BC TO WS-DTL-877-BC.
018640     MOVE WS-CURR-877-BRCH TO WS-DTL-877-BRCH.
018650     MOVE WS-CURR-877-ORD-CH TO WS-DTL-877-ORD-CH.
018660     IF C1128-BLOCK-FOUND
018670       IF OTHER-BLOCK-FOUND
018680         MOVE WS-DTL-RSN-BLK-C1128-SEQ TO WS-DTL-877-REASON
018690       ELSE
018700         MOVE WS-DTL-RSN-BLK-C1128 TO WS-DTL-877-REASON
018710     ELSE
018720       IF OTHER-BLOCK-FOUND
018730         MOVE WS-DTL-RSN-BLK-SEQ TO WS-DTL-877-REASON
018740       ELSE
018750         MOVE WS-DTL-RSN-NO-PROD TO WS-DTL-877-REASON.
018760     PERFORM 7000-PRINT-DETAIL.
018770*
018780*
018790   5000-I8934-KEY.
018800     IF I8934-ENTRY-COUNT NOT EQUAL +0
018810       MOVE 0 TO WS-8934-TBL-ENT-CT
018820       MOVE I8934-KEY TO WS-8934-KEY
018830       SET I8934-IX-ENTRY TO +1
018840       PERFORM
018850           I8934-ENTRY-COUNT TIMES
018860         ADD 1 TO WS-8934-TBL-ENT-CT
018870         MOVE I8934-MATCH-FIELDS (I8934-IX-ENTRY) TO
018880               WS-8934-TBL-MATCH-FLDS (WS-8934-TBL-ENT-CT)
018890         SET I8934-IX-ENTRY UP BY 1
018900       END-PERFORM
018910       SET IX-WS-8934-TBL-MAX TO WS-8934-TBL-ENT-CT
018920       SET IX-WS-8934-TBL TO +1
018930       PERFORM 5500-CHECK-8934-ENT
018940           WS-8934-TBL-ENT-CT TIMES.
018950     PERFORM 5100-READ-I8934-FILE.
018960*
018970   5100-READ-I8934-FILE.
018980     READ I8934-FILE NEXT RECORD.
018990     IF (NOT WS-I8934-SUCCESSFUL)
019000         AND (NOT WS-I8934-END-OF-FILE)
019010       DISPLAY '* VSAM ERROR ON I8934 READ.  FILE STATUS = '
019020             WS-I8934-FILE-STATUS '. *' UPON SYSOUT
019030       GO TO 9900-DISPLAY-ABORT.
019040*
019050   5200-I8934T-KEY.
019060     IF O8934-ENTRY-COUNT NOT EQUAL +0
019070       MOVE 0 TO WS-8934-TBL-ENT-CT
019080       MOVE O8934-KEY TO WS-8934-KEY
019090       SET O8934-IX-ENTRY TO +1
019100       PERFORM
019110           O8934-ENTRY-COUNT TIMES
019120         ADD 1 TO WS-8934-TBL-ENT-CT
019130         MOVE O8934-MATCH-FIELDS (O8934-IX-ENTRY) TO
019140               WS-8934-TBL-MATCH-FLDS (WS-8934-TBL-ENT-CT)
019150         SET O8934-IX-ENTRY UP BY 1
019160       END-PERFORM
019170       SET IX-WS-8934-TBL-MAX TO WS-8934-TBL-ENT-CT
019180       SET IX-WS-8934-TBL TO +1
019190       PERFORM 5500-CHECK-8934-ENT
019200           WS-8934-TBL-ENT-CT TIMES.
019210     PERFORM 5300-READ-I8934T-FILE.
019220*
019230   5300-READ-I8934T-FILE.
019240     READ I8934T-FILE NEXT RECORD.
019250     IF (NOT WS-I8934T-SUCCESSFUL)
019260         AND (NOT WS-I8934T-END-OF-FILE)
019270       DISPLAY '* VSAM ERROR ON I8934T READ.  FILE STATUS = '
019280             WS-I8934T-FILE-STATUS '. *' UPON SYSOUT
019290       GO TO 9900-DISPLAY-ABORT.
019300*
019310   5500-CHECK-8934-ENT.
019320     MOVE WS-8934-TBL-ENTRY (IX-WS-8934-TBL) TO
019330           WS-CURR-8934-ENTRY.
019340     SET IX-WS-58-TBL-SRCH-MAX TO IX-WS-58-TBL-MAX.
019350     SET IX-WS-58-TBL-SRCH-MIN TO +1.
019360     IF WS-CURR-8934-PROD-BYTE (1) IS NUMERIC
019370       PERFORM
019380           WITH TEST BEFORE
019390           UNTIL (IX-WS-58-TBL-SRCH-MIN NOT LESS
019400                 IX-WS-58-TBL-SRCH-MAX)
019410               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MIN)
019420                     NOT LESS WS-CURR-8934-PROD-BYTE (1))
019430         SET IX-WS-58-TBL-SRCH-MIN UP BY 1
019440       END-PERFORM
019450       PERFORM
019460           WITH TEST BEFORE
019470           UNTIL (IX-WS-58-TBL-SRCH-MAX NOT GREATER
019480                 IX-WS-58-TBL-SRCH-MIN)
019490               OR (WS-58-TBL-ENT-BYTE-1 (IX-WS-58-TBL-SRCH-MAX)
019500                     NOT GREATER WS-CURR-8934-PROD-BYTE (1))
019510         SET IX-WS-58-TBL-SRCH-MAX DOWN BY 1
019520       END-PERFORM.
019530     MOVE SPACE TO WS-ENTRY-FLAGS.
019540     SET IX-WS-58-TBL TO IX-WS-58-TBL-SRCH-MIN.
019550     PERFORM
019560         WITH TEST AFTER
019570         UNTIL GOOD-MATCH-FOUND
019580             OR (IX-WS-58-TBL GREATER IX-WS-58-TBL-SRCH-MAX)
019590       MOVE WS-58-TBL-ENTRY (IX-WS-58-TBL) TO WS-58-ENTRY
019600       IF ((WS-CURR-8934-PROD-10 EQUAL SPACE)
019610               OR ((WS-CURR-8934-PROD-BYTE (1) EQUAL '*' OR
019620                         WS-58-PROD-BYTE (1))
019630                   AND (WS-CURR-8934-PROD-BYTE (2) EQUAL '*' OR
019640                         WS-58-PROD-BYTE (2))
019650                   AND (WS-CURR-8934-PROD-BYTE (3) EQUAL '*' OR
019660                         WS-58-PROD-BYTE (3))
019670                   AND (WS-CURR-8934-PROD-BYTE (4) EQUAL '*' OR
019680                         WS-58-PROD-BYTE (4))
019690                   AND (WS-CURR-8934-PROD-BYTE (5) EQUAL '*' OR
019700                         WS-58-PROD-BYTE (5))
019710                   AND (WS-CURR-8934-PROD-BYTE (6) EQUAL '*' OR
019720                         WS-58-PROD-BYTE (6))
019730                   AND (WS-CURR-8934-PROD-BYTE (7) EQUAL '*' OR
019740                         WS-58-PROD-BYTE (7))
019750                   AND (WS-CURR-8934-PROD-BYTE (8) EQUAL '*' OR
019760                         WS-58-PROD-BYTE (8))
019770                   AND (WS-CURR-8934-PROD-BYTE (9) EQUAL '*' OR
019780                         WS-58-PROD-BYTE (9))
019790                   AND (WS-CURR-8934-PROD-BYTE (10) EQUAL '*' OR
019800                         WS-58-PROD-BYTE (10))))
019810           AND ((WS-CURR-8934-IMP-QTY-N NOT NUMERIC)
019820               OR (WS-58-DQ-N NOT NUMERIC)
019830               OR (WS-CURR-8934-IMP-QTY-N NOT LESS WS-58-DQ-N))
019840           AND (WS-58-551-ATTR NOT EQUAL 'X' AND '?')
019850         PERFORM 5600-VERIFY-8934-MATCH
019860       END-IF
019870       SET IX-WS-58-TBL UP BY 1
019880     END-PERFORM.
019890     IF NOT GOOD-MATCH-FOUND
019900       PERFORM 5700-REPORT-8934-ENTRY.
019910     SET IX-WS-8934-TBL UP BY 1.
019920*
019930   5600-VERIFY-8934-MATCH.
019940     MOVE 'Y' TO WS-ENTRY-GOOD-MATCH-FLAG.
019950     IF IX-WS-8934-TBL LESS IX-WS-8934-TBL-MAX
019960       SET IX-WS-8934-TBL-CMPR TO IX-WS-8934-TBL-MAX
019970       PERFORM
019980           WITH TEST AFTER
019990           UNTIL (NOT GOOD-MATCH-FOUND)
020000               OR (IX-WS-8934-TBL-CMPR NOT GREATER
020010                     IX-WS-8934-TBL)
020020         MOVE WS-8934-TBL-ENTRY (IX-WS-8934-TBL-CMPR) TO
020030               WS-CMPR-8934-ENTRY
020040         IF ((WS-CMPR-8934-PROD-10 EQUAL SPACE)
020050                 OR ((WS-CMPR-8934-PROD-BYTE (1) EQUAL '*' OR
020060                           WS-58-PROD-BYTE (1))
020070                     AND (WS-CMPR-8934-PROD-BYTE (2) EQUAL '*' OR
020080                           WS-58-PROD-BYTE (2))
020090                     AND (WS-CMPR-8934-PROD-BYTE (3) EQUAL '*' OR
020100                           WS-58-PROD-BYTE (3))
020110                     AND (WS-CMPR-8934-PROD-BYTE (4) EQUAL '*' OR
020120                           WS-58-PROD-BYTE (4))
020130                     AND (WS-CMPR-8934-PROD-BYTE (5) EQUAL '*' OR
020140                           WS-58-PROD-BYTE (5))
020150                     AND (WS-CMPR-8934-PROD-BYTE (6) EQUAL '*' OR
020160                           WS-58-PROD-BYTE (6))
020170                     AND (WS-CMPR-8934-PROD-BYTE (7) EQUAL '*' OR
020180                           WS-58-PROD-BYTE (7))
020190                     AND (WS-CMPR-8934-PROD-BYTE (8) EQUAL '*' OR
020200                           WS-58-PROD-BYTE (8))
020210                     AND (WS-CMPR-8934-PROD-BYTE (9) EQUAL '*' OR
020220                           WS-58-PROD-BYTE (9))
020230                     AND (WS-CMPR-8934-PROD-BYTE (10) EQUAL '*' OR
020240                           WS-58-PROD-BYTE (10))))
020250             AND (WS-CMPR-8934-IMP-QTY-X EQUAL SPACE OR
020260                   WS-CURR-8934-IMP-QTY-X)
020270             AND (WS-CMPR-8934-REO EQUAL SPACE OR
020280                   WS-CURR-8934-REO)
020290             AND ((WS-CMPR-8934-ORD-CH EQUAL SPACE OR
020300                   WS-CURR-8934-ORD-CH)
020310                 OR ((WS-CMPR-8934-ORD-CH EQUAL '$')
020320                     AND (WS-CURR-8934-ORD-CH EQUAL '1' OR '7' OR
020330                           '8' OR '9' OR 'C' OR 'D'))
020340                 OR ((WS-CMPR-8934-ORD-CH EQUAL '@')
020350                     AND (WS-CURR-8934-ORD-CH EQUAL '2' OR '3' OR
020360                           '4' OR '5' OR '6' OR 'A' OR 'B' OR 'E'
020370                           OR 'I' OR 'J')))
020380           MOVE SPACE TO WS-ENTRY-GOOD-MATCH-FLAG
020390           MOVE 'Y' TO WS-ENTRY-OTHER-FLAG
020400         ELSE
020410           SET IX-WS-8934-TBL-CMPR DOWN BY 1
020420         END-IF
020430       END-PERFORM.
020440*
020450   5700-REPORT-8934-ENTRY.
020460     MOVE WS-DTL-LIVE-OR-TEST TO WS-DTL-8934-FILE.
020470     MOVE WS-8934-KEY-HC TO WS-DTL-8934-KEY-HC.
020480     MOVE WS-8934-KEY-MBC TO WS-DTL-8934-KEY-MBC.
020490     MOVE WS-8934-KEY-BC TO WS-DTL-8934-KEY-BC.
020500     MOVE WS-8934-KEY-EXP TO WS-DTL-8934-KEY-EXP.
020510     MOVE WS-CURR-8934-PROD-10 TO WS-DTL-8934-PROD-10.
020520     IF WS-CURR-8934-IMP-QTY-N IS NUMERIC
020530       MOVE WS-CURR-8934-IMP-QTY-N TO WS-DTL-8934-IMP-QTY.
020540     MOVE WS-CURR-8934-REO TO WS-DTL-8934-REO.
020550     MOVE WS-CURR-8934-ORD-CH TO WS-DTL-8934-ORD-CH.
020560     IF OTHER-BLOCK-FOUND
020570       MOVE WS-DTL-RSN-BLK-ENT TO WS-DTL-8934-REASON
020580     ELSE
020590       MOVE WS-DTL-RSN-NO-PR-ATTR TO WS-DTL-8934-REASON.
020600     PERFORM 7000-PRINT-DETAIL.
020610*
020620*
020630   7000-PRINT-DETAIL.
020640     IF WS-LINE-COUNT GREATER 58
020650       PERFORM 7200-PRINT-HEADING1
020660       MOVE SPACE TO PR1-REC
020670       PERFORM 7100-WRITE-PR1-REC
020680       MOVE WS-HEADING-2 TO PR1-REC
020690       PERFORM 7100-WRITE-PR1-REC
020700       MOVE SPACE TO PR1-REC
020710       PERFORM 7100-WRITE-PR1-REC.
020720     MOVE WS-DETAIL-LINE TO PR1-REC.
020730     PERFORM 7100-WRITE-PR1-REC.
020740     MOVE SPACE TO WS-DETAIL-LINE.
020750*
020760   7100-WRITE-PR1-REC.
020770     WRITE PR1-REC AFTER 1.
020780     ADD 1 TO WS-LINE-COUNT.
020790*
020800   7200-PRINT-HEADING1.
020810     WRITE PR1-REC FROM WS-HEADING-1 AFTER PAGE.
020820     MOVE 1 TO WS-LINE-COUNT.
020830*
020840   7500-CHECK-FOR-NONE.
020850     IF WS-LINE-COUNT EQUAL 90
020860       PERFORM 7200-PRINT-HEADING1
020870       MOVE SPACE TO PR1-REC
020880       PERFORM 7100-WRITE-PR1-REC
020890       MOVE SPACE TO PR1-REC
020900       MOVE '(NONE)' TO PR1-REC (3:6)
020910       PERFORM 7100-WRITE-PR1-REC.
020920*
020930*
020940   8000-INITIALIZE.
020950*
020960 COPY CPY005.
020970*
020980     OPEN OUTPUT PRINTER1-FILE
020990         INPUT I1220P-FILE I1130P-FILE I1128P-FILE I877-FILE
021000               I58-FILE I551-FILE.
021010     IF NOT WS-I551-SUCCESSFUL-OPEN
021020       DISPLAY '* VSAM ERROR ON I551 OPEN.  FILE STATUS = '
021030             WS-I551-FILE-STATUS '. *' UPON SYSOUT
021040       GO TO 9900-DISPLAY-ABORT.
021050     MOVE 'Y' TO WS-I551-FILE-FLAG.
021060     OPEN INPUT I552U-FILE.
021070     IF NOT WS-I552U-SUCCESSFUL-OPEN
021080       DISPLAY '* VSAM ERROR ON I552U OPEN.  FILE STATUS = '
021090             WS-I552U-FILE-STATUS '. *' UPON SYSOUT
021100       GO TO 9900-DISPLAY-ABORT.
021110     MOVE 'Y' TO WS-I552U-FILE-FLAG.
021120     OPEN INPUT I552T-FILE.
021130     IF NOT WS-I552T-SUCCESSFUL-OPEN
021140       DISPLAY '* VSAM ERROR ON I552T OPEN.  FILE STATUS = '
021150             WS-I552T-FILE-STATUS '. *' UPON SYSOUT
021160       GO TO 9900-DISPLAY-ABORT.
021170     MOVE 'Y' TO WS-I552T-FILE-FLAG.
021180     OPEN INPUT I554U-FILE.
021190     IF NOT WS-I554U-SUCCESSFUL-OPEN
021200       DISPLAY '* VSAM ERROR ON I554U OPEN.  FILE STATUS = '
021210             WS-I554U-FILE-STATUS '. *' UPON SYSOUT
021220       GO TO 9900-DISPLAY-ABORT.
021230     MOVE 'Y' TO WS-I554U-FILE-FLAG.
021240     OPEN INPUT I554T-FILE.
021250     IF NOT WS-I554T-SUCCESSFUL-OPEN
021260       DISPLAY '* VSAM ERROR ON I554T OPEN.  FILE STATUS = '
021270             WS-I554T-FILE-STATUS '. *' UPON SYSOUT
021280       GO TO 9900-DISPLAY-ABORT.
021290     MOVE 'Y' TO WS-I554T-FILE-FLAG.
021300     OPEN INPUT I8934-FILE.
021310     IF NOT WS-I8934-SUCCESSFUL-OPEN
021320       DISPLAY '* VSAM ERROR ON I8934 OPEN.  FILE STATUS = '
021330             WS-I8934-FILE-STATUS '. *' UPON SYSOUT
021340       GO TO 9900-DISPLAY-ABORT.
021350     MOVE 'Y' TO WS-I8934-FILE-FLAG.
021360     OPEN INPUT I8934T-FILE.
021370     IF NOT WS-I8934T-SUCCESSFUL-OPEN
021380       DISPLAY '* VSAM ERROR ON I8934T OPEN.  FILE STATUS = '
021390             WS-I8934T-FILE-STATUS '. *' UPON SYSOUT
021400       GO TO 9900-DISPLAY-ABORT.
021410     MOVE 'Y' TO WS-I8934T-FILE-FLAG.
021420     READ I1220P-FILE
021430       AT END
021440         DISPLAY '* I1220P IS AN EMPTY FILE *' UPON SYSOUT
021450         GO TO 9900-DISPLAY-ABORT.
021460     SET I1220P-IX TO +1.
021470     PERFORM
021480         WITH TEST BEFORE
021490         UNTIL (I1220P-IX NOT LESS +10)
021500             OR (I1220P-GENERIC-PR-DES (I1220P-IX) EQUAL 'A1')
021510       SET I1220P-IX UP BY 1
021520     END-PERFORM.
021530     IF I1220P-GENERIC-PR-DES (I1220P-IX) EQUAL 'A1'
021540       MOVE I1220P-SPECIFIC-PR-DES (I1220P-IX) TO
021550             WS-TGT-551-PR-DES
021560       DISPLAY 'I1220P CURRENT PRICE DESIGNATION = '
021570             WS-TGT-551-PR-DES '.' UPON SYSOUT
021580     ELSE
021590       DISPLAY '* I1220P HAS NO GENERIC PRICE DESIGNATION "A1" *'
021600             UPON SYSOUT
021610       GO TO 9900-DISPLAY-ABORT.
021620     PERFORM
021630         WITH TEST AFTER
021640         UNTIL (I551-MP-PRICE-DESIGNATION EQUAL WS-TGT-551-PR-DES)
021650       READ I551-FILE NEXT RECORD
021660       IF NOT WS-I551-SUCCESSFUL
021670         IF WS-I551-END-OF-FILE
021680           DISPLAY '* I551 HAS NO RECORDS FOR I1220P PRICE DESIGNA
021690-                'TION "' WS-TGT-551-PR-DES '" *' UPON SYSOUT
021700         ELSE
021710           DISPLAY '* VSAM ERROR ON I551 SEQUENTIAL READ.  FILE ST
021720-                'ATUS = ' WS-I551-FILE-STATUS '. *' UPON SYSOUT
021730         END-IF
021740         GO TO 9900-DISPLAY-ABORT
021750       END-IF
021760     END-PERFORM.
021770     PERFORM 1100-READ-I552U-FILE.
021780     IF WS-I552U-END-OF-FILE
021790       DISPLAY '* I552U IS AN EMPTY FILE *' UPON SYSOUT
021800       GO TO 9900-DISPLAY-ABORT.
021810     PERFORM 3100-READ-I554U-FILE.
021820     IF WS-I554U-END-OF-FILE
021830       DISPLAY '* I554U IS AN EMPTY FILE *' UPON SYSOUT
021840       GO TO 9900-DISPLAY-ABORT.
021850     PERFORM 4100-READ-I877-FILE.
021860     IF END-I877-FILE
021870       DISPLAY '* I877 IS AN EMPTY FILE *' UPON SYSOUT
021880       GO TO 9900-DISPLAY-ABORT.
021890     PERFORM 5100-READ-I8934-FILE.
021900     IF WS-I8934-END-OF-FILE
021910       DISPLAY '* I8934 IS AN EMPTY FILE *' UPON SYSOUT
021920       GO TO 9900-DISPLAY-ABORT.
021930     PERFORM 1300-READ-I552T-FILE.
021940     IF WS-I552T-END-OF-FILE
021950       DISPLAY 'I552T IS AN EMPTY FILE.' UPON SYSOUT
021960       MOVE 'Y' TO WS-RETURN-04-FLAG.
021970     PERFORM 3300-READ-I554T-FILE.
021980     IF WS-I554T-END-OF-FILE
021990       DISPLAY 'I554T IS AN EMPTY FILE.' UPON SYSOUT
022000       MOVE 'Y' TO WS-RETURN-04-FLAG.
022010     PERFORM 5300-READ-I8934T-FILE.
022020     IF WS-I8934T-END-OF-FILE
022030       DISPLAY 'I8934T IS AN EMPTY FILE.' UPON SYSOUT
022040       MOVE 'Y' TO WS-RETURN-04-FLAG.
022050     PERFORM 4300-READ-I1130P-FILE.
022060     IF END-I1130P-FILE
022070       DISPLAY 'I1130P IS AN EMPTY FILE.' UPON SYSOUT
022080       MOVE 'Y' TO WS-RETURN-04-FLAG.
022090     PERFORM 8100-BUILD-C1128-TABLE.
022100     PERFORM 8200-BUILD-58-TABLE.
022110     MOVE WS-PROGRAM-NUMBER TO WS-HD1-PROGRAM-NUMBER.
022120     MOVE CPY4-CURRENT-DATE (5:2) TO WS-HD1-RUN-MONTH.
022130     MOVE CPY4-CURRENT-DATE (7:2) TO WS-HD1-RUN-DAY.
022140     MOVE CPY4-CURRENT-DATE (1:4) TO WS-HD1-RUN-YEAR.
022150*
022160   8100-BUILD-C1128-TABLE.
022170     MOVE 0 TO WS-C1128-TBL-ENT-CT.
022180     PERFORM
022190         WITH TEST AFTER
022200         UNTIL END-I1128P-FILE
022210       READ I1128P-FILE
022220         AT END
022230           MOVE 'E' TO WS-I1128P-FILE-FLAG
022240         NOT AT END
022250           IF I1128P-PROD-EXP EQUAL '**'
022260             IF WS-C1128-TBL-ENT-CT NOT LESS 240
022270               DISPLAY '* C1128 TABLE OVERFLOWED *' UPON SYSOUT
022280               GO TO 9900-DISPLAY-ABORT
022290             END-IF
022300             MOVE I1128P-PROD-11 TO WS-C1128-PROD-11
022310             MOVE I1128P-BLOCK-CODE TO WS-C1128-BLOCK-CODE
022320             ADD 1 TO WS-C1128-TBL-ENT-CT
022330             MOVE WS-C1128-ENTRY TO
022340                   WS-C1128-TBL-ENTRY (WS-C1128-TBL-ENT-CT)
022350           END-IF
022360       END-READ
022370     END-PERFORM.
022380     IF WS-C1128-TBL-ENT-CT EQUAL 0
022390       DISPLAY '* I1128P IS EMPTY OR CONTAINS ONLY CARDS WITH EXPE
022400-            'NSE CODES OTHER THAN "**" *' UPON SYSOUT
022410       GO TO 9900-DISPLAY-ABORT.
022420     IF WS-C1128-TBL-ENT-CT GREATER 192
022430       DISPLAY 'C1128 TABLE IS OVER 80% FULL.' UPON SYSOUT
022440       MOVE 'Y' TO WS-RETURN-07-FLAG.
022450*
022460   8200-BUILD-58-TABLE.
022470     MOVE 0 TO WS-58-TBL-ENT-CT.
022480     PERFORM
022490         WITH TEST AFTER
022500         UNTIL END-I58-FILE
022510       READ I58-FILE
022520         AT END
022530           MOVE 'E' TO WS-I58-FILE-FLAG
022540         NOT AT END
022550           IF I58-PRODUCT-CODE NOT GREATER WS-I58-SEQ
022560             DISPLAY '* I58 SEQUENCE ERROR "' WS-I58-SEQ '" "'
022570                   I58-PRODUCT-CODE '" *' UPON SYSOUT
022580             GO TO 9900-DISPLAY-ABORT
022590           END-IF
022600           MOVE I58-PRODUCT-CODE TO WS-I58-SEQ
022610           IF (WS-I58-SEQ-PROD-10 IS NUMERIC)
022620               AND (WS-I58-SEQ-PROD-SFX NOT EQUAL '*' AND SPACE)
022630             IF WS-58-TBL-ENT-CT NOT LESS 4000
022640               DISPLAY '* 58 PRODUCT TABLE OVERFLOWED *'
022650                     UPON SYSOUT
022660               GO TO 9900-DISPLAY-ABORT
022670             END-IF
022680             MOVE WS-I58-SEQ TO WS-TGT-551-PROD-AND-DQ
022690                   WS-58-PROD-AND-DQ
022700             MOVE SPACE TO WS-58-C1128-BLOCK WS-FOUND-FLAG
022710             MOVE WS-TARGET-551-KEY TO I551-MP-KEY
022720             READ I551-FILE KEY I551-MP-KEY
022730             IF WS-I551-SUCCESSFUL
022740               MOVE I551-MP-PROMO-PRICE-FLAG TO WS-58-551-ATTR
022750             ELSE
022760               IF WS-I551-NO-SUCH-RECORD
022770                 IF NOT I58-OBSOLETE-PRODUCT
022780                   DISPLAY 'MISSING I551 RECORD FOR I58 PROD/DQ "'
022790                         WS-I58-SEQ '".' UPON SYSOUT
022800                   MOVE 'Y' TO WS-RETURN-08-FLAG
022810                 END-IF
022820                 MOVE '?' TO WS-58-551-ATTR
022830               ELSE
022840                 DISPLAY '* VSAM ERROR ON I551 READ.  FILE STATUS
022850-                      '= ' WS-I551-FILE-STATUS '.  KEY = "'
022860                       WS-TARGET-551-KEY '". *' UPON SYSOUT
022870                 GO TO 9900-DISPLAY-ABORT
022880               END-IF
022890             END-IF
022900             SET IX-WS-C1128-TBL TO WS-C1128-TBL-ENT-CT
022910             MOVE SPACE TO WS-58-C1128-BLOCK WS-FOUND-FLAG
022920             PERFORM
022930                 WITH TEST AFTER
022940                 UNTIL NOT STILL-LOOKING
022950               MOVE WS-C1128-TBL-ENTRY (IX-WS-C1128-TBL) TO
022960                     WS-C1128-ENTRY
022970               IF (WS-C1128-PROD-BYTE (1) EQUAL '*' OR
022980                         WS-58-PROD-BYTE (1))
022990                   AND (WS-C1128-PROD-BYTE (2) EQUAL '*' OR
023000                         WS-58-PROD-BYTE (2))
023010                   AND (WS-C1128-PROD-BYTE (3) EQUAL '*' OR
023020                         WS-58-PROD-BYTE (3))
023030                   AND (WS-C1128-PROD-BYTE (4) EQUAL '*' OR
023040                         WS-58-PROD-BYTE (4))
023050                   AND (WS-C1128-PROD-BYTE (5) EQUAL '*' OR
023060                         WS-58-PROD-BYTE (5))
023070                   AND (WS-C1128-PROD-BYTE (6) EQUAL '*' OR
023080                         WS-58-PROD-BYTE (6))
023090                   AND (WS-C1128-PROD-BYTE (7) EQUAL '*' OR
023100                         WS-58-PROD-BYTE (7))
023110                   AND (WS-C1128-PROD-BYTE (8) EQUAL '*' OR
023120                         WS-58-PROD-BYTE (8))
023130                   AND (WS-C1128-PROD-BYTE (9) EQUAL '*' OR
023140                         WS-58-PROD-BYTE (9))
023150                   AND (WS-C1128-PROD-BYTE (10) EQUAL '*' OR
023160                         WS-58-PROD-BYTE (10))
023170                   AND (WS-C1128-PROD-BYTE (11) EQUAL '*' OR
023180                         WS-58-PROD-BYTE (11))
023190                 MOVE WS-C1128-BLOCK-CODE TO WS-58-C1128-BLOCK
023200                 MOVE 'Y' TO WS-FOUND-FLAG
023210               ELSE
023220                 IF IX-WS-C1128-TBL GREATER +1
023230                   SET IX-WS-C1128-TBL DOWN BY 1
023240                 ELSE
023250                   MOVE 'N' TO WS-FOUND-FLAG
023260                 END-IF
023270               END-IF
023280             END-PERFORM
023290             ADD 1 TO WS-58-TBL-ENT-CT
023300             MOVE WS-58-ENTRY TO
023310                   WS-58-TBL-ENTRY (WS-58-TBL-ENT-CT)
023320           END-IF
023330       END-READ
023340     END-PERFORM.
023350     IF WS-58-TBL-ENT-CT EQUAL 0
023360       DISPLAY '* I58 IS AN EMPTY FILE OR CONTAINS ONLY GENERIC RE
023370-            'CORDS *' UPON SYSOUT.
023380     IF WS-58-TBL-ENT-CT GREATER 3200
023390       DISPLAY '58 PRODUCT TABLE IS OVER 80% FULL.' UPON SYSOUT
023400       MOVE 'Y' TO WS-RETURN-07-FLAG.
023410     SET IX-WS-58-TBL-MAX TO WS-58-TBL-ENT-CT.
023420*
023430*
023440   9000-CLOSE.
023450     PERFORM 4300-READ-I1130P-FILE
023460         WITH TEST BEFORE
023470         UNTIL END-I1130P-FILE.
023480     MOVE WS-END-OF-REPORT TO PR1-REC.
023490     PERFORM 7100-WRITE-PR1-REC.
023500     CLOSE PRINTER1-FILE I1220P-FILE I1130P-FILE I1128P-FILE
023510           I877-FILE I58-FILE.
023520     PERFORM 9100-CLOSE-I551-FILE.
023530     IF NOT WS-I551-SUCCESSFUL
023540       DISPLAY 'VSAM ERROR ON I551 CLOSE.  FILE STATUS = '
023550             WS-I551-FILE-STATUS '.' UPON SYSOUT
023560       MOVE 'Y' TO WS-RETURN-04-FLAG.
023570     PERFORM 9200-CLOSE-I552U-FILE.
023580     IF NOT WS-I552U-SUCCESSFUL
023590       DISPLAY 'VSAM ERROR ON I552U CLOSE.  FILE STATUS = '
023600             WS-I552U-FILE-STATUS '.' UPON SYSOUT
023610       MOVE 'Y' TO WS-RETURN-04-FLAG.
023620     PERFORM 9300-CLOSE-I552T-FILE.
023630     IF NOT WS-I552T-SUCCESSFUL
023640       DISPLAY 'VSAM ERROR ON I552T CLOSE.  FILE STATUS = '
023650             WS-I552T-FILE-STATUS '.' UPON SYSOUT
023660       MOVE 'Y' TO WS-RETURN-04-FLAG.
023670     PERFORM 9400-CLOSE-I554U-FILE.
023680     IF NOT WS-I554U-SUCCESSFUL
023690       DISPLAY 'VSAM ERROR ON I554U CLOSE.  FILE STATUS = '
023700             WS-I554U-FILE-STATUS '.' UPON SYSOUT
023710       MOVE 'Y' TO WS-RETURN-04-FLAG.
023720     PERFORM 9500-CLOSE-I554T-FILE.
023730     IF NOT WS-I554T-SUCCESSFUL
023740       DISPLAY 'VSAM ERROR ON I554T CLOSE.  FILE STATUS = '
023750             WS-I554T-FILE-STATUS '.' UPON SYSOUT
023760       MOVE 'Y' TO WS-RETURN-04-FLAG.
023770     PERFORM 9600-CLOSE-I8934-FILE.
023780     IF NOT WS-I8934-SUCCESSFUL
023790       DISPLAY 'VSAM ERROR ON I8934 CLOSE.  FILE STATUS = '
023800             WS-I8934-FILE-STATUS '.' UPON SYSOUT
023810       MOVE 'Y' TO WS-RETURN-04-FLAG.
023820     PERFORM 9700-CLOSE-I8934T-FILE.
023830     IF NOT WS-I8934T-SUCCESSFUL
023840       DISPLAY 'VSAM ERROR ON I8934T CLOSE.  FILE STATUS = '
023850             WS-I8934T-FILE-STATUS '.' UPON SYSOUT
023860       MOVE 'Y' TO WS-RETURN-04-FLAG.
023870     IF RETURN-08
023880       MOVE 08 TO RETURN-CODE WS-RETURN-CODE
023890     ELSE
023900       IF RETURN-07
023910         MOVE 07 TO RETURN-CODE WS-RETURN-CODE
023920       ELSE
023930         IF RETURN-04
023940           MOVE 04 TO RETURN-CODE WS-RETURN-CODE.
023950     DISPLAY WS-RETURN-CODE-LINE UPON SYSOUT.
023960*
023970   9100-CLOSE-I551-FILE.
023980     CLOSE I551-FILE.
023990*
024000   9200-CLOSE-I552U-FILE.
024010     CLOSE I552U-FILE.
024020*
024030   9300-CLOSE-I552T-FILE.
024040     CLOSE I552T-FILE.
024050*
024060   9400-CLOSE-I554U-FILE.
024070     CLOSE I554U-FILE.
024080*
024090   9500-CLOSE-I554T-FILE.
024100     CLOSE I554T-FILE.
024110*
024120   9600-CLOSE-I8934-FILE.
024130     CLOSE I8934-FILE.
024140*
024150   9700-CLOSE-I8934T-FILE.
024160     CLOSE I8934T-FILE.
024170*
024180*
024190   9900-DISPLAY-ABORT.
024200     DISPLAY '* ' WS-PROGRAM-NUMBER ' * RUN ABORTED *'
024210           UPON SYSOUT.
024220     IF OPENED-I551-FILE
024230       PERFORM 9100-CLOSE-I551-FILE.
024240     IF OPENED-I552U-FILE
024250       PERFORM 9200-CLOSE-I552U-FILE.
024260     IF OPENED-I552T-FILE
024270       PERFORM 9300-CLOSE-I552T-FILE.
024280     IF OPENED-I554U-FILE
024290       PERFORM 9400-CLOSE-I554U-FILE.
024300     IF OPENED-I554T-FILE
024310       PERFORM 9500-CLOSE-I554T-FILE.
024320     IF OPENED-I8934-FILE
024330       PERFORM 9600-CLOSE-I8934-FILE.
024340     IF OPENED-I8934T-FILE
024350       PERFORM 9700-CLOSE-I8934T-FILE.
024360     MOVE 16 TO RETURN-CODE WS-RETURN-CODE.
024370     DISPLAY WS-RETURN-CODE-LINE UPON SYSOUT.
024380     STOP RUN.
024390*
024400*
