000010  CBL SQL('QUALIFIER CICS BINDFILE')
000020 IDENTIFICATION DIVISION.
000030   PROGRAM-ID. "bil02100".
000040*PROGRAM-NAME. BILREF.
000050   AUTHOR. JACK MASON.
000060   INSTALLATION. DELUXE FINANCIAL SERVICES, INC.
000070   DATE-WRITTEN. 05-29-98.
000080   DATE-COMPILED.
000090******************************************************************
000100*
000110*RUN INSTRUCTIONS                                         06-03-13
000120*
000130*  **  GENERAL PROCESSING  **
000140*
000150*IPARM    = INPUT FROM DATA ENTRY                      LRECL=80
000160*             01-08  BC, REQUIRED, NUMERIC
000170*             09-13  PRIMARY BRANCH, OPTIONAL, NUMERIC
000180*             14-80  FILLER
000190*               NOTE: BRANCH (IF ENTERED) IS USED ONLY TO LIMIT
000200*                 I550 & I550T RECORDS REPORTED, FOR ALL OTHER
000210*                 FILES PRIMARY BRANCH IS IGNORED
000220*               NOTE: ONLY ONE CARD PER BC (WITH OR WITHOUT BR)
000230*
000240*PRINTER1 = BILREF LISTING, 151 CHAR/LINE 88 LINES/PG (LRECL=152)
000250*
000260*SYSOUT   = REVISION INFO & ERROR MESSAGES, ANY PAPER
000270*
000280*PARM     = 'PRINT=(SIMPLEX/DUPLEX),HEAD-EMPTY=(YES/NO)'
000290*             SIMPLEX = USE FORM L007, PROGRAM WILL SKIP TO THE
000300*               NEXT PAGE FOR EACH IPARM BC.
000310*             DUPLEX = USE FORM L008, PROGRAM WILL SKIP TO THE
000320*               NEXT ODD-NUMBERED PAGE FOR EACH IPARM BC.
000330*             YES = PRINT HEADINGS FOR EMPTY SECTIONS.
000340*             NO = OMIT SECTION HEADINGS FOR EMPTY SECTIONS.
000350*             KEYWORD "HEAD-EMPTY" IS OPTIONAL, IF OMITTED DEFAULT
000360*               OF "NO" WILL BE ASSUMED.
000370*
000380*  **  FILES USED FOR INTERPRETATION - NOT SEPARATELY REPORTED  **
000390*
000400*I759     = 759 INPUT FROM CICS                        LRECL=1000
000410*           CUT LOGO MASTER FILE
000420*
000430*I1637    = 1637 INPUT FROM FEB111?                    LRECL=80
000440*           UPCHARGE FLAGS/ATTRIBUTES DESCRIPTIONS
000450*
000460*I348P    = C348 INPUT FROM PARMLIB                    LRECL=80
000470*           SALES MANAGER/EMPLOYEE NAMES
000480*
000490*I1041P   = CAPS FORCED CLOSED FILE                    LRECL=80
000500*
000510*  **  FILES REPORTED IN SPECIFIC REPORT SECTIONS  **
000520*
000530*      ++  SPECIAL SITUATIONS  ++
000540*
000550*IMAIL    = C? INPUT FROM PARMLIB                      LRECL=135
000560*
000570*      ++  PRE-PRICING  ++
000580*
000590*I550     = 550 INPUT FROM 502                         LRECL=525
000600*           BILLING MASTER FILE
000610*
000620*I550T    = 550 INPUT FROM 502                         LRECL=525
000630*           BILLING MASTER FILE - REGIONAL TEST FILE
000640*
000650*I864     = INPUT FROM BIL985.
000660*           DEALS CONTROL FILE (VSAM).
000670*           VAR LRECL = 2257
000680*
000690*I561     = 561 INPUT FROM BIL518                      LRECL=61
000700*           BILLING MANIPULATION FILE 1
000710*
000720*I562     = 562 INPUT FROM BIL518                      LRECL=65
000730*           BILLING MANIPULATION FILE 2
000740*
000750*I563     = 563 INPUT FROM BIL518                      LRECL=75
000760*           BILLING MANIPULATION FILE 3
000770*
000780*I565     = 565 INPUT FROM BIL518                      LRECL=75
000790*           BILLING MANIPULATION FILE 5
000800*
000810*I566SUM = WEEKLY SUMMARIZED 566 FILE              (LRECL=20)
000820*
000830*I567     = 567 INPUT FROM BIL522             VARIABLE LRECL=1458
000840*           PREFERRED/CONVERSION PROGRAMS FILE
000850*
000860*I996P    = C996 INPUT FROM PARMLIB                    LRECL=80
000870*           ASSIGN PROGRAM ID BY BC
000880*
000890*      ++  INVOICING  ++
000900*
000910*I233P    = C233 INPUT FROM PARMLIB                    LRECL=80
000920*           ORD SCREEN / MAIL CARE EXP CD OVERRIDES
000930*
000940*I556     = 556 INPUT FROM BIL519                      LRECL=80
000950*           SUMMARY INVOICE CONTROL FILE
000960*
000970*I285P    = C285 INPUT FROM PARMLIB                    LRECL=80
000980*           INVOICE PAYMENT TERM EXCEPTIONS
000990*
001000*I262P    = C262 INPUT FROM PARMLIB                    LRECL=80
001010*           MAIL CODE ASSIGNMENT CARD
001020*
001030*I769P    = C769 INPUT FROM PARMLIB                    LRECL=135
001040*           INVOICE SPECIAL ADDRESSES
001050*
001060*I663P    = C663 INPUT FROM PARMLIB                    LRECL=135
001070*           INVOICE MESSAGES
001080*
001090*I660P    = C660 INPUT FROM PARMLIB                    LRECL=80
001100*           OVERRIDE 550 INVOICE/DEBIT INFO
001110*
001120*I1122P   = C1122 INPUT FROM PARMLIB                   LRECL=80
001130*           INSTITUTIONS NOT WANTING PRODUCT DETAIL
001140*
001150*I1961P   = INPUT FROM DATA ENTRY                      LRECL=135
001160*           INVOICE DELIVERY PARM
001170*
001180*      ++  NACHA  ++
001190*
001200*I575     = 575 INPUT FROM 560                         LRECL=135
001210*           NACHA PARAMETERS FILE
001220*
001230*I8950    = 8950 INPUT                                 LRECL=250
001240*           GL/ACH FILE
001250*
001260*I751P    = C751 INPUT FROM PARMLIB                    LRECL=135
001270*           SPLIT/SUMMARIZE 568 FILE
001280*
001290*I871     = 871 INPUT FROM BIL582                      LRECL=100
001300*           SPECIAL ACCOUNT FORMATS FILE
001310*
001320*      ++  REPORTS  ++
001330*
001340*I1712P   = C1712 INPUT FROM PARMLIB                   LRECL=80
001350*           CUSTOM REPORT F.I. SELECTION
001360*
001370*I781P    = C781 INPUT FROM PARMLIB                    LRECL=135
001380*           PROFIT REPORT F.I. SELECTION
001390*
001400*I896     = 896 INPUT FROM BIL653                      LRECL=137
001410*           PROFIT TRACKING CONTROL FILE
001420*
001430*      ++  PRICING  ++
001440*
001450*I662P    = C662 INPUT FROM PARMLIB                    LRECL=80
001460*           BILLING EXPENSE CODE DESCRIPTIONS
001470*
001480*I554     = 554 INPUT FROM BIL508             VARIABLE LRECL=27459
001490*           UPCHARGE FILE
001500*
001510*I554T    = 554 INPUT FROM BIL507             VARIABLE LRECL=27459
001520*           UPCHARGE FILE  -  TEST RECORDS
001530*
001540*I8935    = 8935 INPUT FROM BIL161            VARIABLE LRECL=6943
001550*           CLUB PROGRAMS - BILLING FILE
001560*
001570*I8935T   = 8935 INPUT FROM BIL161            VARIABLE LRECL=6943
001580*           CLUB PROGRAMS - BILLING FILE - TEST RECORDS
001590*
001600*I225P    = C225 INPUT FROM PARMLIB VIA SORT
001610*           OS/BS CLIENT OVERRIDES
001620*
001630*I1921P   = $1921 INPUT FROM PARMLIB                   LRECL=80
001640*           EMPLOYEE PRICING EXCLUSIONS
001650*
001660*I506P    = C506 INPUT FROM PARMLIB                    LRECL=80
001670*           552 GUAR ADJ INCREASE LIMITS
001680*
001690*I552     = 552 INPUT FROM BIL506             VARIABLE LRECL=14069
001700*           PRICE ADJUSTMENT (GAS) FILE
001710*
001720*I552T    = 552 INPUT FROM BIL506             VARIABLE LRECL=14069
001730*           PRICE ADJUSTMENT (GAS) FILE  -  TEST RECORDS
001740*
001750*I1041P   = RESET CAP DATES/LIMIT                      LRECL=80
001760*
001770*I979     = 979 INPUT FROM BIL763             VARIABLE LRECL=16879
001780*           CAPS CONTROL FILE
001790*
001800*I1907P   = C1907 INPUT FROM PARMLIB                   LRECL=80
001810*           OVERRIDE TO C1128 FOR CAPS (979 FILE)
001820*
001830*I1979P   = C1979 INPUT FROM PARMLIB                   LRECL=80
001840*           CAPS REPORTING SELECTION PARAMETERS
001850*
001860*      ++  CONSIDS  ++
001870*
001880*I850P    = C850 INPUT FROM PARMLIB
001890*           RETAIL REWARDS - CONSID NUMBER ASSIGNMENT
001900*
001910*I851P    = C851 INPUT FROM PARMLIB
001920*           RETAIL REWARDS CONTROL
001930*
001940*I761P    = C761 INPUT FROM PARMLIB                    LRECL=80
001950*           CONSIDERATION NUMBER ASSIGNMENTS
001960*
001970*I761P2   = C761 INPUT FROM PARMLIB                    LRECL=80
001980*           CONSIDERATION NUMBER ASSIGNMENTS
001990*           (SPECIAL ASSOCIATION DECK "C761C2")
002000*
002010*I1130P   = C1130 INPUT FROM PARMLIB                   LRECL=80
002020*           REGIONAL I1128P OVERRIDE FILE
002030*
002040*I877     = 877 INPUT FROM BIL616                      LRECL=182
002050*           CONSIDERATION CONTROL FILE
002060*
002070*I8920    = 8920 INPUT FROM BIL227                     LRECL=216
002080*           CONSID ADDRESS FILE
002090*
002100*      ++  REFUNDABLE 50  ++
002110*
002120*I589P    = C589 INPUT FROM PARMLIB                    LRECL=80
002130*           INTERCEPT: PAYMENT EXCEPTIONS
002140*
002150*      ++  MISCELLANEOUS  ++
002160*
002170*I1475    = 1475 INPUT FROM BIL022                     LRECL=75
002180*           FI EXCLUSIVES FILE
002190*
002200*I1967P   = C1967 INPUT FROM PARMLIB                   LRECL=80
002210*           RUSHMORE EXCLUSIVES FORCED PRODUCTS
002220*
002230*      ++  CI ++
002240*
002250*I149P    = C149 INPUT FROM PARMLIB                    LRECL=80
002260*           PROVENT OPTIONS BY BC
002270*
002280*I120P    = C120 INPUT FROM CI                         LRECL=80
002290*           TRACKABLE DELIVERY CLIENT OPTS
002300*
002310*I442     = CI PROGRAM IDENTIFICATION                  LRECL=323
002320*           VSAM FILE
002330*
002340*I906SEQ  = INPUT FROM CI VIA IDCAMS & SORT
002350*           PROMO EXTRACT  -  "$DLX_SFS/CIB.CIB095.@906"
002360*
002370*I1840    = CI EXPENSE CODE/PROGRAM ID CROSS-REFERENCE LRECL=44
002380*           VSAM FILE
002390*
002400******************************************************************
002410*
002420*RETURN CODES                                             02-23-09
002430*
002440*  16 = RUN ABORTED.  SEE SYSOUT.
002450*         - INVALID PARM DATA
002460*         - EMPTY FILE (IPARM OR I550)
002470*         - SEQUENCE ERROR
002480*         - TABLE OVERFLOW
002490*         - VSAM ERROR (EXCEPT ON CLOSE)
002500*
002510*  07 = TABLE OVER 80% FULL
002520*
002530*  04 = INFO ONLY.  RUN CONTINUED.  SEE SYSOUT.
002540*         - ONE OR MORE IPARM BCS NOT ON I550 FILE; INFO FROM
002550*             THE 550 ITSELF, AND FILES DEPENDANT ON IT VIA
002560*             HOLDING COMPANY, MBC, ETC. WILL BE INCOMPLETE
002570*         - EXTRANEOUS PARM DATA
002580*         - PARM KEYWORD "HEAD-EMPTY" MISSING, DEFAULT "NO" USED
002590*         - EMPTY FILE (OTHER THAN IPARM, I550)
002600*         - VSAM ERROR ON CLOSE
002610*
002620******************************************************************
002630*
002640*NARRATIVE                                                05-05-14
002650*
002660*PURPOSE:
002670*  TO REPORT CONTENTS OF NUMEROUS FILES' RECORDS RELATING TO EACH
002680*    (IPARM) SELECTED BC.
002690*
002700*SOURCE OF INFORMATION:
002710*  THE IPARM CARDS IN BC ORDER
002720*    SORT FIELDS=(1,8,A).
002730*  THE IMAIL CARDS IN BC ORDER
002740*    SORT FIELDS=(1,8,A).
002750*  THE C149 CARDS IN AT LEAST BC ORDER
002760*    SORT FIELDS=(1,8,A)
002770*  THE C120 CARDS IN BC ORDER
002780*    SORT FIELDS=(1,8,A)
002790*      RECOMMENDED SEQUENCE IS BC, EXPENSE CODE
002800*        SORT FIELDS=(1,8,A,10,2,A).
002810*  THE C225 CARDS IN BC, HC ORDER
002820*    SORT FIELDS=(6,8,A,1,5,A).
002830*      --  THIS IS NECESSARY TO GET THE HC CARDS FIRST SO THAT
002840*        THEY CAN GET LOADED TO A TABLE IN INITIALIZATION  ---
002850*  THE C233 CARDS IN BC ORDER
002860*    SORT FIELDS=(1,8,A).
002870*  THE C262 CARDS IN AT LEAST BC ORDER
002880*    SORT FIELDS=(1,8,A)
002890*      RECOMMENDED SEQUENCE IS INSTITUTION, SEP INV, MEMO/PAYABLE
002900*        SORT FIELDS=(1,23,A).
002910*  THE C285 CARDS IN PAYABLE INVOICE ORDER
002920*    SORT FIELDS=(1,22,A).
002930*  THE C348 CARDS IN EMPLOYEE NUMBER ORDER
002940*    SORT FIELDS=(12,7,A).
002950*  THE C506 CARDS IN HOLDING COMPANY, HC DIVISIONS, MASTER BC,
002960*        MBC DIVISIONS, PRICING BC, PRICING PRIMARY BRANCH,
002970*        START DATE YEAR, START DATE MONTH, START DATE DAY ORDER
002980*    SORT FIELDS=(1,5,A,7,6,A,14,8,A,23,6,A,30,8,A,39,5,A,
002990*          51,4,A,45,2,A,48,2,A).
003000*  THE C589 CARDS IN BC ORDER
003010*    SORT FIELDS=(1,8,A).
003020*  THE C660 CARDS IN BC ORDER
003030*    SORT FIELDS=(1,8,A).
003040*  THE C662 CARDS IN AT LEAST BC ORDER
003050*    SORT FIELDS=(1,8,A)
003060*      RECOMMENDED SEQUENCE IS INSTITUTION, EXPENSE CODE ORDER
003070*        SORT FIELDS=(1,22,A).
003080*  THE C663 CARDS IN AT LEAST BC ORDER
003090*    SORT FIELDS=(1,8,A)
003100*      RECOMMENDED SEQUENCE IS INSTITUTION, SEPARATE INVOICE,
003110*            MESSSAGE TYPE, MESSAGE LINE SEQUENCE ORDER
003120*        SORT FIELDS=(1,25,A).
003130*  THE C751 CARDS IN AT LEAST BC ORDER
003140*    SORT FIELDS=(1,8,A)
003150*      RECOMMENDED SEQUENCE IS INSTITUTION, CARD CODE ORDER
003160*        SORT FIELDS=(1,20,A,135,1,A).
003170*  THE C761 CARDS IN ANY ORDER.
003180*  THE C761"A" CARDS IN ANY ORDER.
003190*  THE C769 CARDS IN MAIL CODE (*DESCENDING*), INSTITUTION,
003200*        SEPARATE INVOICE, MEMO/PAYABLE, CARD CODE ORDER
003210*    SORT FIELDS=(1,5,D,6,24,A).
003220*  THE C781 CARDS IN ANY ORDER.
003230*  THE C850 CARDS IN INSTITUTION TYPE, INSTITUTION NUMBER ORDER
003240*    SORT FIELDS=(1,1,A,3,8,A).
003250*  THE C851 CARDS IN CONSID NUMBER ORDER
003260*    SORT FIELDS=(1,5,A).
003270*  THE C996 CARDS AT LEAST BC ORDER
003280*    SORT FIELDS=(1,8,A)
003290*      RECOMMENDED SEQUENCE IS BC, SEQUENCE NUMBER ORDER
003300*        SORT FIELDS=(1,11,A).
003310*  THE C1041 CARDS IN AT LEAST 979 INSTITUTION SEQUENCE ORDER
003320*    SORT FIELDS=(1,45,A)
003330*      RECOMMENDED SEQUENCE IS INSTITUTION SEQ, PRORGAM CODE,
003340*          DATE ORDER
003350*        SORT FIELDS=(1,52,A).
003360*  THE C1122 CARDS IN AT LEAST BC ORDER
003370*    SORT FIELDS=(1,8,A)
003380*      RECOMMENDED SEQUENCE IS INSTITUTION, SEP INV, MEMO/PAYABLE
003390*        SORT FIELDS=(1,23,A).
003400*          ** NOT THE SAME ORDER AS USED IN OTHER PROGRAMS **
003410*  THE C1130 CARD IN CONSID NUMBER ORDER.
003420*  THE C1712 CARDS IN ANY ORDER.
003430*  THE C1907 CARDS IN ANY ORDER.
003440*  THE C1961 CARDS IN AT LEAST BC ORDER
003450*    SORT FIELDS=(1,8,A)
003460*      RECOMMENDED SEQUENCE IS INSTITUTION ORDER
003470*        SORT FIELDS=(1,20,A).
003480*  THE C1967 CARDS IN AT LEAST BC ORDER
003490*    SORT FIELDS=(1,8,A)
003500*      RECOMMENDED SEQUENCE IS INSTITUTION/PRODUCT/DQ
003510*        SORT FIELDS=(1,20,A,22,11,A,34,5,A).
003520*  THE C1979 CARDS IN ANY ORDER.
003530*  THE I566SUM FILE IN BC, PROG-ID , AND RECORD-TYPE ORDER
003540*    FILE CREATED BY SORT ON A WEEKLY BASIS USING THE FOLLOWING SO
003550*    SYNTAX:
003560*         SORT FIELDS=(1,10,CH,A)
003570*         SUM  FIELDS=(11,6,ZD)
003580*         INREC FIELDS=(1,8,30,1,29,1,C'000001',4X)
003590*  THE 575 FILE IN NACHA CODE, BRANCHES, REC TYPE, REC # ORDER
003600*    SORT FIELDS=(1,21,A).
003610*  THE 871 FILE IN AT LEAST INSTITUTION ORDER
003620*    SORT FIELDS=(1,20,A)
003630*      RECOMMENDED SEQUENCE IS INSTITUTION, SEQUENCE NUMBER
003640*        SORT FIELDS=(1,23,A).
003650*  THE 877 FILE IN CONSID NUMBER, REC TYPE, REC NUMBER ORDER
003660*    SORT FIELDS=(1,9,A).
003670*  THE 896 FILE IN REPORT TYPE, REC TYPE, REC NUMBER ORDER
003680*    SORT FIELDS=(1,11,A).
003690*  THE SEQUENTIAL COPY OF THE 906 FILE IN BC ORDER
003700*    SORT FIELDS=(10,8,A).
003710*  THE 1475 FILE AT BC LEAST BC ORDER
003720*    SORT FIELDS=(1,8,A).
003730*  THE 8920 FILE IN ANY ORDER.
003740*  THE 442 FILE (VSAM).
003750*  THE 550 FILE (VSAM).
003760*  THE 550T FILE (VSAM).
003770*  THE 552 FILE (VSAM).
003780*  THE 552T FILE (VSAM).
003790*  THE 554 FILE (VSAM).
003800*  THE 554T FILE (VSAM).
003810*  THE 556 FILE (VSAM).
003820*  THE 561 FILE (VSAM).
003830*  THE 562 FILE (VSAM).
003840*  THE 563 FILE (VSAM).
003850*  THE 565 FILE (VSAM).
003860*  THE 567 FILE (VSAM).
003870*  THE 759 FILE (VSAM).
003880*  THE 979 FILE (VSAM).
003890*  THE 1637 FILE (VSAM).
003900*  THE 1840 FILE (VSAM).
003910*  THE 8935 FILE (VSAM).
003920*  THE 8935T FILE (VSAM).
003930*  THE 8950 FILE (VSAM).
003940*
003950*PROGRAM FLOW:
003960*  IN INITIALIZATION, THE PROGRAM CHECKS THE PARM INFO (TO
003970*    DETERMINE HOW TO PAGE-BREAK ON THE PRINT FILE), OPENS FILES,
003980*    CHECKS AGAINST EMPTY FILES, AND BUILDS TABLES FROM SOME FILES
003990*    WHICH IT CAN'T OTHERWISE ACCESS IN BC ORDER.
004000*  PROCESSING IS CONTROLLED BY FILE "IPARM".  THE PROGRAM
004010*    PROCESSES EVERY RECORD FROM EACH FILE WHICH RELATE TO THE
004020*    "IPARM" BC.  FOR MOST FILES, THIS MEANS PRINTING ANY RECORDS
004030*    FOR THE BC.  FOR SOME IT ALSO INCLUDES STORING DATA NEEDED TO
004040*    ACCESS THE APPROPRIATE RECORDS OF ANOTHER FILE (MAIL CODE,
004050*    MASTER BC, ETC.).  THE ONLY EXCEPTIONS ARE THE 550 & 550T
004060*    FILES; ALL RECORDS FOR THE BC ARE ALWAYS PROCESSED (FOR
004070*    STORING DATA); BUT, IF THE "IPARM" PRIMARY BRANCH IS
004080*    NON-BLANK, ONLY THE REQUESTED BRANCH'S 550 & 550T RECORDS
004090*    ARE PRINTED.
004100*  WHEN ALL "IPARM" CARDS HAVE BEEN PROCESSED, THE PROGRAM READS
004110*    THE REMAINING RECORDS ON ALL SEQUENTIAL INPUT FILES (TO
004120*    GUARD AGAINST AN UNDETECTED SEQUENCE ERROR AFFECTING THE
004130*    REPORTS), CLOSES ALL FILES, AND ENDS.
004140*
004150******************************************************************
004160*
004170*REVISION HISTORY
004180*
004190*05-02-11  ADDED C149 CARDS (PROVENT), AND REVISED SOME HEADINGS.
004200*          EXPANDED 550/550T BRANCH TABLE (6,000 TO 25,000).
004210*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  53
004220*
004230*07-11-11  ADDED TWO NEW FILES FOR REPORTING (C285 & C506).
004240*          ALSO TWEAKED C1961 REPORT FORMAT TO REMOVE OBSOLETE
004250*            EXPEDITED DELIVERY OPTION.
004260*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  54
004270*
004280*09-12-11  EXPANDED C506 TABLE (400 TO 3200).
004290*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  55
004300*
004310*11-07-11  MODIFIED FOR C149 CHANGES:  NEW FIELDS, NEW VALUES,
004320*            POTENTIALLY MULTIPLE CARDS PER BC.
004330*          ALSO MODIFIED FOR CHANGES TO THE 8935 FILE.
004340*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  56
004350*
004360*03-05-12  REMOVED 858 & 862 FILES; AND ADDED 906 FILE, C850
004370*            CARDS, & C851 CARDS.
004380*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  57
004390*
004400*07-30-12  MODIFIED FOR REVISED C149 CARD LAYOUT.
004410*          CORRECTED HEADING ISSSUE FOR C1921 CARDS.
004420*          ADDED TEST 8935 FILE.
004430*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  58
004440*
004450*12-03-12  MODIFIED FOR FOUR NEW PROVENT OPTIONS & RELOCATION
004460*            OF FOUR EXISTING ONES TO NEW CODES.
004470*          REPAIRED FILE DEFINITION OF C1961 CARDS.  SOME FIELDS
004480*            (E.G. SECONDARY BRANCH) HAD BEEN INCORRECTLY DEFINED
004490*            AS NUMERIC, CAUSING ZERO TO PRINT WHEN THE FIELD WAS
004500*            BLANK.
004510*          ADDED NEW FILE (I225P) TO REPORT.
004520*          CORE SIMP PROJECT (IMS = JDBT-6VJSF9).   JACK MASON  59
004530*
004540*06-03-13  ADDED NEW C120 FILE (TRACKABLE DELIVERY) TO REPORT.
004550*          REMOVED C641 (REF50) FILE (OBSOLETE).
004560*          RELOCATED CONSIDS GROUP TO PRINT AFTER EXPENSE CREDITS.
004570*          MOVED DOCUMENTATION ON I1961P AND I1130P TO CORRECTLY
004580*            REFLECT THE GROUP EACH RPINTS IN.
004590*          ADDED NEW FILE (I225P) TO REPORT.
004600*          CS PROJECT (IMS = JDBT-6VJSF9).   ALLAN CHARLESWORTH 60
004610*
004620*07-01-13  ALWAYS PRINT EHANCEMENT INSTRUCTION FROM 8935 FILE
004630*            REGARDLESS OF PRODUCT INSTRUCTION.  ALSO MINOR
004640*            HEADING CHANGE OF 554 DATE FIELD.
004650*          CS PROJECT (IMS = JDBT-6VJSF9).   ALLAN CHARLESWORTH 61
004660*
004670*05-05-14  CORRECTED AN ERROR IN ROUTINE FOR THE 979 FILE.
004680*          RE-INSTALLED I1041P CORRECTLY (THESE RECORDS MAY BE BY
004690*            ANY OR ALL OF HC, MBC, BC - NEED TO BE PROCESSED IN
004700*            A TABLE, NOT FROM THE INPUT BUFFER).   JACK MASON  62
004710*
004720******************************************************************
004730*
004740 ENVIRONMENT DIVISION.
004750 CONFIGURATION SECTION.
004760   SOURCE-COMPUTER. UNIX.
004770   OBJECT-COMPUTER. UNIX.
004780   SPECIAL-NAMES.
004790     CLASS VALID-HC-CHARS IS '0' THRU '9', 'A' THRU 'Z'.
004800*
004810 INPUT-OUTPUT SECTION.
004820   FILE-CONTROL.
004830*                * CONTROL & REPORT *
004840     SELECT IPARM-FILE    ASSIGN RSD-IPARM.
004850     SELECT PRINTER1-FILE ASSIGN PRINTER1
004860            ORGANIZATION IS LINE SEQUENTIAL.
004870*                * NON-STANDARD STUFF *
004880     SELECT IMAIL-FILE    ASSIGN RSD-IMAIL.
004890     SELECT I566SUM-FILE  ASSIGN RSD-I566SUM.
004900*                * NUMBERED PARMLIB MEMBERS *
004910     SELECT I120P-FILE    ASSIGN RSD-I120P.
004920     SELECT I149P-FILE    ASSIGN RSD-I149P.
004930     SELECT I225P-FILE    ASSIGN RSD-I225P.
004940     SELECT I233P-FILE    ASSIGN RSD-I233P.
004950     SELECT I262P-FILE    ASSIGN RSD-I262P.
004960     SELECT I285P-FILE    ASSIGN RSD-I285P.
004970     SELECT I348P-FILE    ASSIGN RSD-I348P.
004980     SELECT I506P-FILE    ASSIGN RSD-I506P.
004990     SELECT I589P-FILE    ASSIGN RSD-I589P.
005000     SELECT I660P-FILE    ASSIGN RSD-I660P.
005010     SELECT I662P-FILE    ASSIGN RSD-I662P.
005020     SELECT I663P-FILE    ASSIGN RSD-I663P.
005030     SELECT I751P-FILE    ASSIGN RSD-I751P.
005040     SELECT I761P-FILE    ASSIGN RSD-I761P.
005050     SELECT I761P2-FILE   ASSIGN RSD-I761P2.
005060     SELECT I769P-FILE    ASSIGN RSD-I769P.
005070     SELECT I781P-FILE    ASSIGN RSD-I781P.
005080     SELECT I782P-FILE    ASSIGN RSD-I782P.
005090     SELECT I850P-FILE    ASSIGN RSD-I850P.
005100     SELECT I851P-FILE    ASSIGN RSD-I851P.
005110     SELECT I996P-FILE    ASSIGN RSD-I996P.
005120     SELECT I1041P-FILE   ASSIGN RSD-I1041P.
005130     SELECT I1122P-FILE   ASSIGN RSD-I1122P.
005140     SELECT I1130P-FILE   ASSIGN RSD-I1130P.
005150     SELECT I1712P-FILE   ASSIGN RSD-I1712P.
005160     SELECT I1907P-FILE   ASSIGN RSD-I1907P.
005170     SELECT I1921P-FILE   ASSIGN RSD-I1921P.
005180     SELECT I1961P-FILE   ASSIGN RSD-I1961P.
005190     SELECT I1967P-FILE   ASSIGN RSD-I1967P.
005200     SELECT I1979P-FILE   ASSIGN RSD-I1979P.
005210*                * NUMBERED SEQUENTIAL FILES *
005220     SELECT I575-FILE     ASSIGN RSD-I575.
005230     SELECT I871-FILE     ASSIGN RSD-I871.
005240     SELECT I877-FILE     ASSIGN RSD-I877.
005250     SELECT I896-FILE     ASSIGN RSD-I896.
005260     SELECT I906SEQ-FILE  ASSIGN RSD-I906SEQ.
005270     SELECT I1475-FILE    ASSIGN RSD-I1475.
005280     SELECT I8920-FILE    ASSIGN RSD-I8920.
005290*                * NUMBERED VSAM FILES *
005300     SELECT I442-FILE     ASSIGN I442
005310                            ORGANIZATION IS INDEXED
005320                            ACCESS MODE IS DYNAMIC
005330                            RECORD KEY IS I442-KEY
005340                            FILE STATUS IS WS-I442-FILE-STATUS.
005350     SELECT I550-FILE     ASSIGN I550
005360                            ORGANIZATION IS INDEXED
005370                            ACCESS MODE IS DYNAMIC
005380                            RECORD KEY IS I550-RECORD-KEY
005390                            FILE STATUS IS WS-I550-FILE-STATUS.
005400     SELECT I550T-FILE    ASSIGN I550T
005410                            ORGANIZATION IS INDEXED
005420                            ACCESS MODE IS DYNAMIC
005430                            RECORD KEY IS O550-RECORD-KEY
005440                            FILE STATUS IS WS-I550T-FILE-STATUS.
005450     SELECT I552-FILE     ASSIGN I552
005460                            ORGANIZATION IS INDEXED
005470                            ACCESS MODE IS DYNAMIC
005480                            RECORD KEY IS I552-KEY
005490                            FILE STATUS IS WS-I552-FILE-STATUS.
005500     SELECT I552T-FILE    ASSIGN I552T
005510                            ORGANIZATION IS INDEXED
005520                            ACCESS MODE IS DYNAMIC
005530                            RECORD KEY IS O552-KEY
005540                            FILE STATUS IS WS-I552T-FILE-STATUS.
005550     SELECT I554-FILE     ASSIGN I554
005560                            ORGANIZATION IS INDEXED
005570                            ACCESS MODE IS DYNAMIC
005580                            RECORD KEY IS I554-KEY
005590                            FILE STATUS IS WS-I554-FILE-STATUS.
005600     SELECT I554T-FILE    ASSIGN I554T
005610                            ORGANIZATION IS INDEXED
005620                            ACCESS MODE IS DYNAMIC
005630                            RECORD KEY IS O554-KEY
005640                            FILE STATUS IS WS-I554T-FILE-STATUS.
005650     SELECT I556-FILE     ASSIGN I556
005660                            ORGANIZATION IS INDEXED
005670                            ACCESS MODE IS SEQUENTIAL
005680                            RECORD KEY IS I556-KEY
005690                            FILE STATUS IS WS-I556-FILE-STATUS.
005700     SELECT I561-FILE     ASSIGN I561
005710                            ORGANIZATION IS INDEXED
005720                            ACCESS MODE IS DYNAMIC
005730                            RECORD KEY IS I561-RECORD-KEY
005740                            FILE STATUS IS WS-I561-FILE-STATUS.
005750     SELECT I562-FILE     ASSIGN I562
005760                            ORGANIZATION IS INDEXED
005770                            ACCESS MODE IS DYNAMIC
005780                            RECORD KEY IS I562-RECORD-KEY
005790                            FILE STATUS IS WS-I562-FILE-STATUS.
005800     SELECT I563-FILE     ASSIGN I563
005810                            ORGANIZATION IS INDEXED
005820                            ACCESS MODE IS DYNAMIC
005830                            RECORD KEY IS I563-RECORD-KEY
005840                            FILE STATUS IS WS-I563-FILE-STATUS.
005850     SELECT I565-FILE     ASSIGN I565
005860                            ORGANIZATION IS INDEXED
005870                            ACCESS MODE IS DYNAMIC
005880                            RECORD KEY IS I565-RECORD-KEY
005890                            FILE STATUS IS WS-I565-FILE-STATUS.
005900     SELECT I567-FILE     ASSIGN I567
005910                            ORGANIZATION IS INDEXED
005920                            ACCESS MODE IS DYNAMIC
005930                            RECORD KEY IS I567-RECORD-KEY
005940                            FILE STATUS IS WS-I567-FILE-STATUS.
005950     SELECT I759-FILE     ASSIGN I759
005960                            ORGANIZATION IS INDEXED
005970                            ACCESS MODE IS RANDOM
005980                            RECORD KEY IS I759-KEY
005990                            FILE STATUS IS WS-I759-FILE-STATUS.
006000     SELECT I864-FILE     ASSIGN I864
006010                            ORGANIZATION IS INDEXED
006020                            ACCESS MODE IS DYNAMIC
006030                            RECORD KEY IS I864-KEY
006040                            ALTERNATE RECORD KEY IS
006050                            I864-ALTERNATE-KEY WITH DUPLICATES
006060                            FILE STATUS IS WS-I864-FILE-STATUS.
006070     SELECT I979-FILE     ASSIGN I979
006080                            ORGANIZATION IS INDEXED
006090                            ACCESS MODE IS DYNAMIC
006100                            RECORD KEY IS I979-M-RECORD-KEY
006110                            FILE STATUS IS WS-I979-FILE-STATUS.
006120     SELECT I1637-FILE    ASSIGN I1637
006130                            ORGANIZATION IS INDEXED
006140                            ACCESS MODE IS DYNAMIC
006150                            RECORD KEY IS I1637-KEY
006160                            FILE STATUS IS WS-I1637-FILE-STATUS.
006170     SELECT I1840-FILE    ASSIGN I1840
006180                            ORGANIZATION IS INDEXED
006190                            ACCESS MODE IS DYNAMIC
006200                            RECORD KEY IS I1840-RECORD-KEY
006210                            FILE STATUS IS WS-I1840-FILE-STATUS.
006220     SELECT I8935-FILE    ASSIGN I8935
006230                            ORGANIZATION IS INDEXED
006240                            ACCESS MODE IS DYNAMIC
006250                            RECORD KEY IS I8935-KEY
006260                            FILE STATUS IS WS-I8935-FILE-STATUS.
006270     SELECT I8935T-FILE   ASSIGN I8935T
006280                            ORGANIZATION IS INDEXED
006290                            ACCESS MODE IS DYNAMIC
006300                            RECORD KEY IS O8935-KEY
006310                            FILE STATUS IS WS-I8935T-FILE-STATUS.
006320     SELECT I8950-FILE    ASSIGN I8950
006330                            ORGANIZATION IS INDEXED
006340                            ACCESS MODE IS DYNAMIC
006350                            RECORD KEY IS I8950-KEY
006360                            FILE STATUS IS WS-I8950-FILE-STATUS.
006370*
006380 DATA DIVISION.
006390 FILE SECTION.
006400*
006410 FD  IPARM-FILE
006420     RECORDING MODE IS F
006430     BLOCK CONTAINS 0 RECORDS
006440     RECORD CONTAINS 80 CHARACTERS
006450     LABEL RECORDS STANDARD.
006460   01  IPARM-RECORD.
006470     03  IPARM-INFO.
006480       05  IPARM-BC                              PIC X(8).
006490       05  IPARM-PRI-BR                          PIC X(5).
006500     03  FILLER                                  PIC X(67).
006510*
006520 FD  PRINTER1-FILE
006530     RECORDING MODE IS F
006540     RECORD CONTAINS 151 CHARACTERS.
006550   01  PRINTER1-RECORD                           PIC X(151).
006560*
006570 FD  IMAIL-FILE
006580     RECORDING MODE IS F
006590     BLOCK CONTAINS 0 RECORDS
006600     RECORD CONTAINS 135 CHARACTERS
006610     LABEL RECORDS STANDARD.
006620   01  IMAIL-RECORD.
006630     03  IMAIL-BC                                PIC X(8).
006640     03  FILLER                                  PIC X(127).
006650*
006660 FD  I566SUM-FILE
006670     RECORDING MODE IS F
006680     BLOCK CONTAINS 0 RECORDS
006690     RECORD CONTAINS 20 CHARACTERS
006700     LABEL RECORDS ARE STANDARD.
006710   01  I566S-REC.
006720     03  I566S-REC-SEQ.
006730       05  I566S-BC                               PIC X(8).
006740       05  I566S-PREF-CONV-PROGRAM-ID             PIC X.
006750       05  I566S-RECORD-TYPE                      PIC X.
006760         88  I566S-REC-IS-PREFERRED               VALUE SPACE.
006770         88  I566S-REC-IS-CONVERSION              VALUE 'C'.
006780         88  I566S-REC-IS-LIMITED-TEMP            VALUE 'L'.
006790     03  I566S-RECORD-COUNT                     PIC 9(6).
006800     03  FILLER                                 PIC X(4).
006810*
006820 FD  I120P-FILE
006830     RECORDING MODE IS F
006840     BLOCK CONTAINS 0 RECORDS
006850     RECORD CONTAINS 80 CHARACTERS
006860     LABEL RECORDS STANDARD.
006870   01  I120P-REC.
006880     03  I120P-BC                                PIC X(8).
006890     03  FILLER                                  PIC X.
006900     03  I120P-EXP-CD                            PIC X(2).
006910     03  FILLER                                  PIC X.
006920     03  I120P-OPTION                            PIC X.
006930     03  FILLER                                  PIC X.
006940     03  I120P-SERVICE                           PIC X.
006950     03  FILLER                                  PIC X(65).
006960*
006970 FD  I149P-FILE
006980     RECORDING MODE IS F
006990     BLOCK CONTAINS 0 RECORDS
007000     RECORD CONTAINS 80 CHARACTERS
007010     LABEL RECORDS STANDARD.
007020   01  I149P-REC.
007030     03  I149P-BC                                PIC X(8).
007040     03  FILLER                                  PIC X.
007050     03  I149P-EXP-CD                            PIC X(2).
007060     03  FILLER                                  PIC X.
007070     03  I149P-PROVENT-OPT-P                     PIC X.
007080     03  FILLER                                  PIC X.
007090     03  I149P-PROVENT-OPT-B                     PIC X.
007100     03  FILLER                                  PIC X.
007110     03  I149P-CONS-OPT-P                        PIC X.
007120     03  FILLER                                  PIC X.
007130     03  I149P-CONS-OPT-B                        PIC X.
007140     03  FILLER                                  PIC X(61).
007150*
007160 FD  I225P-FILE
007170     RECORDING MODE IS F
007180     BLOCK CONTAINS 0 RECORDS
007190     RECORD CONTAINS 80 CHARACTERS
007200     LABEL RECORDS STANDARD.
007210   01  I225P-REC.
007220     03  I225P-INFO.
007230       05  I225P-HC                              PIC X(5).
007240       05  I225P-BC                              PIC X(8).
007250       05  FILLER                                PIC X.
007260       05  I225P-OS-UNIT-OVR                     PIC X.
007270       05  FILLER                                PIC X.
007280       05  I225P-OS-BNDL-OVR                     PIC X.
007290       05  FILLER                                PIC X.
007300       05  I225P-BS-BNDL-OVR                     PIC X.
007310     03  FILLER                                  PIC X(61).
007320*
007330 FD  I233P-FILE
007340     RECORDING MODE IS F
007350     BLOCK CONTAINS 0 RECORDS
007360     RECORD CONTAINS 80 CHARACTERS
007370     LABEL RECORDS STANDARD.
007380   01  I233P-REC.
007390     03  I233P-BC                                PIC X(8).
007400     03  FILLER                                  PIC X.
007410     03  I233P-EXP-CODES.
007420       05  I233P-EXP-CODE       OCCURS 20 TIMES  PIC X(2).
007430     03  FILLER                                  PIC X(31).
007440*
007450 FD  I262P-FILE
007460     RECORDING MODE IS F
007470     BLOCK CONTAINS 0 RECORDS
007480     RECORD CONTAINS 80 CHARACTERS
007490     LABEL RECORDS STANDARD.
007500   01  I262P-RECORD.
007510     03  I262P-BC                                PIC X(8).
007520     03  I262P-PRI-BR                            PIC X(5).
007530     03  I262P-SEC-BR                            PIC X(5).
007540     03  I262P-BILL-TYPE                         PIC X(2).
007550     03  I262P-SEP-INV-CODE                      PIC X(2).
007560     03  FILLER                                  PIC X.
007570     03  I262P-MAIL-CODE                         PIC X(5).
007580     03  I262P-COMMENT                           PIC X(52).
007590*
007600 FD  I285P-FILE
007610     RECORDING MODE IS F
007620     BLOCK CONTAINS 0 RECORDS
007630     RECORD CONTAINS 80 CHARACTERS
007640     LABEL RECORDS STANDARD.
007650   01  I285P-REC.
007660     03  I285P-INV-SEQ.
007670       05  I285P-BC                              PIC X(8).
007680       05  I285P-PRI-BR                          PIC X(5).
007690       05  I285P-SEC-BR                          PIC X(5).
007700       05  I285P-TYP-CD                          PIC X(2).
007710       05  I285P-SEP-INV                         PIC X(2).
007720     03  FILLER                                  PIC X.
007730     03  I285P-PYMT-DAYS                         PIC X(2).
007740     03  FILLER                                  PIC X(55).
007750*
007760 FD  I348P-FILE
007770     RECORDING MODE IS F
007780     BLOCK CONTAINS 0 RECORDS
007790     RECORD CONTAINS 80 CHARACTERS
007800     LABEL RECORDS STANDARD.
007810   01  I348P-RECORD.
007820     03  FILLER                                  PIC X(11).
007830     03  I348P-EMPLOYEE-NBR                      PIC X(7).
007840     03  FILLER                                  PIC X(2).
007850     03  I348P-LAST-NAME                         PIC X(15).
007860     03  I348P-FIRST-NAME                        PIC X(15).
007870     03  I348P-INITIAL                           PIC X.
007880     03  FILLER                                  PIC X(29).
007890*
007900 FD  I506P-FILE
007910     RECORDING MODE IS F
007920     BLOCK CONTAINS 0 RECORDS
007930     RECORD CONTAINS 80 CHARACTERS
007940     LABEL RECORDS STANDARD.
007950   01  I506P-REC.
007960     03  I506P-HC                                PIC X(5).
007970     03  FILLER                                  PIC X.
007980     03  I506P-HC-DIVS                           PIC X(6).
007990     03  FILLER                                  PIC X.
008000     03  I506P-MBC                               PIC X(8).
008010     03  FILLER                                  PIC X.
008020     03  I506P-MBC-DIVS                          PIC X(6).
008030     03  FILLER                                  PIC X.
008040     03  I506P-BC                                PIC X(8).
008050     03  FILLER                                  PIC X.
008060     03  I506P-PRI-BR                            PIC X(5).
008070     03  FILLER                                  PIC X.
008080     03  I506P-START-DATE.
008090       05  I506P-START-MO                        PIC X(2).
008100       05  FILLER                                PIC X.
008110       05  I506P-START-DY                        PIC X(2).
008120       05  FILLER                                PIC X.
008130       05  I506P-START-YR                        PIC X(4).
008140     03  FILLER                                  PIC X.
008150     03  I506P-END-DATE                          PIC X(10).
008160     03  FILLER                                  PIC X.
008170     03  I506P-LIMIT                             PIC X(5).
008180     03  FILLER                                  PIC X(9).
008190*
008200 FD  I589P-FILE
008210     RECORDING MODE IS F
008220     BLOCK CONTAINS 0 RECORDS
008230     RECORD CONTAINS 80 CHARACTERS
008240     LABEL RECORDS STANDARD.
008250   01  I589P-RECORD.
008260     03  I589P-BC                                PIC X(8).
008270     03  I589P-CHECK-FLAG                        PIC X.
008280     03  I589P-QTRLY-FLAG                        PIC X.
008290     03  I589P-CR-TO-TAPE-FLAG                   PIC X.
008300     03  I589P-CR-TO-CUST-FLAG                   PIC X.
008310     03  I589P-RETAIN-ORIG-EXP-CD                PIC X.
008320     03  FILLER                                  PIC X(67).
008330*
008340 FD  I660P-FILE
008350     RECORDING MODE IS F
008360     BLOCK CONTAINS 0 RECORDS
008370     RECORD CONTAINS 80 CHARACTERS
008380     LABEL RECORDS STANDARD.
008390   01  I660P-RECORD.
008400     03  I660P-BC                                PIC X(8).
008410     03  I660P-MATCH-PRI-BR                      PIC X(5).
008420     03  I660P-MATCH-SEC-BR                      PIC X(5).
008430     03  I660P-MATCH-BILL-TYPE                   PIC X(2).
008440     03  I660P-MATCH-BILL-MED                    PIC X.
008450     03  I660P-MATCH-PROD-CODE                   PIC X(13).
008460     03  I660P-MATCH-SEP-INV-CD                  PIC X(2).
008470     03  I660P-MATCH-CREDIT-FLG                  PIC X.
008480     03  I660P-PRINT-OPTION.
008490       05  I660P-ORD-DTL-PRT-FLG                   PIC X.
008500     03  I660P-EXTRA-WORK-FLAG                   PIC X.
008510     03  I660P-SEQ-NBR                           PIC X(4).
008520     03  FILLER                                  PIC X(37).
008530*
008540 FD  I662P-FILE
008550     RECORDING MODE IS F
008560     BLOCK CONTAINS 0 RECORDS
008570     RECORD CONTAINS 80 CHARACTERS
008580     LABEL RECORDS STANDARD.
008590   01  I662P-RECORD.
008600     03  I662P-BC                                PIC X(8).
008610     03  I662P-PRI-BR                            PIC X(5).
008620     03  I662P-SEC-BR                            PIC X(5).
008630     03  I662P-BILL-TYPE                         PIC X(2).
008640     03  I662P-EXP-CODE                          PIC X(2).
008650     03  I662P-EXP-CODE-DESCR                    PIC X(25).
008660     03  FILLER                                  PIC X(33).
008670*
008680 FD  I663P-FILE
008690     RECORDING MODE IS F
008700     BLOCK CONTAINS 0 RECORDS
008710     RECORD CONTAINS 135 CHARACTERS
008720     LABEL RECORDS STANDARD.
008730   01  I663P-RECORD.
008740     03  I663P-INFO.
008750       05  I663P-BC                              PIC X(8).
008760       05  I663P-PRI-BR                          PIC X(5).
008770       05  I663P-SEC-BR                          PIC X(5).
008780       05  I663P-BILL-TYPE                       PIC X(2).
008790       05  I663P-SEP-INV-CD                      PIC X(2).
008800       05  I663P-MSG-TYPE                        PIC X.
008810       05  I663P-LINE-SEQ                        PIC X(2).
008820       05  I663P-MESSAGE                         PIC X(100).
008830     03  FILLER                                  PIC X(10).
008840*
008850 FD  I751P-FILE
008860     RECORDING MODE IS F
008870     BLOCK CONTAINS 0 RECORDS
008880     RECORD CONTAINS 135 CHARACTERS
008890     LABEL RECORDS STANDARD.
008900   01  I751P-RECORD.
008910     03  I751P-INSTITUTION.
008920       05  I751P-BC                              PIC X(8).
008930       05  I751P-PRI-BR                          PIC X(5).
008940       05  I751P-SEC-BR                          PIC X(5).
008950       05  I751P-BILL-TYPE                       PIC X(2).
008960     03  I751P-A-INFO.
008970       05  I751P-A-RSL-INSTR                     PIC X.
008980       05  I751P-A-EXP-INSTR                     PIC X.
008990       05  FILLER                                PIC X.
009000       05  I751P-A-EXP-NEW-PROD-CD               PIC X(13).
009010       05  I751P-A-EXP-PROD-DESCR                PIC X(21).
009020       05  FILLER                                PIC X(4).
009030       05  I751P-A-EXP-PRI-BR                    PIC X(5).
009040       05  I751P-A-EXP-SEC-BR                    PIC X(5).
009050       05  I751P-A-EXP-BILL-TYPE                 PIC X(2).
009060       05  I751P-A-CR-INSTR                      PIC X.
009070       05  I751P-A-CR-NEW-PROD-CD                PIC X(13).
009080       05  I751P-A-CR-PROD-DESCR                 PIC X(21).
009090       05  FILLER                                PIC X(4).
009100       05  I751P-A-CR-COST-FLAG                  PIC X.
009110       05  I751P-A-EXP-BC                        PIC X(8).
009120       05  I751P-A-CR-PRI-BR                     PIC X(5).
009130       05  I751P-A-CR-SEC-BR                     PIC X(5).
009140       05  I751P-A-CR-BILL-TYPE                  PIC X(2).
009150       05  FILLER                                PIC X.
009160     03  I751P-B-INFO REDEFINES I751P-A-INFO.
009170       05  FILLER                                PIC X(53).
009180       05  I751P-B-INV-INSTR                     PIC X.
009190       05  I751P-B-INV-NEW-PROD-CD               PIC X(13).
009200       05  I751P-B-INV-PROD-DESCR                PIC X(21).
009210       05  FILLER                                PIC X(4).
009220       05  I751P-B-INV-COST-FLAG                 PIC X.
009230       05  FILLER                                PIC X(21).
009240     03  I751P-CARD-CD                           PIC X.
009250*
009260 FD  I761P-FILE
009270     RECORDING MODE IS F
009280     BLOCK CONTAINS 0 RECORDS
009290     RECORD CONTAINS 80 CHARACTERS
009300     LABEL RECORDS STANDARD.
009310   01  I761P-RECORD.
009320     03  I761P-HOLD-CO                           PIC X(5).
009330     03  I761P-HC-DIV-1                          PIC X(2).
009340     03  I761P-HC-DIV-2                          PIC X(2).
009350     03  I761P-HC-DIV-3                          PIC X(2).
009360     03  I761P-MASTER-BC                         PIC X(8).
009370     03  I761P-FI-DIV-1                          PIC X(2).
009380     03  I761P-FI-DIV-2                          PIC X(2).
009390     03  I761P-FI-DIV-3                          PIC X(2).
009400     03  I761P-BC                                PIC X(8).
009410     03  I761P-PRI-BR                            PIC X(5).
009420     03  I761P-SEC-BR                            PIC X(5).
009430     03  I761P-BILL-TYPE                         PIC X(2).
009440     03  I761P-CONSID-NBR-1                      PIC X(5).
009450     03  I761P-CONSID-NBR-2                      PIC X(5).
009460     03  I761P-CONSID-NBR-3                      PIC X(5).
009470     03  I761P-CONSID-NBR-4                      PIC X(5).
009480     03  I761P-CONSID-NBR-5                      PIC X(5).
009490     03  I761P-CONSID-NBR-6                      PIC X(5).
009500     03  I761P-CONSID-NBR-7                      PIC X(5).
009510*
009520 FD  I761P2-FILE
009530     RECORDING MODE IS F
009540     BLOCK CONTAINS 0 RECORDS
009550     RECORD CONTAINS 80 CHARACTERS
009560     LABEL RECORDS STANDARD.
009570   01  I761P2-RECORD.
009580     03  I761P2-HOLD-CO                          PIC X(5).
009590     03  I761P2-HC-DIV-1                         PIC X(2).
009600     03  I761P2-HC-DIV-2                         PIC X(2).
009610     03  I761P2-HC-DIV-3                         PIC X(2).
009620     03  I761P2-MASTER-BC                        PIC X(8).
009630     03  I761P2-FI-DIV-1                         PIC X(2).
009640     03  I761P2-FI-DIV-2                         PIC X(2).
009650     03  I761P2-FI-DIV-3                         PIC X(2).
009660     03  I761P2-BC                               PIC X(8).
009670     03  I761P2-PRI-BR                           PIC X(5).
009680     03  I761P2-SEC-BR                           PIC X(5).
009690     03  I761P2-BILL-TYPE                        PIC X(2).
009700     03  I761P2-CONSID-NBR-1                     PIC X(5).
009710     03  I761P2-CONSID-NBR-2                     PIC X(5).
009720     03  I761P2-CONSID-NBR-3                     PIC X(5).
009730     03  I761P2-CONSID-NBR-4                     PIC X(5).
009740     03  I761P2-CONSID-NBR-5                     PIC X(5).
009750     03  I761P2-CONSID-NBR-6                     PIC X(5).
009760     03  I761P2-CONSID-NBR-7                     PIC X(5).
009770*
009780 FD  I769P-FILE
009790     RECORDING MODE IS F
009800     BLOCK CONTAINS 0 RECORDS
009810     RECORD CONTAINS 135 CHARACTERS
009820     LABEL RECORDS STANDARD.
009830   01  I769P-RECORD.
009840     03  I769P-SEQ-FIELDS.
009850       05  I769P-SEQ-D.
009860         07  I769P-MAIL-CODE                     PIC X(5).
009870       05  I769P-SEQ-A.
009880         07  I769P-BC                            PIC X(8).
009890         07  I769P-PRI-BR                        PIC X(5).
009900         07  I769P-SEC-BR                        PIC X(5).
009910         07  I769P-BILL-TYPE                     PIC X(2).
009920         07  I769P-SEP-INV-CD                    PIC X(2).
009930         07  FILLER                              PIC X.
009940         07  I769P-CARD-CODE                     PIC X.
009950     03  I769P-1-INFO.
009960         07  I769P-1-ADDR-LINE-1                   PIC X(30).
009970         07  I769P-1-ADDR-LINE-2                   PIC X(30).
009980         07  I769P-1-ADDR-LINE-3                   PIC X(30).
009990         07  FILLER                                PIC X(16).
010000     03  I769P-2-INFO REDEFINES I769P-1-INFO.
010010         07  I769P-2-ADDR-CITY                     PIC X(30).
010020         07  I769P-2-ADDR-STATE                    PIC X(2).
010030         07  I769P-2-ADDR-ZIP-01-09                PIC X(9).
010040         07  I769P-2-ADDR-ZIP-10-11                PIC X(2).
010050         07  I769P-2-BRANCH-NAME                   PIC X(35).
010060         07  FILLER                                PIC X(28).
010070*
010080 FD  I781P-FILE
010090     RECORDING MODE IS F
010100     BLOCK CONTAINS 0 RECORDS
010110     RECORD CONTAINS 135 CHARACTERS
010120     LABEL RECORDS STANDARD.
010130   01  I781P-RECORD.
010140     03  I781P-MATCH-FIELDS                      PIC X(45).
010150     03  I781P-ASSIGNMENT-FIELDS                 PIC X(32).
010160     03  I781P-COMMENT                           PIC X(6).
010170     03  I781P-CARD-CODE                         PIC X.
010180*
010190 FD  I782P-FILE
010200     RECORDING MODE IS F
010210     BLOCK CONTAINS 0 RECORDS
010220     RECORD CONTAINS 135 CHARACTERS
010230     LABEL RECORDS STANDARD.
010240   01  I782P-RECORD.
010250     03  I782P-SEQUENCE.
010260       05  I782P-MATCH-SEQ.
010270         07  I782P-FI-SEQ.
010280           09  I782P-CONSID-NBR                PIC X(5).
010290           09  I782P-BC                        PIC X(8).
010300           09  I782P-PRI-BR                    PIC X(5).
010310           09  I782P-SEC-BR                    PIC X(5).
010320           09  I782P-BILL-TYPE                 PIC X(2).
010330         07  I782P-PRODUCT-GROUP.
010340           09  I782P-PROD-GRP-BYTE-1           PIC X.
010350           09  I782P-PROD-GRP-BYTE-2           PIC X.
010360       05  I782P-CARD-CODE                     PIC X.
010370     03  I782P-ASSIGNMENTS.
010380       05  I782P-ASSIGNMENT                    OCCURS 3 TIMES
010390                                               INDEXED BY
010400                                                 I782P-IX-ASSIGN
010410                                               PIC X(29).
010420     03  FILLER                                PIC X(20).
010430*
010440 FD  I850P-FILE
010450     RECORDING MODE IS F
010460     BLOCK CONTAINS 0 RECORDS
010470     RECORD CONTAINS 80 CHARACTERS
010480     LABEL RECORDS STANDARD.
010490   01  I850P-REC.
010500     03  I850P-INFO.
010510       05  I850P-INST-TYP                      PIC X.
010520       05  FILLER                              PIC X.
010530       05  I850P-INST-NBR                      PIC X(8).
010540       05  FILLER                              PIC X.
010550       05  I850P-CONSID-NBR                    PIC X(5).
010560     03  FILLER                                PIC X(64).
010570*
010580 FD  I851P-FILE
010590     RECORDING MODE IS F
010600     BLOCK CONTAINS 0 RECORDS
010610     RECORD CONTAINS 80 CHARACTERS
010620     LABEL RECORDS STANDARD.
010630   01  I851P-REC.
010640     03  I851P-INFO.
010650       05  I851P-CONSID-NBR                    PIC X(5).
010660       05  FILLER                              PIC X.
010670       05  I851P-CLIENT-SHR-PCT                PIC X(6).
010680       05  FILLER                              PIC X.
010690       05  I851P-SETTLEMENT-FREQ               PIC X.
010700       05  FILLER                              PIC X.
010710       05  I851P-HOLD-DAYS                     PIC X(2).
010720     03  FILLER                                PIC X(63).
010730*
010740 FD  I996P-FILE
010750     RECORDING MODE IS F
010760     BLOCK CONTAINS 0 RECORDS
010770     RECORD CONTAINS 80 CHARACTERS
010780     LABEL RECORDS STANDARD.
010790   01  I996P-RECORD.
010800     03  I996P-BC                                PIC X(8).
010810     03  I996P-SEQ-NBR                           PIC X(3).
010820     03  I996P-MATCH-TYPE                        PIC X(2).
010830     03  I996P-MATCH-PRODUCT                     PIC X(12).
010840     03  I996P-CONVERSION-FLAG                   PIC X.
010850     03  I996P-PROGRAM-ID                        PIC X.
010860     03  FILLER                                  PIC X(12).
010870     03  I996P-DESCRIPTION                       PIC X(20).
010880     03  FILLER                                  PIC X(21).
010890*
010900 FD  I1041P-FILE
010910     RECORDING MODE IS F
010920     BLOCK CONTAINS 0 RECORDS
010930     RECORD CONTAINS 80 CHARACTERS
010940     LABEL RECORDS STANDARD.
010950   01  I1041P-RECORD.
010960     03  I1041P-979-KEY.
010970       05  I1041P-979-INST-SEQ.
010980*                * BYTES 1-45 *
010990         07  I1041P-FIRST-25.
011000           09  I1041P-1-5                        PIC X(5).
011010           09  I1041P-6-11                       PIC X(6).
011020           09  I1041P-12-19                      PIC X(8).
011030           09  I1041P-20-25                      PIC X(6).
011040         07  I1041P-BC                           PIC X(8).
011050         07  I1041P-BRANCH                       PIC X(5).
011060         07  I1041P-39-45                        PIC X(7).
011070       05  I1041P-979-PGM-CODE                   PIC X.
011080     03  I1041P-BILLING-DATE                     PIC 9(6).
011090     03  I1041P-NEW-START-DATE                   PIC 9(6).
011100     03  I1041P-NEW-END-DATE                     PIC 9(6).
011110     03  I1041P-NEW-LIMIT                        PIC 9(7).
011120     03  I1041P-NEW-LIMIT-TYPE                   PIC X.
011130     03  FILLER                                  PIC X(8).
011140*
011150 FD  I1122P-FILE
011160     RECORDING MODE IS F
011170     BLOCK CONTAINS 0 RECORDS
011180     RECORD CONTAINS 80 CHARACTERS
011190     LABEL RECORDS STANDARD.
011200   01  I1122P-RECORD.
011210     03  I1122P-BC                               PIC X(8).
011220     03  I1122P-PRI-BR                           PIC X(5).
011230     03  I1122P-SEC-BR                           PIC X(5).
011240     03  I1122P-BILL-TYPE                        PIC X(2).
011250     03  I1122P-SEP-INV-CD                       PIC X(2).
011260     03  FILLER                                  PIC X.
011270     03  FILLER                                  PIC X(57).
011280*
011290 FD  I1130P-FILE
011300     RECORDING MODE IS F
011310     BLOCK CONTAINS 0 RECORDS
011320     RECORD CONTAINS 80 CHARACTERS
011330     LABEL RECORDS STANDARD.
011340   01  I1130P-RECORD.
011350     03  I1130P-CONSID-NBR                       PIC X(5).
011360     03  FILLER                                  PIC X.
011370     03  I1130P-PRODUCT-CODE                     PIC X(13).
011380     03  I1130P-NAME                             PIC X(27).
011390     03  I1130P-PRODUCT-DESC                     PIC X(17).
011400     03  FILLER                                  PIC X(17).
011410*
011420 FD  I1712P-FILE
011430     RECORDING MODE IS F
011440     BLOCK CONTAINS 0 RECORDS
011450     RECORD CONTAINS 80 CHARACTERS
011460     LABEL RECORDS STANDARD.
011470   01 I1712P-REC.
011480     03  I1712P-REPORT-NUMBER                    PIC X(06).
011490     03  FILLER                                  PIC X(01).
011500     03  I1712P-DATE-FIRST-BILLED.
011510       05  I1712P-CC-FIRST-BILLED                PIC X(02).
011520       05  I1712P-YY-FIRST-BILLED                PIC X(02).
011530       05  I1712P-MM-FIRST-BILLED                PIC X(02).
011540       05  I1712P-DD-FIRST-BILLED                PIC X(02).
011550     03  I1712P-DATE-FINAL-BILLED.
011560       05  I1712P-CC-FINAL-BILLED                PIC X(02).
011570       05  I1712P-YY-FINAL-BILLED                PIC X(02).
011580       05  I1712P-MM-FINAL-BILLED                PIC X(02).
011590       05  I1712P-DD-FINAL-BILLED                PIC X(02).
011600     03  I1712P-BILL-TO-BC                       PIC X(08).
011610     03  I1712P-BILL-TO-BRANCH                   PIC X(05).
011620     03  I1712P-FREQUENCY                        PIC X(01).
011630     03  I1712P-CONVERSION-TO-DISK               PIC X(01).
011640     03  I1712P-ADDITIONAL-SHIPPING              PIC X(02).
011650     03  I1712P-ON-GOING-HOURS                   PIC 9(03).
011660     03  I1712P-SET-UP-TIME                      PIC 9(03).
011670     03  I1712P-RUSH-DEVELOPMENT                 PIC X(01).
011680     03  I1712P-PAGE-COUNT                       PIC X(03).
011690     03  FILLER                                  PIC X(30).
011700*
011710 FD  I1907P-FILE
011720     RECORDING MODE IS F
011730     BLOCK CONTAINS 0 RECORDS
011740     RECORD CONTAINS 80 CHARACTERS
011750     LABEL RECORDS STANDARD.
011760   01  I1907P-RECORD                             PIC X(80).
011770*
011780 FD  I1921P-FILE
011790     RECORDING MODE IS F
011800     BLOCK CONTAINS 0 RECORDS
011810     RECORD CONTAINS 80 CHARACTERS
011820     LABEL RECORDS ARE OMITTED.
011830 01  I1921P-REC.
011840   03  I1921P-INFO.
011850     05  I1921P-CARD-TYPE                        PIC X.
011860     05  FILLER                                  PIC X.
011870     05  I1921P-INSTITUTION.
011880       07  I1921P-HOLDCO-CODE                    PIC X(5).
011890       07  I1921P-HOLDCO-SPACES                  PIC X(3).
011900   03  FILLER                                    PIC X(70).
011910*
011920 FD  I1961P-FILE
011930     RECORDING MODE IS F
011940     BLOCK CONTAINS 0 RECORDS
011950     RECORD CONTAINS 135 CHARACTERS
011960     LABEL RECORDS ARE OMITTED.
011970 01  I1961P-REC.
011980   03  I1961P-SEQ.
011990     05  I1961P-BC                         PIC X(08).
012000     05  I1961P-PRI-BR                     PIC X(05).
012010     05  I1961P-SEC-BR                     PIC X(05).
012020     05  I1961P-BILL-TYP                   PIC X(02).
012030     05  I1961P-SEP-INV-CODE               PIC X(02).
012040   03  I1961P-PRINT-OPTIONS.
012050     05  I1961P-PROD-DTL-FLAG              PIC X(01).
012060     05  I1961P-ORD-DTL-FLAG               PIC X(01).
012070     05  I1961P-PROD-PRT-FLAG              PIC X(01).
012080     05  I1961P-ORD-PRT-FLAG               PIC X(01).
012090     05  I1961P-SERVICE-FEE-FLAG           PIC X(01).
012100   03  FILLER                              PIC X.
012110   03  I1961P-DELIVERY-OPTIONS.
012120     05  I1961P-EMAIL-FMT                  PIC X(01).
012130     05  I1961P-ACCESS-KEY                 PIC X(08).
012140     05  I1961P-EMAIL-ADDR                 PIC X(60).
012150     05  I1961P-ENCRYPTION-METHOD          PIC X(01).
012160   03  FILLER                              PIC X(37).
012170*
012180 FD  I1967P-FILE
012190     RECORDING MODE IS F
012200     BLOCK CONTAINS 0 RECORDS
012210     RECORD CONTAINS 80 CHARACTERS
012220     LABEL RECORDS ARE OMITTED.
012230 01  I1967P-REC.
012240   03  I1967P-FI                           PIC X(20).
012250   03  FILLER REDEFINES I1967P-FI.
012260     05  I1967P-BC                         PIC X(8).
012270     05  FILLER                            PIC X(12).
012280   03  FILLER                              PIC X.
012290   03  I1967P-PROD                         PIC X(11).
012300   03  FILLER                              PIC X.
012310   03  I1967P-DQ                           PIC X(5).
012320   03  FILLER                              PIC X(6).
012330   03  I1967P-COMMENT                      PIC X(36).
012340*
012350 FD  I1979P-FILE
012360     RECORDING MODE IS F
012370     BLOCK CONTAINS 0 RECORDS
012380     RECORD CONTAINS 80 CHARACTERS
012390     LABEL RECORDS ARE OMITTED.
012400 01  I1979P-REC.
012410   03  FILLER                              PIC X(71).
012420   03  I1979P-IGNORE-FLAG                  PIC X.
012430   03  FILLER                              PIC X(8).
012440*
012450 FD  I575-FILE
012460*
012470 COPY T0575I.
012480*
012490 FD  I871-FILE
012500*
012510 COPY T0871I.
012520
012530 FD  I877-FILE
012540*
012550 COPY T0877I.
012560*
012570 FD  I896-FILE
012580*
012590 COPY T0896I.
012600*
012610 FD  I906SEQ-FILE
012620     RECORDING MODE IS F
012630*COPY T0906I.
012640     BLOCK CONTAINS 0 RECORDS
012650     RECORD CONTAINS 166 CHARACTERS
012660     LABEL RECORDS ARE STANDARD.
012670 01  I906-REC.
012680   03  I906-FI-ID                          PIC X(9).
012690   03  I906-BC                             PIC X(8).
012700   03  I906-OC-1                           PIC X(2).
012710   03  I906-OC-2                           PIC X(2).
012720   03  I906-OC-3                           PIC X(2).
012730   03  I906-PROMO-ID                       PIC X(9).
012740   03  I906-PROMO-NAME                     PIC X(30).
012750   03  I906-EXP-CD                         PIC X(2).
012760   03  I906-BILL-CD                        PIC X(2).
012770   03  I906-LONG-DESCR                     PIC X(80).
012780   03  I906-EFF-DATE                       PIC X(10).
012790   03  I906-END-DATE                       PIC X(10).
012800*
012810 FD  I1475-FILE
012820*
012830 COPY T1475I.
012840*
012850 FD  I8920-FILE
012860*
012870 COPY T8920I.
012880*
012890 FD  I442-FILE
012900*
012910 COPY T0442I.
012920*
012930 FD  I550-FILE
012940*
012950 COPY T0550I.
012960*
012970 FD  I550T-FILE
012980*
012990 COPY T0550O.
013000*
013010 FD  I552-FILE
013020*
013030 COPY T0552I.
013040*
013050 FD  I552T-FILE
013060*
013070 COPY T0552O.
013080*
013090 FD  I554-FILE
013100*
013110 COPY T0554I.
013120*
013130 FD  I554T-FILE
013140*
013150 COPY T0554O.
013160*
013170 FD  I556-FILE
013180*
013190 COPY T0556I.
013200*
013210 FD  I561-FILE
013220*
013230 COPY T0561I.
013240*
013250 FD  I562-FILE
013260*
013270 COPY T0562I.
013280*
013290 FD  I563-FILE
013300*
013310 COPY T0563I.
013320*
013330 FD  I565-FILE
013340*
013350 COPY T0565I.
013360*
013370 FD  I567-FILE
013380*
013390 COPY T0567I.
013400*
013410 FD  I759-FILE
013420*
013430 COPY T0759I.
013440*
013450 FD  I864-FILE
013460*
013470 COPY T0864I.
013480*
013490 FD  I979-FILE
013500*
013510 COPY T0979I.
013520*
013530 FD  I1637-FILE
013540*
013550 COPY T1637I.
013560*
013570 FD  I1840-FILE
013580*
013590 COPY T1840I.
013600*
013610 FD  I8935-FILE
013620*
013630 COPY T8935I.
013640*
013650 FD  I8935T-FILE
013660*
013670 COPY T8935O.
013680*
013690 FD  I8950-FILE
013700*
013710 COPY T8950I.
013720*
013730*
013740 WORKING-STORAGE SECTION.
013750*
013760 COPY TDLXMIGE.
013770     EXEC SQL INCLUDE SQLCA END-EXEC.
013780*
013790 01  WS-CONSID-TABLE-COUNT        PIC S9(9) COMP-3 VALUE +0.
013800*
013810 01  WS-FLAGS-AND-SUCH                           VALUE SPACES.
013820   03  WS-I442-FILE-STATUS        PIC X(2).
013830     88  WS-I442-SUCCESSFUL         VALUE '00'.
013840     88  WS-I442-END-OF-FILE        VALUE '10'.
013850     88  WS-I442-NO-SUCH-RECORD     VALUES '20', '23'.
013860     88  WS-I442-SUCCESSFUL-OPEN    VALUES '00', '97'.
013870   03  WS-I550-FILE-STATUS        PIC X(2).
013880     88  WS-I550-SUCCESSFUL         VALUE '00'.
013890     88  WS-I550-END-OF-FILE        VALUE '10'.
013900     88  WS-I550-NO-SUCH-RECORD     VALUES '20', '23'.
013910     88  WS-I550-SUCCESSFUL-OPEN    VALUES '00', '97'.
013920   03  WS-I550T-FILE-STATUS       PIC X(2).
013930     88  WS-I550T-SUCCESSFUL        VALUE '00'.
013940     88  WS-I550T-END-OF-FILE       VALUE '10'.
013950     88  WS-I550T-NO-SUCH-RECORD    VALUES '20', '23'.
013960     88  WS-I550T-SUCCESSFUL-OPEN   VALUES '00', '97'.
013970   03  WS-I552-FILE-STATUS        PIC X(2).
013980     88  WS-I552-SUCCESSFUL         VALUE '00'.
013990     88  WS-I552-END-OF-FILE        VALUE '10'.
014000     88  WS-I552-NO-SUCH-RECORD     VALUES '20', '23'.
014010     88  WS-I552-SUCCESSFUL-OPEN    VALUES '00', '97'.
014020   03  WS-I552T-FILE-STATUS       PIC X(2).
014030     88  WS-I552T-SUCCESSFUL        VALUE '00'.
014040     88  WS-I552T-END-OF-FILE       VALUE '10'.
014050     88  WS-I552T-NO-SUCH-RECORD    VALUES '20', '23'.
014060     88  WS-I552T-SUCCESSFUL-OPEN   VALUES '00', '97'.
014070   03  WS-I554-FILE-STATUS        PIC X(2).
014080     88  WS-I554-SUCCESSFUL         VALUE '00'.
014090     88  WS-I554-END-OF-FILE        VALUE '10'.
014100     88  WS-I554-NO-SUCH-RECORD     VALUES '20', '23'.
014110     88  WS-I554-SUCCESSFUL-OPEN    VALUES '00', '97'.
014120   03  WS-I554T-FILE-STATUS       PIC X(2).
014130     88  WS-I554T-SUCCESSFUL        VALUE '00'.
014140     88  WS-I554T-END-OF-FILE       VALUE '10'.
014150     88  WS-I554T-NO-SUCH-RECORD    VALUES '20', '23'.
014160     88  WS-I554T-SUCCESSFUL-OPEN   VALUES '00', '97'.
014170   03  WS-I556-FILE-STATUS        PIC X(2).
014180     88  WS-I556-SUCCESSFUL         VALUE '00'.
014190     88  WS-I556-END-OF-FILE        VALUE '10'.
014200     88  WS-I556-SUCCESSFUL-OPEN    VALUES '00', '97'.
014210   03  WS-I561-FILE-STATUS        PIC X(2).
014220     88  WS-I561-SUCCESSFUL         VALUE '00'.
014230     88  WS-I561-END-OF-FILE        VALUE '10'.
014240     88  WS-I561-NO-SUCH-RECORD     VALUES '20', '23'.
014250     88  WS-I561-SUCCESSFUL-OPEN    VALUES '00', '97'.
014260   03  WS-I562-FILE-STATUS        PIC X(2).
014270     88  WS-I562-SUCCESSFUL         VALUE '00'.
014280     88  WS-I562-END-OF-FILE        VALUE '10'.
014290     88  WS-I562-NO-SUCH-RECORD     VALUES '20', '23'.
014300     88  WS-I562-SUCCESSFUL-OPEN    VALUES '00', '97'.
014310   03  WS-I563-FILE-STATUS        PIC X(2).
014320     88  WS-I563-SUCCESSFUL         VALUE '00'.
014330     88  WS-I563-END-OF-FILE        VALUE '10'.
014340     88  WS-I563-NO-SUCH-RECORD     VALUES '20', '23'.
014350     88  WS-I563-SUCCESSFUL-OPEN    VALUES '00', '97'.
014360   03  WS-I565-FILE-STATUS        PIC X(2).
014370     88  WS-I565-SUCCESSFUL         VALUE '00'.
014380     88  WS-I565-END-OF-FILE        VALUE '10'.
014390     88  WS-I565-NO-SUCH-RECORD     VALUES '20', '23'.
014400     88  WS-I565-SUCCESSFUL-OPEN    VALUES '00', '97'.
014410   03  WS-I567-FILE-STATUS        PIC X(2).
014420     88  WS-I567-SUCCESSFUL         VALUE '00'.
014430     88  WS-I567-END-OF-FILE        VALUE '10'.
014440     88  WS-I567-NO-SUCH-RECORD     VALUES '20', '23'.
014450     88  WS-I567-SUCCESSFUL-OPEN    VALUES '00', '97'.
014460   03  WS-I759-FILE-STATUS        PIC X(2).
014470     88  WS-I759-SUCCESSFUL         VALUE '00'.
014480     88  WS-I759-NO-SUCH-RECORD     VALUES '20', '23'.
014490     88  WS-I759-SUCCESSFUL-OPEN    VALUES '00', '97'.
014500   03  WS-I864-FILE-STATUS       PIC X(2).
014510     88  WS-I864-SUCCESSFUL                VALUE '00' '02'.
014520     88  WS-I864-END-OF-FILE               VALUE '10'.
014530     88  WS-I864-NO-SUCH-RECORD            VALUE '23'.
014540     88  WS-I864-SUCCESSFUL-OPEN           VALUE '00'  '97'.
014550     88  WS-I864-FILE-NOT-CLOSED           VALUE '97'.
014560   03  WS-I979-FILE-STATUS        PIC X(2).
014570     88  WS-I979-SUCCESSFUL         VALUE '00'.
014580     88  WS-I979-END-OF-FILE        VALUE '10'.
014590     88  WS-I979-NO-SUCH-RECORD     VALUES '20', '23'.
014600     88  WS-I979-SUCCESSFUL-OPEN    VALUES '00', '97'.
014610   03  WS-I1637-FILE-STATUS       PIC X(2).
014620     88  WS-I1637-SUCCESSFUL        VALUE '00'.
014630     88  WS-I1637-END-OF-FILE       VALUE '10'.
014640     88  WS-I1637-NO-SUCH-RECORD    VALUES '20', '23'.
014650     88  WS-I1637-SUCCESSFUL-OPEN   VALUES '00', '97'.
014660   03  WS-I1840-FILE-STATUS       PIC X(2).
014670     88  WS-I1840-SUCCESSFUL        VALUE '00'.
014680     88  WS-I1840-END-OF-FILE       VALUE '10'.
014690     88  WS-I1840-NO-SUCH-RECORD    VALUES '20', '23'.
014700     88  WS-I1840-SUCCESSFUL-OPEN   VALUES '00', '97'.
014710   03  WS-I8935-FILE-STATUS       PIC X(2).
014720     88  WS-I8935-SUCCESSFUL        VALUE '00'.
014730     88  WS-I8935-END-OF-FILE       VALUE '10'.
014740     88  WS-I8935-NO-SUCH-RECORD    VALUES '20', '23'.
014750     88  WS-I8935-SUCCESSFUL-OPEN   VALUES '00', '97'.
014760   03  WS-I8935T-FILE-STATUS      PIC X(2).
014770     88  WS-I8935T-SUCCESSFUL       VALUE '00'.
014780     88  WS-I8935T-END-OF-FILE      VALUE '10'.
014790     88  WS-I8935T-NO-SUCH-RECORD   VALUES '20', '23'.
014800     88  WS-I8935T-SUCCESSFUL-OPEN  VALUES '00', '97'.
014810   03  WS-I8950-FILE-STATUS       PIC X(2).
014820     88  WS-I8950-SUCCESSFUL        VALUE '00'.
014830     88  WS-I8950-END-OF-FILE       VALUE '10'.
014840     88  WS-I8950-NO-SUCH-RECORD    VALUES '20', '23'.
014850     88  WS-I8950-SUCCESSFUL-OPEN   VALUES '00', '97'.
014860   03  WS-I442-FILE-FLAG          PIC X.
014870     88  OPENED-I442-FILE           VALUE 'Y'.
014880   03  WS-I550-FILE-FLAG          PIC X.
014890     88  OPENED-I550-FILE           VALUE 'Y'.
014900   03  WS-I550T-FILE-FLAG         PIC X.
014910     88  OPENED-I550T-FILE          VALUES 'Y', 'E'.
014920     88  EMPTY-I550T-FILE           VALUE 'E'.
014930   03  WS-I552-FILE-FLAG          PIC X.
014940     88  OPENED-I552-FILE           VALUES 'Y', 'E'.
014950     88  EMPTY-I552-FILE            VALUE 'E'.
014960   03  WS-I552T-FILE-FLAG         PIC X.
014970     88  OPENED-I552T-FILE          VALUES 'Y', 'E'.
014980     88  EMPTY-I552T-FILE           VALUE 'E'.
014990   03  WS-I554-FILE-FLAG          PIC X.
015000     88  OPENED-I554-FILE           VALUES 'Y', 'E'.
015010     88  EMPTY-I554-FILE            VALUE 'E'.
015020   03  WS-I554T-FILE-FLAG         PIC X.
015030     88  OPENED-I554T-FILE          VALUES 'Y', 'E'.
015040     88  EMPTY-I554T-FILE           VALUE 'E'.
015050   03  WS-I556-FILE-FLAG          PIC X.
015060     88  OPENED-I556-FILE           VALUES 'Y', 'E'.
015070     88  EMPTY-I556-FILE            VALUE 'E'.
015080   03  WS-I561-FILE-FLAG          PIC X.
015090     88  OPENED-I561-FILE           VALUES 'Y', 'E'.
015100     88  EMPTY-I561-FILE            VALUE 'E'.
015110   03  WS-I562-FILE-FLAG          PIC X.
015120     88  OPENED-I562-FILE           VALUES 'Y', 'E'.
015130     88  EMPTY-I562-FILE            VALUE 'E'.
015140   03  WS-I563-FILE-FLAG          PIC X.
015150     88  OPENED-I563-FILE           VALUES 'Y', 'E'.
015160     88  EMPTY-I563-FILE            VALUE 'E'.
015170   03  WS-I565-FILE-FLAG          PIC X.
015180     88  OPENED-I565-FILE           VALUES 'Y', 'E'.
015190     88  EMPTY-I565-FILE            VALUE 'E'.
015200   03  WS-I567-FILE-FLAG          PIC X.
015210     88  OPENED-I567-FILE           VALUES 'Y', 'E'.
015220     88  EMPTY-I567-FILE            VALUE 'E'.
015230   03  WS-I759-FILE-FLAG          PIC X.
015240     88  OPENED-I759-FILE           VALUES 'Y', 'E'.
015250   03  WS-I864-FILE-FLAG            PIC X.
015260     88  OPENED-I864-FILE           VALUES 'Y', 'E'.
015270     88  EMPTY-I864-FILE            VALUE 'E'.
015280   03  WS-I979-FILE-FLAG          PIC X.
015290     88  OPENED-I979-FILE           VALUES 'Y', 'E'.
015300     88  EMPTY-I979-FILE            VALUE 'E'.
015310   03  WS-I1637-FILE-FLAG         PIC X.
015320     88  OPENED-I1637-FILE          VALUES 'Y', 'E'.
015330     88  EMPTY-I1637-FILE           VALUE 'E'.
015340   03  WS-I1840-FILE-FLAG         PIC X.
015350     88  OPENED-I1840-FILE          VALUES 'Y', 'E'.
015360     88  EMPTY-I1840-FILE           VALUE 'E'.
015370   03  WS-I8935-FILE-FLAG         PIC X.
015380     88  OPENED-I8935-FILE          VALUES 'Y', 'E'.
015390     88  EMPTY-I8935-FILE           VALUE 'E'.
015400   03  WS-I8935T-FILE-FLAG        PIC X.
015410     88  OPENED-I8935T-FILE         VALUES 'Y', 'E'.
015420     88  EMPTY-I8935T-FILE          VALUE 'E'.
015430   03  WS-I8950-FILE-FLAG         PIC X.
015440     88  OPENED-I8950-FILE          VALUES 'Y', 'E'.
015450     88  EMPTY-I8950-FILE           VALUE 'E'.
015460   03  WS-IPARM-FILE-FLAG         PIC X.
015470     88  END-IPARM-FILE             VALUE 'E'.
015480   03  WS-IMAIL-FILE-FLAG         PIC X.
015490     88  END-IMAIL-FILE             VALUE 'E'.
015500   03  WS-I575-FILE-FLAG          PIC X.
015510     88  END-I575-FILE              VALUE 'E'.
015520   03  WS-I871-FILE-FLAG          PIC X.
015530     88  END-I871-FILE              VALUE 'E'.
015540   03  WS-I877-FILE-FLAG          PIC X.
015550     88  END-I877-FILE              VALUE 'E'.
015560   03  WS-I896-FILE-FLAG          PIC X.
015570     88  END-I896-FILE              VALUE 'E'.
015580   03  WS-I906SEQ-FILE-FLAG       PIC X.
015590     88  END-I906SEQ-FILE           VALUE 'E'.
015600   03  WS-I1475-FILE-FLAG         PIC X.
015610     88  END-I1475-FILE             VALUE 'E'.
015620   03  WS-I8920-FILE-FLAG         PIC X.
015630     88  END-I8920-FILE             VALUE 'E'.
015640   03  WS-I120P-FILE-FLAG         PIC X.
015650     88  END-I120P-FILE             VALUE 'E'.
015660   03  WS-I149P-FILE-FLAG         PIC X.
015670     88  END-I149P-FILE             VALUE 'E'.
015680   03  WS-I225P-FILE-FLAG         PIC X.
015690     88  END-I225P-FILE             VALUE 'E'.
015700   03  WS-I233P-FILE-FLAG         PIC X.
015710     88  END-I233P-FILE             VALUE 'E'.
015720   03  WS-I262P-FILE-FLAG         PIC X.
015730     88  END-I262P-FILE             VALUE 'E'.
015740   03  WS-I285P-FILE-FLAG         PIC X.
015750     88  END-I285P-FILE             VALUE 'E'.
015760   03  WS-I348P-FILE-FLAG         PIC X.
015770     88  END-I348P-FILE             VALUE 'E'.
015780   03  WS-I506P-FILE-FLAG         PIC X.
015790     88  END-I506P-FILE             VALUE 'E'.
015800   03  WS-I589P-FILE-FLAG         PIC X.
015810     88  END-I589P-FILE             VALUE 'E'.
015820   03  WS-I660P-FILE-FLAG         PIC X.
015830     88  END-I660P-FILE             VALUE 'E'.
015840   03  WS-I662P-FILE-FLAG         PIC X.
015850     88  END-I662P-FILE             VALUE 'E'.
015860   03  WS-I663P-FILE-FLAG         PIC X.
015870     88  END-I663P-FILE             VALUE 'E'.
015880   03  WS-I751P-FILE-FLAG         PIC X.
015890     88  END-I751P-FILE             VALUE 'E'.
015900   03  WS-I761P-FILE-FLAG         PIC X.
015910     88  END-I761P-FILE             VALUE 'E'.
015920   03  WS-I761P2-FILE-FLAG        PIC X.
015930     88  END-I761P2-FILE            VALUE 'E'.
015940   03  WS-I769P-FILE-FLAG         PIC X.
015950     88  END-I769P-FILE             VALUE 'E'.
015960   03  WS-I781P-FILE-FLAG         PIC X.
015970     88  END-I781P-FILE             VALUE 'E'.
015980   03  WS-I782P-FILE-FLAG         PIC X.
015990     88  END-I782P-FILE             VALUE 'E'.
016000   03  WS-I850P-FILE-FLAG         PIC X.
016010     88  END-I850P-FILE             VALUE 'E'.
016020   03  WS-I851P-FILE-FLAG         PIC X.
016030     88  END-I851P-FILE             VALUE 'E'.
016040   03  WS-I996P-FILE-FLAG         PIC X.
016050     88  END-I996P-FILE             VALUE 'E'.
016060   03  WS-I1041P-FILE-FLAG        PIC X.
016070     88  END-I1041P-FILE            VALUE 'E'.
016080   03  WS-I1122P-FILE-FLAG        PIC X.
016090     88  END-I1122P-FILE            VALUE 'E'.
016100   03  WS-I566SUM-FILE-FLAG       PIC X.
016110     88  END-I566SUM-FILE          VALUE 'E'.
016120   03  WS-1130P-FILE-FLAG         PIC X.
016130     88  END-1130P-FILE             VALUE 'E'.
016140   03  WS-I1712P-FILE-FLAG        PIC X.
016150     88  END-I1712P-FILE            VALUE 'E'.
016160   03  WS-I1907P-FILE-FLAG        PIC X.
016170     88  END-I1907P-FILE            VALUE 'E'.
016180   03  WS-I1921P-FILE-FLAG        PIC X.
016190     88  END-I1921P-FILE            VALUE 'E'.
016200   03  WS-I1961P-FILE-FLAG         PIC X.
016210     88  END-I1961P-FILE             VALUE 'E'.
016220   03  WS-I1967P-FILE-FLAG         PIC X.
016230     88  END-I1967P-FILE             VALUE 'E'.
016240   03  WS-I1979P-FILE-FLAG         PIC X.
016250     88  END-I1979P-FILE             VALUE 'E'.
016260   03  WS-RETURN-07-FLAG          PIC X.
016270     88  RETURN-07                  VALUE 'Y'.
016280   03  WS-RETURN-04-FLAG          PIC X.
016290     88  RETURN-04                  VALUE 'Y'.
016300   03  WS-PARM-PRINT-OPT          PIC X.
016310     88  PRINT-DUPLEX               VALUE 'D'.
016320   03  WS-PARM-EMPTY-OPT          PIC X.
016330     88  HEAD-EMPTY-SECTIONS        VALUE 'Y'.
016340   03  WS-SECTION-HEAD-FLAG       PIC X.
016350     88  PRINT-SECTION-HEAD         VALUE 'Y'.
016360   03  WS-FILE-HEAD-FLAG          PIC X.
016370     88  PRINT-FILE-HEAD            VALUE 'Y'.
016380   03  WS-COLUMN-HEAD-FLAG        PIC X.
016390     88  PRINT-COLUMN-HEAD          VALUE 'Y'.
016400   03  WS-PREV-RECORD-TYPE        PIC X.
016410   03  WS-IPARM-I550-MATCH-FLAG   PIC X.
016420     88  MATCHED-IPARM-I550         VALUE 'Y'.
016430   03  WS-I979-BC-HC-FOUND-FLAG   PIC X.
016440     88  I979-BC-HC-FOUND           VALUE 'N'.
016450   03  WS-8920-CN-MATCH-FLAG      PIC X.
016460     88  MATCHED-8920-CN            VALUE 'Y'.
016470*
016480 01  WS-FIRST-LINE-FLAG         PIC X VALUE 'N'.
016490   88  WS-FIRST-LINE                VALUE 'Y'.
016500   88  WS-NOT-FIRST-LINE            VALUE 'N'.
016510*
016520 01  WS-BILL-TO-INFO.
016530   03  WS-BILL-TO-FLAG               PIC X.
016540   03  WS-BILL-TO-LENGTH             PIC S9(4)  COMP.
016550   03  WS-BILL-TO-DATA.
016560     05  WS-BILL-TO-EACH OCCURS 10 TIMES
016570                         INDEXED BY IX-BILL-TO.
016580       07  WS-BILL-OC                PIC X(2).
016590       07  WS-BILL-NEW-BC            PIC X(8).
016600       07  WS-BILL-NEW-PBR           PIC X(5).
016610       07  WS-BILL-NEW-SBR           PIC X(5).
016620       07  WS-BILL-NEW-TYPE          PIC X(2).
016630       07  WS-BILL-NEW-EXP-CODE      PIC X(2).
016640       07  WS-BILL-REORDER-BC        PIC X(8).
016650       07  WS-BILL-REORDER-PBR       PIC X(5).
016660       07  WS-BILL-REORDER-SBR       PIC X(5).
016670       07  WS-BILL-REORDER-TYPE      PIC X(2).
016680       07  WS-BILL-REORDER-EXP-CODE  PIC X(2).
016690
016700*
016710 01  WS-SEQUENCES                                VALUE LOW-VALUES.
016720   03  WS-IMAIL-BC                PIC X(8).
016730   03  WS-I120P-BC                PIC X(8).
016740   03  WS-I149P-BC                PIC X(8).
016750   03  WS-I233P-BC                PIC X(8).
016760   03  WS-I262P-BC                PIC X(8).
016770   03  WS-I442-BC                 PIC X(8).
016780   03  WS-I906-BC                 PIC X(8).
016790   03  WS-I589P-BC                PIC X(8).
016800   03  WS-I8950-BC                PIC X(8).
016810   03  WS-I660P-BC                PIC X(8).
016820   03  WS-I662P-BC                PIC X(8).
016830   03  WS-I663P-BC                PIC X(8).
016840   03  WS-I751P-BC                PIC X(8).
016850   03  WS-I996P-BC                PIC X(8).
016860   03  WS-I1122P-BC               PIC X(8).
016870   03  WS-I1475-BC                PIC X(8).
016880   03  WS-I1840-BC                PIC X(8).
016890   03  WS-I1967P-BC               PIC X(8).
016900   03  WS-I442-HOLD-BC            PIC X(8).
016910   03  WS-IPARM-INFO.
016920     05  WS-IPARM-BC              PIC X(8).
016930     05  WS-IPARM-PRI-BR          PIC X(5).
016940   03  WS-I348P-EMP-NBR           PIC X(7).
016950   03  WS-I225P-SEQ.
016960     05  WS-I225P-BC              PIC X(8).
016970     05  WS-I225P-HC              PIC X(5).
016980   03  WS-PREV-I225P-SEQ          PIC X(13).
016990   03  WS-I850P-SEQ.
017000     05  WS-I850P-INST-TYP        PIC X.
017010     05  WS-I850P-INST-NBR        PIC X(8).
017020   03  WS-PREV-I850P-SEQ          PIC X(9).
017030   03  WS-I851P-SEQ               PIC X(5).
017040   03  WS-I877-RECORD-KEY         PIC X(9).
017050   03  WS-I871-SEQUENCE           PIC X(11).
017060   03  WS-I896-SEQUENCE           PIC X(12).
017070   03  WS-I575-SEQUENCE           PIC X(21).
017080   03  WS-I769P-SEQ-FIELDS.
017090     05  WS-I769P-SEQ-D           PIC X(5).
017100     05  WS-I769P-SEQ-A           PIC X(24).
017110   03  WS-PREV-I566S-SEQ          PIC X(10).
017120   03  WS-I1961P-BC               PIC X(8).
017130   03  WS-I285P-SEQ               PIC X(22).
017140   03  WS-I1041P-INST-SEQ         PIC X(45).
017150   03  WS-I506P-SEQ.
017160     05  WS-I506P-SEQ-HC-THRU-PBR.
017170       07  WS-I506P-SEQ-HC        PIC X(5).
017180       07  WS-I506P-SEQ-HC-DIVS   PIC X(6).
017190       07  WS-I506P-SEQ-MBC       PIC X(8).
017200       07  WS-I506P-SEQ-MBC-DIVS  PIC X(6).
017210       07  WS-I506P-SEQ-BC        PIC X(8).
017220       07  WS-I506P-SEQ-PBR       PIC X(5).
017230     05  WS-I506P-SEQ-ST-YR       PIC X(4).
017240     05  WS-I506P-SEQ-ST-MO       PIC X(2).
017250     05  WS-I506P-SEQ-ST-DY       PIC X(2).
017260   03  WS-PREV-I506P-SEQ          PIC X(46).
017270*
017280 01  WS-PRINT-CONTROLS.
017290   03  WS-LINE-COUNT              PIC S9(3)      COMP VALUE +099.
017300   03  WS-LINES-NEEDED            PIC S9(3)      COMP VALUE +0.
017310   03  WS-LINE-SPACER             PIC S9         COMP VALUE +2.
017320   03  WS-ENTRY-NBR               PIC S9(3)      COMP VALUE +0.
017330   03  WS-PAGE-NBR                PIC S9(5)      COMP-3 VALUE +0.
017340   03  FILLER REDEFINES WS-PAGE-NBR.
017350     05  FILLER                   PIC X(2).
017360     05  WS-PAGE-NBR-LAST-DIGIT   PIC S9         COMP-3.
017370       88  ODD-NUMBERED-PAGE        VALUES +1, +3, +5, +7, +9.
017380*
017390 01  WS-HEADINGS-ETC.
017400   03  WS-HEADING-1.
017410     05  FILLER                   PIC X          VALUE '-'.
017420     05  WS-HD1-PROGRAM-NUMBER    PIC X(8)       VALUE SPACE.
017430     05  FILLER                   PIC X(19)      VALUE '-'.
017440     05  FILLER                  PIC X(32) VALUE 'BILREF LISTING'.
017450     05  FILLER                   PIC X(9)       VALUE 'RUN DATE'.
017460     05  WS-HD1-RUN-MONTH         PIC X(2)       VALUE '00'.
017470     05  FILLER                   PIC X          VALUE '-'.
017480     05  WS-HD1-RUN-DAY           PIC X(2)       VALUE '00'.
017490     05  FILLER                   PIC X          VALUE '-'.
017500     05  WS-HD1-RUN-YEAR          PIC X(4)       VALUE '0000'.
017510     05  FILLER                   PIC X(18)      VALUE SPACE.
017520     05  FILLER                   PIC X(10)     VALUE 'BC/BRANCH'.
017530     05  WS-HD1-BC                PIC X(8)       VALUE '00000000'.
017540     05  FILLER                   PIC X          VALUE SPACE.
017550     05  WS-HD1-PRI-BR            PIC X(5)       VALUE '00000'.
017560     05  FILLER                   PIC X(18)      VALUE SPACE.
017570     05  FILLER                   PIC X(5)       VALUE 'PAGE'.
017580     05  WS-HD1-PAGE-NBR          PIC ZZ,ZZ9.
017590     05  FILLER                   PIC X(1)       VALUE SPACE.
017600   03  WS-SECTION-HEADING.
017610     05  FILLER                   PIC X(64)      VALUE ALL '*'.
017620     05  WS-SECT-HD-TITLE         PIC X(22)      VALUE SPACE.
017630     05  FILLER                   PIC X(65)      VALUE ALL '*'.
017640   03  WS-SECTION-HEADING-STD.
017650     05  FILLER                   PIC X(64)      VALUE ALL '*'.
017660     05  FILLER                   PIC X(22)      VALUE SPACE.
017670     05  FILLER                   PIC X(65)      VALUE ALL '*'.
017680   03  WS-SECTION-HEADING-CI.
017690     05  FILLER                   PIC X(49)      VALUE ALL '*'.
017700     05  FILLER                   PIC X(52)      VALUE
017710           ' CI INTERFACE - BILLING DOES NOT MODIFY THESE FILES '.
017720     05  FILLER                   PIC X(50)      VALUE ALL '*'.
017730   03  WS-FILE-HEADING.
017740     05  WS-FILE-HD-FILE-NBR      PIC X(11)      VALUE SPACE.
017750     05  FILLER                   PIC X(5)       VALUE SPACE.
017760     05  WS-FILE-HD-FILE-NAME     PIC X(50)      VALUE SPACE.
017770     05  FILLER                   PIC X(85)      VALUE SPACE.
017780   03  WS-MAIL-D1.
017790     05  FILLER                   PIC X(2)       VALUE SPACE.
017800     05  FILLER                   PIC X(135)     VALUE ALL '-'.
017810     05  FILLER                   PIC X(14)      VALUE SPACE.
017820   03  WS-MAIL-P1                                VALUE SPACE.
017830     05  FILLER                   PIC X(2).
017840     05  WS-MAIL-P1-RECORD        PIC X(135).
017850     05  FILLER                   PIC X(14).
017860   03  WS-442-C1.
017870     05  FILLER                   PIC X(01)  VALUE SPACE.
017880     05  FILLER                   PIC X(08)  VALUE 'BANKCODE'.
017890     05  FILLER                   PIC X(02)  VALUE SPACE.
017900     05  FILLER                   PIC X(02)  VALUE 'CC'.
017910     05  FILLER                   PIC X(02)  VALUE SPACE.
017920     05  FILLER                   PIC X(04)  VALUE 'DUP#'.
017930     05  FILLER                   PIC X(02)  VALUE SPACE.
017940     05  FILLER                   PIC X(05)  VALUE 'M-CUT'.
017950     05  FILLER                   PIC X(02)  VALUE SPACE.
017960     05  FILLER                   PIC X(02)  VALUE 'MC'.
017970     05  FILLER                   PIC X(02)  VALUE SPACE.
017980     05  FILLER                   PIC X(03)  VALUE 'MBC'.
017990     05  FILLER                   PIC X(02)  VALUE SPACE.
018000     05  FILLER                   PIC X(02)  VALUE 'MO'.
018010     05  FILLER                   PIC X(02)  VALUE SPACE.
018020     05  FILLER         PIC X(16)  VALUE 'MATCH-TEXT-LINES'.
018030     05  FILLER                   PIC X(44)  VALUE SPACE.
018040     05  FILLER                   PIC X(02)  VALUE SPACE.
018050     05  FILLER                   PIC X(05)  VALUE 'EPC-F'.
018060     05  FILLER                   PIC X(02)  VALUE SPACE.
018070     05  FILLER         PIC X(12)  VALUE 'PROGRAM NAME'.
018080     05  FILLER                   PIC X(13)  VALUE SPACE.
018090   03  WS-442-D1.
018100     05  FILLER                   PIC X(01)  VALUE SPACE.
018110     05  FILLER                   PIC X(08)  VALUE ALL '-'.
018120     05  FILLER                   PIC X(02)  VALUE SPACE.
018130     05  FILLER                   PIC X(02)  VALUE '--'.
018140     05  FILLER                   PIC X(02)  VALUE SPACE.
018150     05  FILLER                   PIC X(04)  VALUE '----'.
018160     05  FILLER                   PIC X(02)  VALUE SPACE.
018170     05  FILLER                   PIC X(05)  VALUE '-----'.
018180     05  FILLER                   PIC X(02)  VALUE SPACE.
018190     05  FILLER                   PIC X(02)  VALUE '--'.
018200     05  FILLER                   PIC X(02)  VALUE SPACE.
018210     05  FILLER                   PIC X(02)  VALUE '--'.
018220     05  FILLER                   PIC X(03)  VALUE SPACE.
018230     05  FILLER                   PIC X(02)  VALUE '--'.
018240     05  FILLER                   PIC X(02)  VALUE SPACE.
018250     05  FILLER                   PIC X(60)   VALUE ALL '-'.
018260     05  FILLER                   PIC X(02)      VALUE SPACE.
018270     05  FILLER                   PIC X(05)  VALUE ALL '-'.
018280     05  FILLER                   PIC X(02)      VALUE SPACE.
018290     05  FILLER                   PIC X(25)   VALUE ALL '-'.
018300   03  WS-442-P1                             VALUE SPACE.
018310     05  FILLER                    PIC X.
018320     05  WS-442-P1-BC              PIC X(8).
018330     05  FILLER                    PIC X(2).
018340     05  WS-442-P1-COMPLEXITY-CODE PIC 9(2).
018350     05  FILLER                    PIC X(2).
018360     05  WS-442-P1-DUPLICATE-NBR   PIC 9(4).
018370     05  FILLER                    PIC X(2).
018380     05  WS-442-P1-MATCH-CUT        PIC X(5).
018390     05  FILLER                     PIC X(2).
018400     05  WS-442-P1-MAIL-CODE        PIC X(2).
018410     05  FILLER                     PIC X(2).
018420     05  WS-442-P1-MATCH-BILL-COND  PIC X(2).
018430     05  FILLER                     PIC X(3).
018440     05  WS-442-P1-MATCH-ORD-COND   PIC X(2).
018450     05  FILLER                     PIC X(2).
018460     05  WS-442-P1-MATCH-TEXT-LINE  PIC X(60).
018470     05  FILLER                     PIC X(2).
018480     05  WS-442-P1-EPC-FLAG         PIC X.
018490     05  FILLER                     PIC X(6).
018500     05  WS-442-P1-PROGRAM-NAME     PIC X(25).
018510     05  FILLER                     PIC X(2).
018520   03  WS-442-C2.
018530     05  FILLER                   PIC X(50)      VALUE
018540             '     TTCODE PRDUCT QUANTITY  M-CUT MC MBC MO MATCH'.
018550     05  FILLER                   PIC X(50)      VALUE
018560             '-TEXT-LINES                                       '.
018570     05  FILLER                   PIC X(51)      VALUE
018580            '      EPC-F PROGRAM NAME                           '.
018590   03  WS-442-D2.
018600     05  FILLER                   PIC X(50)      VALUE
018610             '     ------ ------ --------- ----- -- --  -- -----'.
018620     05  FILLER                   PIC X(50)      VALUE
018630             '--------------------------------------------------'.
018640     05  FILLER                   PIC X(51)      VALUE
018650            '-----   -   -------------------------              '.
018660   03  WS-442-P2                                VALUE SPACE.
018670     05  FILLER                     PIC X(5).
018680     05  WS-442-P2-TT-CODE          PIC X(6).
018690     05  FILLER                     PIC X.
018700     05  WS-442-P2-PRODUCT          PIC X(6).
018710     05  FILLER                     PIC X.
018720     05  WS-442-P2-QUANTITY         PIC 9(9).
018730     05  FILLER                     PIC X.
018740     05  WS-442-P2-MATCH-CUT        PIC X(5).
018750     05  FILLER                     PIC X.
018760     05  WS-442-P2-MAIL-CODE        PIC X(2).
018770     05  FILLER                     PIC X.
018780     05  WS-442-P2-MATCH-BILL-COND  PIC X(2).
018790     05  FILLER                     PIC X(2).
018800     05  WS-442-P2-MATCH-ORD-COND   PIC X(2).
018810     05  FILLER                     PIC X.
018820     05  WS-442-P2-MATCH-TEXT-LINE  PIC X(60).
018830     05  FILLER                     PIC X(3).
018840     05  WS-442-P2-EPC-FLAG         PIC X.
018850     05  FILLER                     PIC X(3).
018860     05  WS-442-P2-PROGRAM-NAME     PIC X(25).
018870     05  FILLER                     PIC X.
018880   03  WS-906-C1.
018890     05  FILLER                   PIC X(50)      VALUE
018900             '     BC     EXP CD  OC 1  OC 2  OC 3             P'.
018910     05  FILLER                   PIC X(50)      VALUE
018920             'ROMO NAME             EFF DATE    END DATE     FI '.
018930     05  FILLER                   PIC X(51)      VALUE
018940             'ID   PROMO ID                                     '.
018950   03  WS-906-D1.
018960     05  FILLER                   PIC X(50)      VALUE
018970             '  --------    --     --    --    --    -----------'.
018980     05  FILLER                   PIC X(50)      VALUE
018990             '-------------------  ----------  ----------  -----'.
019000     05  FILLER                   PIC X(51)      VALUE
019010            '----  ---------                                    '.
019020   03  WS-906-P1                                 VALUE SPACE.
019030     05  FILLER                   PIC X(2).
019040     05  WS-906-P1-BC             PIC X(8).
019050     05  FILLER                   PIC X(4).
019060     05  WS-906-P1-EXP-CD         PIC X(2).
019070     05  FILLER                   PIC X(5).
019080     05  WS-906-P1-OC-1           PIC X(2).
019090     05  FILLER                   PIC X(4).
019100     05  WS-906-P1-OC-2           PIC X(2).
019110     05  FILLER                   PIC X(4).
019120     05  WS-906-P1-OC-3           PIC X(2).
019130     05  FILLER                   PIC X(4).
019140     05  WS-906-P1-PROMO-NAME     PIC X(30).
019150     05  FILLER                   PIC X(2).
019160     05  WS-906-P1-EFF-DATE       PIC X(10).
019170     05  FILLER                   PIC X(2).
019180     05  WS-906-P1-END-DATE       PIC X(10).
019190     05  FILLER                   PIC X(2).
019200     05  WS-906-P1-FI-ID          PIC X(9).
019210     05  FILLER                   PIC X(2).
019220     05  WS-906-P1-PROMO-ID       PIC X(9).
019230     05  FILLER                   PIC X(36).
019240   03  WS-550-C1A.
019250     05  FILLER                   PIC X(50)      VALUE
019260             '                  LAST           HC     MASTER    '.
019270     05  FILLER                   PIC X(50)      VALUE
019280             'MBC    PRC   ACCESS POINTERS   DEP TYP TYP    TAX '.
019290     05  FILLER                   PIC X(51)      VALUE
019300            '   TAX UPC     A/R-ACCOUNT   BILLING    GEOG.      '.
019310   03  WS-550-C1B.
019320     05  FILLER                   PIC X(50)      VALUE
019330             '     BC     BR   UPDATE  HC     DIVS      BC      '.
019340     05  FILLER                   PIC X(50)      VALUE
019350             'DIVS   DES GUAR ALT  SPL  UPCH  ST INS OFC   JURIS'.
019360     05  FILLER                   PIC X(51)      VALUE
019370            '   E R RBT    BC     BR  TC   NUMBER   SLSREP      '.
019380   03  WS-550-D1.
019390     05  FILLER                   PIC X(50)      VALUE
019400             '  -------- ----- ------ ----- -- -- -- -------- --'.
019410     05  FILLER                   PIC X(50)      VALUE
019420             ' -- --  -- ---- ---- ---- ----  --  --  -- -------'.
019430     05  FILLER                   PIC X(51)      VALUE
019440            '-- - -  -  -------- ---- -- ---------- -------     '.
019450   03  WS-550-P1                                 VALUE SPACE.
019460     05  FILLER                   PIC X(2).
019470     05  WS-550-P1-BC             PIC X(8).
019480     05  FILLER                   PIC X.
019490     05  WS-550-P1-BRANCH         PIC X(5).
019500     05  FILLER                   PIC X.
019510     05  WS-550-P1-LAST-UPDATE    PIC X(6).
019520     05  FILLER                   PIC X.
019530     05  WS-550-P1-HOLDING-CO     PIC X(5).
019540     05  FILLER                   PIC X.
019550     05  WS-550-P1-HC-L1-DIV      PIC X(2).
019560     05  FILLER                   PIC X.
019570     05  WS-550-P1-HC-L2-DIV      PIC X(2).
019580     05  FILLER                   PIC X.
019590     05  WS-550-P1-HC-L3-DIV      PIC X(2).
019600     05  FILLER                   PIC X.
019610     05  WS-550-P1-FI-MASTER-BC   PIC X(8).
019620     05  FILLER                   PIC X.
019630     05  WS-550-P1-FI-L1-DIV      PIC X(2).
019640     05  FILLER                   PIC X.
019650     05  WS-550-P1-FI-L2-DIV      PIC X(2).
019660     05  FILLER                   PIC X.
019670     05  WS-550-P1-FI-L3-DIV      PIC X(2).
019680     05  FILLER                   PIC X(2).
019690     05  WS-550-P1-PRICE-DESIG    PIC X(2).
019700     05  FILLER                   PIC X.
019710     05  WS-550-P1-GUAR-ADJ-ACC   PIC X(4).
019720     05  FILLER                   PIC X.
019730     05  WS-550-P1-ALT-ADJ-ACC    PIC X(4).
019740     05  FILLER                   PIC X.
019750     05  WS-550-P1-SPL-ADJ-ACC    PIC X(4).
019760     05  FILLER                   PIC X.
019770     05  WS-550-P1-UPCHARGE-ACC   PIC X(4).
019780     05  FILLER                   PIC X(2).
019790     05  WS-550-P1-DEP-STATUS     PIC X(2).
019800     05  FILLER                   PIC X(2).
019810     05  WS-550-P1-TYPE-INST      PIC X(2).
019820     05  FILLER                   PIC X(2).
019830     05  WS-550-P1-TYPE-OFFICE    PIC X(2).
019840     05  FILLER                   PIC X.
019850     05  WS-550-P1-TAX-JURIS      PIC X(9).
019860     05  FILLER                   PIC X.
019870     05  WS-550-P1-EXP-TAX-FLAG   PIC X.
019880     05  FILLER                   PIC X.
019890     05  WS-550-P1-RSL-TAX-FLAG   PIC X.
019900     05  FILLER                   PIC X(2).
019910     05  WS-550-P1-UPCH-REBT-FLAG PIC X.
019920     05  FILLER                   PIC X(2).
019930     05  WS-550-P1-A-R-BC         PIC X(8).
019940     05  FILLER                   PIC X.
019950     05  WS-550-P1-A-R-PRI-BR     PIC X(4).
019960     05  FILLER                   PIC X.
019970     05  WS-550-P1-A-R-TYP        PIC X(2).
019980     05  FILLER                   PIC X.
019990     05  WS-550-P1-SALES-BANK-NBR PIC X(10).
020000     05  FILLER                   PIC X.
020010     05  WS-550-P1-SLSREP-NBR     PIC X(7).
020020     05  FILLER                   PIC X(5).
020030   03  WS-550-C2.
020040     05  FILLER                   PIC X(50)      VALUE
020050             '     BC     BR   F I NAME                         '.
020060     05  FILLER                   PIC X(50)      VALUE
020070             '   BRANCH NAME                         ADDRESS LIN'.
020080     05  FILLER                   PIC X(51)      VALUE
020090            'E 1                                                '.
020100   03  WS-550-D2.
020110     05  FILLER                   PIC X(50)      VALUE
020120             '  -------- ----- ---------------------------------'.
020130     05  FILLER                   PIC X(50)      VALUE
020140             '-- ----------------------------------- -----------'.
020150     05  FILLER                   PIC X(51)      VALUE
020160            '-------------------                                '.
020170   03  WS-550-P2                                 VALUE SPACE.
020180     05  FILLER                   PIC X(2).
020190     05  WS-550-P2-BC             PIC X(8).
020200     05  FILLER                   PIC X.
020210     05  WS-550-P2-BRANCH         PIC X(5).
020220     05  FILLER                   PIC X.
020230     05  WS-550-P2-FI-NAME        PIC X(35).
020240     05  FILLER                   PIC X.
020250     05  WS-550-P2-BRANCH-NAME    PIC X(35).
020260     05  FILLER                   PIC X.
020270     05  WS-550-P2-ADDR-LINE-1    PIC X(30).
020280     05  FILLER                   PIC X(32).
020290   03  WS-550-C3.
020300     05  FILLER                   PIC X(50)      VALUE
020310             '     BC     BR   ADDRESS LINE 2                 AD'.
020320     05  FILLER                   PIC X(50)      VALUE
020330             'DRESS LINE 3                 CITY                 '.
020340     05  FILLER                   PIC X(51)      VALUE
020350            '          ST  ZIP   +4                             '.
020360   03  WS-550-D3.
020370     05  FILLER                   PIC X(50)      VALUE
020380             '  -------- ----- ------------------------------ --'.
020390     05  FILLER                   PIC X(50)      VALUE
020400             '---------------------------- ---------------------'.
020410     05  FILLER                   PIC X(51)      VALUE
020420            '--------- -- ----- ----                            '.
020430   03  WS-550-P3                                 VALUE SPACE.
020440     05  FILLER                   PIC X(2).
020450     05  WS-550-P3-BC             PIC X(8).
020460     05  FILLER                   PIC X.
020470     05  WS-550-P3-BRANCH         PIC X(5).
020480     05  FILLER                   PIC X.
020490     05  WS-550-P3-ADDR-LINE-2    PIC X(30).
020500     05  FILLER                   PIC X.
020510     05  WS-550-P3-ADDR-LINE-3    PIC X(30).
020520     05  FILLER                   PIC X.
020530     05  WS-550-P3-ADDRESS-CITY   PIC X(30).
020540     05  FILLER                   PIC X.
020550     05  WS-550-P3-ADDRESS-STATE  PIC X(2).
020560     05  FILLER                   PIC X.
020570     05  WS-550-P3-5-DIG-ZIP-CD   PIC X(5).
020580     05  FILLER                   PIC X.
020590     05  WS-550-P3-ZIP-PLUS-4     PIC X(4).
020600     05  FILLER                   PIC X(28).
020610   03  WS-864-C1.
020620     05  FILLER                   PIC X(50)      VALUE
020630             '  BC        DEAL-NBR  FLAG  OC  NEW-EXP  R-EXP    '.
020640     05  FILLER                   PIC X(101)     VALUE SPACES.
020650   03  WS-864-D1.
020660     05  FILLER                   PIC X(50)      VALUE
020670             '  --------  --------  ----  --  -------  -----    '.
020680     05  FILLER                   PIC X(101)     VALUE SPACES.
020690   03  WS-864-P1                                 VALUE SPACES.
020700     05  FILLER                   PIC X(2).
020710     05  WS-864-P1-BC             PIC X(8).
020720     05  FILLER                   PIC X(2).
020730     05  WS-864-DEAL-NBR          PIC X(7).
020740     05  FILLER                   PIC X(3).
020750     05  WS-864-BILL-FLAG         PIC X(1).
020760     05  FILLER                   PIC X(5).
020770     05  WS-864-BILL-OC           PIC X(2).
020780     05  FILLER                   PIC X(2).
020790     05  WS-864-BILL-NEW-EXP      PIC X(2).
020800     05  FILLER                   PIC X(7).
020810     05  WS-864-BILL-R-EXP        PIC X(2).
020820     05  FILLER                   PIC X(108).
020830   03  WS-561-C1.
020840     05  FILLER                   PIC X(50)      VALUE
020850             '   PRD-BC  SEQ# UPDATE PR-B1 PR-B2 MATCH ACCOUNT F'.
020860     05  FILLER                   PIC X(20)      VALUE
020870             'ORMAT  BIL-BC  BL-BR'.
020880     05  FILLER                   PIC X(81)      VALUE SPACES.
020890   03  WS-561-D1.
020900     05  FILLER                   PIC X(50)      VALUE
020910             '  -------- ---- ------ ----- ----- ---------------'.
020920     05  FILLER                   PIC X(20)      VALUE
020930             '----- -------- -----'.
020940     05  FILLER                   PIC X(81)      VALUE SPACES.
020950   03  WS-561-P1                                 VALUE SPACES.
020960     05  FILLER                   PIC X(2).
020970     05  WS-561-P1-PRD-BC         PIC X(8).
020980     05  FILLER                   PIC X(1).
020990     05  WS-561-P1-KEY-SEQ        PIC X(4).
021000     05  FILLER                   PIC X(1).
021010     05  WS-561-P1-UPDATE-DATE    PIC X(6).
021020     05  FILLER                   PIC X(1).
021030     05  WS-561-P1-PRD-PRI-BR     PIC X(5).
021040     05  FILLER                   PIC X(1).
021050     05  WS-561-P1-PRD-SEC-BR     PIC X(5).
021060     05  FILLER                   PIC X(1).
021070     05  WS-561-P1-ACCT-FORMAT    PIC X(20).
021080     05  FILLER                   PIC X(1).
021090     05  WS-561-P1-BIL-BC         PIC X(8).
021100     05  FILLER                   PIC X(1).
021110     05  WS-561-P1-BIL-PRI-BR     PIC X(5).
021120     05  FILLER                   PIC X(81).
021130   03  WS-562-C1.
021140     05  FILLER                   PIC X(50)      VALUE
021150             '   KEY BC  SEQ# UPDATE LO BR HI BR  PROD CODE   X-'.
021160     05  FILLER                   PIC X(50)      VALUE
021170             'W ACCOUNT FORMAT       REORD CONV/PREF CHG EXP CD '.
021180     05  FILLER                   PIC X(51)      VALUE SPACES.
021190   03  WS-562-D1.
021200     05  FILLER                   PIC X(50)      VALUE
021210             '  -------- ---- ------ ----- ----- ------------ --'.
021220     05  FILLER                   PIC X(50)      VALUE
021230             '- -------------------- ----- --------- ---------- '.
021240     05  FILLER                   PIC X(51)      VALUE SPACES.
021250   03  WS-562-P1                                 VALUE SPACES.
021260     05  FILLER                   PIC X(2).
021270     05  WS-562-P1-BC             PIC X(8).
021280     05  FILLER                   PIC X.
021290     05  WS-562-P1-KEY-SEQ        PIC X(4).
021300     05  FILLER                   PIC X.
021310     05  WS-562-P1-UPDATE-DATE    PIC X(6).
021320     05  FILLER                   PIC X.
021330     05  WS-562-P1-M-LOW-PRI-BR   PIC X(5).
021340     05  FILLER                   PIC X.
021350     05  WS-562-P1-M-HI-PRI-BR    PIC X(5).
021360     05  FILLER                   PIC X.
021370     05  WS-562-P1-M-PROD-CODE    PIC X(12).
021380     05  FILLER                   PIC X(2).
021390     05  WS-562-P1-M-XW-FLAG      PIC X.
021400     05  FILLER                   PIC X(2).
021410     05  WS-562-P1-M-ACCT-FMT     PIC X(20).
021420     05  FILLER                   PIC X(3).
021430     05  WS-562-P1-M-REORD-FLG    PIC X.
021440     05  FILLER                   PIC X(7).
021450     05  WS-562-P1-CONV-PREF-FLG  PIC X.
021460     05  FILLER                   PIC X(9).
021470     05  WS-562-P1-CHG-PROD-1-2   PIC X(2).
021480     05  FILLER                   PIC X(56).
021490   03  WS-563-C1.
021500     05  FILLER                   PIC X(50)      VALUE
021510             '   KEY BC  SEQ# UPDATE LO BR HI BR  PROD CODE     '.
021520     05  FILLER                   PIC X(50)      VALUE
021530             'ACCOUNT FORMAT     P-O  CHG BC  C BR              '.
021540     05  FILLER                   PIC X(51)      VALUE SPACES.
021550   03  WS-563-D1.
021560     05  FILLER                   PIC X(50)      VALUE
021570             '  -------- ---- ------ ----- ----- ------------ --'.
021580     05  FILLER                   PIC X(50)      VALUE
021590             '------------------ --- -------- -----             '.
021600     05  FILLER                   PIC X(51)      VALUE SPACES.
021610   03  WS-563-P1                                 VALUE SPACES.
021620     05  FILLER                   PIC X(2).
021630     05  WS-563-P1-BC             PIC X(8).
021640     05  FILLER                   PIC X.
021650     05  WS-563-P1-KEY-SEQ        PIC X(4).
021660     05  FILLER                   PIC X.
021670     05  WS-563-P1-UPDATE-DATE    PIC X(6).
021680     05  FILLER                   PIC X.
021690     05  WS-563-P1-M-LOW-PRI-BR   PIC X(5).
021700     05  FILLER                   PIC X.
021710     05  WS-563-P1-M-HIGH-PRI-BR  PIC X(5).
021720     05  FILLER                   PIC X.
021730     05  WS-563-P1-M-PROD         PIC X(12).
021740     05  FILLER                   PIC X.
021750     05  WS-563-P1-M-ACCT-FMT     PIC X(20).
021760     05  FILLER                   PIC X(2).
021770     05  WS-563-P1-M-PO-FLAG      PIC X.
021780     05  FILLER                   PIC X(2).
021790     05  WS-563-P1-CHG-BC         PIC X(8).
021800     05  FILLER                   PIC X.
021810     05  WS-563-P1-CHG-PRI-BR     PIC X(5).
021820     05  FILLER                   PIC X(64).
021830   03  WS-565-C1.
021840     05  FILLER                   PIC X(50)      VALUE
021850             '     BC    SEQ   DATE  LO-BR HI-BR EXP CR  P-O PRO'.
021860     05  FILLER                   PIC X(50)      VALUE
021870             'DUCT CODE  ACCOUNT FORMAT       INV  NACHA        '.
021880     05  FILLER                   PIC X(51)      VALUE SPACE.
021890   03  WS-565-D1.
021900     05  FILLER                   PIC X(50)      VALUE
021910             '  -------- ---- ------ ----- -----  -   -   -  ---'.
021920     05  FILLER                   PIC X(50)      VALUE
021930             '---------- --------------------  -  -------       '.
021940     05  FILLER                   PIC X(51)      VALUE SPACE.
021950   03  WS-565-P1                                 VALUE SPACES.
021960     05  FILLER                   PIC X(2).
021970     05  WS-565-P1-BC             PIC X(8).
021980     05  FILLER                   PIC X(1).
021990     05  WS-565-P1-KEY-SEQ        PIC X(4).
022000     05  FILLER                   PIC X(1).
022010     05  WS-565-P1-UPDATE-DATE    PIC X(6).
022020     05  FILLER                   PIC X.
022030     05  WS-565-P1-M-LOW-PRI-BR   PIC X(5).
022040     05  FILLER                   PIC X.
022050     05  WS-565-P1-M-HIGH-PRI-BR  PIC X(5).
022060     05  FILLER                   PIC X(2).
022070     05  WS-565-P1-M-EXP-FLG      PIC X.
022080     05  FILLER                   PIC X(3).
022090     05  WS-565-P1-M-CR-FLG       PIC X.
022100     05  FILLER                   PIC X(3).
022110     05  WS-565-P1-M-P-O-FLG      PIC X.
022120     05  FILLER                   PIC X(2).
022130     05  WS-565-P1-M-PROD-CODE    PIC X(13).
022140     05  FILLER                   PIC X(1).
022150     05  WS-565-P1-M-ACCT-FMT     PIC X(20).
022160     05  FILLER                   PIC X(2).
022170     05  WS-565-P1-FORCE-TO-INV   PIC X.
022180     05  FILLER                   PIC X(2).
022190     05  WS-565-P1-NACHA          PIC X(7).
022200     05  FILLER                   PIC X(58).
022210   03  WS-567-C1.
022220     05  FILLER                   PIC X(50)      VALUE
022230             '   KEY BC  PGM UPDATE  CH EXP  CHG BC  CH BR  RESE'.
022240     05  FILLER                   PIC X(50)      VALUE
022250             'T L UNITS RSTR-DFLT EMP/CNV PROD CT               '.
022260     05  FILLER                   PIC X(51)      VALUE SPACES.
022270   03  WS-567-D1.
022280     05  FILLER                   PIC X(50)      VALUE
022290             '  -------- --- ------  ------ -------- -----  ----'.
022300     05  FILLER                   PIC X(50)      VALUE
022310             '- ------- --------- ------- -------               '.
022320     05  FILLER                   PIC X(51)      VALUE SPACES.
022330   03  WS-567-P1                                 VALUE SPACE.
022340     05  FILLER                   PIC X(2).
022350     05  WS-567-P1-BC             PIC X(8).
022360     05  FILLER                   PIC X(2).
022370     05  WS-567-P1-PROG-ID        PIC X.
022380     05  FILLER                   PIC X(2).
022390     05  WS-567-P1-UPDATE-DATE    PIC X(6).
022400     05  FILLER                   PIC X(4).
022410     05  WS-567-P1-CHG-EXP-CODE   PIC X(2).
022420     05  FILLER                   PIC X(3).
022430     05  WS-567-P1-CHG-BC         PIC X(8).
022440     05  FILLER                   PIC X.
022450     05  WS-567-P1-CHG-PRI-BR     PIC X(5).
022460     05  FILLER                   PIC X(4).
022470     05  WS-567-P1-RESET-FLAG     PIC X.
022480     05  FILLER                   PIC X(3).
022490     05  WS-567-P1-L-MAX-WVE-UNIT PIC Z(7).
022500     05  FILLER                   PIC X(5).
022510     05  WS-567-P1-PROD-RESTR-DEF PIC X.
022520     05  FILLER                   PIC X(8).
022530     05  WS-567-P1-EMP-CNV-FLAG   PIC X.
022540     05  FILLER                   PIC X(6).
022550     05  WS-567-P1-PROD-RESTR-CT  PIC Z(2)9.
022560     05  FILLER                   PIC X(3).
022570     05  WS-567-P1-B-CARD-MSG     PIC X(51).
022580     05  FILLER                   PIC X(14).
022590   03  WS-996P-C1.
022600     05  FILLER                   PIC X(50)      VALUE
022610             '     BC     SEQ  TYPE   PRODUCT    CONV FLAG  PROG'.
022620     05  FILLER                   PIC X(50)      VALUE
022630             ' ID    DESCRIPTION                                '.
022640     05  FILLER                   PIC X(51)      VALUE SPACES.
022650   03  WS-996P-D1.
022660     05  FILLER                   PIC X(50)      VALUE
022670             '  --------  ---   --  ------------     -         -'.
022680     05  FILLER                   PIC X(50)      VALUE
022690             '    --------------------                          '.
022700     05  FILLER                   PIC X(51)      VALUE SPACES.
022710   03  WS-996P-P1                                VALUE SPACES.
022720     05  FILLER                   PIC X(2).
022730     05  WS-996P-P1-BC            PIC X(8).
022740     05  FILLER                   PIC X(2).
022750     05  WS-996P-P1-SEQ-NBR       PIC X(3).
022760     05  FILLER                   PIC X(3).
022770     05  WS-996P-P1-MATCH-TYPE    PIC X(2).
022780     05  FILLER                   PIC X(2).
022790     05  WS-996P-P1-MATCH-PROD    PIC X(12).
022800     05  FILLER                   PIC X(5).
022810     05  WS-996P-P1-CONVERS-FLG   PIC X.
022820     05  FILLER                   PIC X(9).
022830     05  WS-996P-P1-PROGRAM-ID    PIC X.
022840     05  FILLER                   PIC X(4).
022850     05  WS-996P-P1-DESCRIPTION   PIC X(20).
022860     05  FILLER                   PIC X(77).
022870   03  WS-233P-C1.
022880     05  FILLER                   PIC X(50)      VALUE
022890             '     BC      EXCEPTION EXPENSE CODES              '.
022900     05  FILLER                   PIC X(101)     VALUE SPACES.
022910   03  WS-233P-D1.
022920     05  FILLER                   PIC X(12)  VALUE '  --------  '.
022930     05  FILLER                   PIC X(60)      VALUE ALL ' --'.
022940     05  FILLER                   PIC X(79)      VALUE SPACES.
022950   03  WS-233P-P1                                VALUE SPACES.
022960     05  FILLER                   PIC X(2).
022970     05  WS-233P-P1-BC            PIC X(8).
022980     05  FILLER                   PIC X(2).
022990     05  WS-233P-P1-EXP-CODES.
023000       07  WS-233P-P1-EXP-CODE-ENT  OCCURS 20 TIMES.
023010         09  FILLER               PIC X.
023020         09  WS-233P-P1-EXP-CODE  PIC X(2).
023030     05  FILLER                   PIC X(79).
023040   03  WS-556-C1A.
023050     05  FILLER                   PIC X(50)      VALUE
023060             '    KEY    KEY   UPDT  SUMMARY   SUM  SM  LOW  HIG'.
023070     05  FILLER                   PIC X(50)      VALUE
023080             'H              P O                                '.
023090     05  FILLER                   PIC X(51)      VALUE SPACE.
023100   03  WS-556-C1B.
023110     05  FILLER                   PIC X(50)      VALUE
023120             '     BC    SEQ#  DATE     BC    BRCH  SI   BR   BR'.
023130     05  FILLER                   PIC X(50)      VALUE
023140             '   MED  NACHA  FLG PRODUCT CODE                   '.
023150     05  FILLER                   PIC X(51)      VALUE SPACE.
023160   03  WS-556-D1.
023170     05  FILLER                   PIC X(50)      VALUE
023180             '  -------- ---- ------ -------- ----- -- ----- ---'.
023190     05  FILLER                   PIC X(50)      VALUE
023200             '--  -  -------  -  -------------                  '.
023210     05  FILLER                   PIC X(51)      VALUE SPACE.
023220   03  WS-556-P1                                 VALUE SPACES.
023230     05  FILLER                   PIC X(2).
023240     05  WS-556-P1-KEY-BC         PIC X(8).
023250     05  FILLER                   PIC X.
023260     05  WS-556-P1-KEY-SEQ        PIC X(4).
023270     05  FILLER                   PIC X.
023280     05  WS-556-P1-UPDATE         PIC X(6).
023290     05  FILLER                   PIC X.
023300     05  WS-556-P1-SUM-BC         PIC X(8).
023310     05  FILLER                   PIC X.
023320     05  WS-556-P1-SUM-BR         PIC X(5).
023330     05  FILLER                   PIC X.
023340     05  WS-556-P1-SUM-SI         PIC X(2).
023350     05  FILLER                   PIC X.
023360     05  WS-556-P1-LOW-BR         PIC X(5).
023370     05  FILLER                   PIC X.
023380     05  WS-556-P1-HIGH-BR        PIC X(5).
023390     05  FILLER                   PIC X(2).
023400     05  WS-556-P1-MEDIUM         PIC X.
023410     05  FILLER                   PIC X(2).
023420     05  WS-556-P1-NACHA          PIC X(7).
023430     05  FILLER                   PIC X(2).
023440     05  WS-556-P1-PO-FLG         PIC X.
023450     05  FILLER                   PIC X(2).
023460     05  WS-556-P1-PRODUCT        PIC X(13).
023470     05  FILLER                   PIC X(69).
023480   03  WS-262P-C1.
023490     05  FILLER                   PIC X(50)      VALUE
023500             '     BC      BR1    BR2   TYPE   SEP INV   MAIL CO'.
023510     05  FILLER                   PIC X(50)      VALUE
023520             'DE   COMMENT                                      '.
023530     05  FILLER                   PIC X(51)      VALUE SPACES.
023540   03  WS-262P-D1.
023550     05  FILLER                   PIC X(50)      VALUE
023560             '  --------  -----  -----   --      --         ----'.
023570     05  FILLER                   PIC X(50)      VALUE
023580             '-    ---------------------------------------------'.
023590     05  FILLER                   PIC X(51)      VALUE
023600            '-------                                            '.
023610   03  WS-262P-P1                                VALUE SPACES.
023620     05  FILLER                   PIC X(2).
023630     05  WS-262P-P1-BC            PIC X(8).
023640     05  FILLER                   PIC X(2).
023650     05  WS-262P-P1-PRI-BR        PIC X(5).
023660     05  FILLER                   PIC X(2).
023670     05  WS-262P-P1-SEC-BR        PIC X(5).
023680     05  FILLER                   PIC X(3).
023690     05  WS-262P-P1-BILL-TYPE     PIC X(2).
023700     05  FILLER                   PIC X(6).
023710     05  WS-262P-P1-SEP-INV       PIC X(2).
023720     05  FILLER                   PIC X(9).
023730     05  WS-262P-P1-MAIL-CODE     PIC X(5).
023740     05  FILLER                   PIC X(5).
023750     05  WS-262P-P1-COMMENT       PIC X(52).
023760     05  FILLER                   PIC X(43).
023770   03  WS-285P-C1.
023780     05  FILLER                   PIC X(50)      VALUE
023790             '     BC      BR1    BR2   TYPE   SEP INV   PAYMENT'.
023800     05  FILLER                   PIC X(50)      VALUE
023810             ' DAYS                                             '.
023820     05  FILLER                   PIC X(51)      VALUE SPACES.
023830   03  WS-285P-D1.
023840     05  FILLER                   PIC X(50)      VALUE
023850             '  --------  -----  -----   --      --           --'.
023860     05  FILLER                   PIC X(101)     VALUE SPACES.
023870   03  WS-285P-P1                                VALUE SPACES.
023880     05  FILLER                   PIC X(2).
023890     05  WS-285P-P1-BC            PIC X(8).
023900     05  FILLER                   PIC X(2).
023910     05  WS-285P-P1-PRI-BR        PIC X(5).
023920     05  FILLER                   PIC X(2).
023930     05  WS-285P-P1-SEC-BR        PIC X(5).
023940     05  FILLER                   PIC X(3).
023950     05  WS-285P-P1-TYP-CD        PIC X(2).
023960     05  FILLER                   PIC X(6).
023970     05  WS-285P-P1-SEP-INV       PIC X(2).
023980     05  FILLER                   PIC X(11).
023990     05  WS-285P-P1-PYMT-DAYS     PIC X(2).
024000     05  FILLER                   PIC X(101).
024010   03  WS-769P-C1.
024020     05  FILLER                   PIC X(50)      VALUE
024030             '   GMC      BC      BR1    BR2   TC  IC   C  ADDRE'.
024040     05  FILLER                   PIC X(50)      VALUE
024050             'SS LINE 1 / CITY           ADDRESS LINE 2 / STATE '.
024060     05  FILLER                   PIC X(51)      VALUE
024070            '& ZIP      ADDRESS LINE 3 / BRANCH NAME            '.
024080   03  WS-769P-D1.
024090     05  FILLER                   PIC X(50)      VALUE
024100             '  -----  --------  -----  -----  --  --   -  -----'.
024110     05  FILLER                   PIC X(50)      VALUE
024120             '-------------------------  -----------------------'.
024130     05  FILLER                   PIC X(51)      VALUE
024140            '---------  -----------------------------------     '.
024150   03  WS-769P-P1                                VALUE SPACES.
024160     05  FILLER                   PIC X(2).
024170     05  WS-769P-P1-MAIL-CODE     PIC X(5).
024180     05  FILLER                   PIC X(2).
024190     05  WS-769P-P1-BC            PIC X(8).
024200     05  FILLER                   PIC X(2).
024210     05  WS-769P-P1-PRI-BR        PIC X(5).
024220     05  FILLER                   PIC X(2).
024230     05  WS-769P-P1-SEC-BR        PIC X(5).
024240     05  FILLER                   PIC X(2).
024250     05  WS-769P-P1-BILL-TYPE     PIC X(2).
024260     05  FILLER                   PIC X(2).
024270     05  WS-769P-P1-SEP-INV-CD    PIC X(2).
024280     05  FILLER                   PIC X(3).
024290     05  WS-769P-P1-CARD-CODE     PIC X.
024300     05  FILLER                   PIC X(2).
024310     05  WS-769P-P1-ADDR-LINE-1.
024320       07  WS-769P-P1-ADDR-CITY   PIC X(30).
024330     05  FILLER                   PIC X(2).
024340     05  WS-769P-P1-ADDR-LINE-2.
024350       07  WS-769P-P1-ADDR-STATE  PIC X(2).
024360       07  FILLER                 PIC X(2).
024370       07  WS-769P-P1-ADDR-ZIP-9  PIC X(5)BX(4).
024380       07  FILLER                 PIC X(2).
024390       07  WS-769P-P1-ADDR-ZIP-2  PIC X(2).
024400       07  FILLER                 PIC X(12).
024410     05  FILLER                   PIC X(4).
024420     05  WS-769P-P1-BRANCH-NAME.
024430       07  WS-769P-P1-ADDR-LINE-3 PIC X(30).
024440       07  WS-769P-P1-BR-NM-REST  PIC X(5).
024450     05  FILLER                   PIC X(7).
024460   03  WS-663P-C1.
024470     05  FILLER                   PIC X(50)      VALUE
024480             '  BC        BR1    BR2    TC  SI  MSG/TYP  SQ  MES'.
024490     05  FILLER                   PIC X(50)      VALUE
024500             'SAGE                                              '.
024510     05  FILLER                   PIC X(51)      VALUE  SPACE.
024520   03  WS-663P-D1.
024530     05  FILLER                   PIC X(50)      VALUE
024540             '  --------  -----  -----  --  --     -     --  ---'.
024550     05  FILLER                   PIC X(50)      VALUE
024560             '--------------------------------------------------'.
024570     05  FILLER                   PIC X(51)      VALUE
024580            '----------------------------------------------     '.
024590   03  WS-663P-P1                                VALUE SPACES.
024600     05  FILLER                   PIC X(2).
024610     05  WS-663P-P1-BC            PIC X(8).
024620     05  FILLER                   PIC X(2).
024630     05  WS-663P-P1-PRI-BR        PIC X(5).
024640     05  FILLER                   PIC X(2).
024650     05  WS-663P-P1-SEC-BR        PIC X(5).
024660     05  FILLER                   PIC X(2).
024670     05  WS-663P-P1-BILL-TYPE     PIC X(2).
024680     05  FILLER                   PIC X(2).
024690     05  WS-663P-P1-SEP-INV-CD    PIC X(2).
024700     05  FILLER                   PIC X(5).
024710     05  WS-663P-P1-MSG-TYP       PIC X.
024720     05  FILLER                   PIC X(5).
024730     05  WS-663P-P1-LINE-SEQ      PIC X(2).
024740     05  FILLER                   PIC X(2).
024750     05  WS-663P-P1-MESSAGE       PIC X(100).
024760     05  FILLER                   PIC X(5).
024770   03  WS-660P-C1.
024780     05  FILLER                   PIC X(50)      VALUE
024790             '     BC      BR1    BR2  TYPE  MED   PROD CODE    '.
024800     05  FILLER                   PIC X(50)      VALUE
024810             'SI  CR  ORD/PRT/OPT  XW  SEQ#                     '.
024820     05  FILLER                   PIC X(51)      VALUE SPACES.
024830   03  WS-660P-D1.
024840     05  FILLER                   PIC X(50)      VALUE
024850             '  --------  -----  -----  --    -  -------------  '.
024860     05  FILLER                   PIC X(50)      VALUE
024870             '--   -      -         -  ----                     '.
024880     05  FILLER                   PIC X(51)      VALUE SPACES.
024890   03  WS-660P-P1                                VALUE SPACES.
024900     05  FILLER                   PIC X(2).
024910     05  WS-660P-P1-BC            PIC X(8).
024920     05  FILLER                   PIC X(2).
024930     05  WS-660P-P1-M-PRI-BR      PIC X(5).
024940     05  FILLER                   PIC X(2).
024950     05  WS-660P-P1-M-SEC-BR      PIC X(5).
024960     05  FILLER                   PIC X(2).
024970     05  WS-660P-P1-M-BILL-TYPE   PIC X(2).
024980     05  FILLER                   PIC X(4).
024990     05  WS-660P-P1-M-BILL-MED    PIC X.
025000     05  FILLER                   PIC X(2).
025010     05  WS-660P-P1-M-PROD-CODE   PIC X(13).
025020     05  FILLER                   PIC X(2).
025030     05  WS-660P-P1-M-SEP-INV-CD  PIC X(2).
025040     05  FILLER                   PIC X(3).
025050     05  WS-660P-P1-M-CREDIT-FLG  PIC X.
025060     05  FILLER                   PIC X(6).
025070     05  WS-660P-P1-ORD-PRT-FLG   PIC X.
025080     05  FILLER                   PIC X(9).
025090     05  WS-660P-P1-XW-FLAG       PIC X.
025100     05  FILLER                   PIC X(2).
025110     05  WS-660P-P1-SEQ-NBR       PIC X(4).
025120     05  FILLER                   PIC X(72).
025130   03  WS-1961P-C1.
025140     05  FILLER                   PIC X(50)      VALUE
025150             '  BC       BR1   BR2   TC SI PR-OPT OR-OPT PR-FL O'.
025160     05  FILLER                   PIC X(50)      VALUE
025170             'R-FL SVC-FL E-FMT  ACCESS    EMAIL-ADDRESS        '.
025180     05  FILLER                   PIC X(51)      VALUE
025190            '                                        EM         '.
025200   03  WS-1961P-D1.
025210     05  FILLER                   PIC X(50)      VALUE
025220             '  -------- ----- ----- -- --   -      -      -    '.
025230     05  FILLER                   PIC X(50)      VALUE
025240             ' -      -    -     --------  ---------------------'.
025250     05  FILLER                   PIC X(51)      VALUE
025260            '--------------------------------------- -          '.
025270   03  WS-1961P-P1                                VALUE SPACES.
025280     05  FILLER                        PIC X(2).
025290     05  WS-I9161P-P1-BC               PIC X(8).
025300     05  FILLER                        PIC X(1).
025310     05  WS-1961P-P1-PRI-BR            PIC X(5).
025320     05  FILLER                        PIC X(1).
025330     05  WS-1961P-P1-SEC-BR            PIC X(5).
025340     05  FILLER                        PIC X(1).
025350     05  WS-1961P-P1-BILL-TYPE         PIC X(2).
025360     05  FILLER                        PIC X(1).
025370     05  WS-1961P-P1-SEP-INV-CD        PIC X(2).
025380     05  FILLER                        PIC X(3).
025390     05  WS-1961P-P1-PROD-DTL-FL       PIC X(1).
025400     05  FILLER                        PIC X(6).
025410     05  WS-1961P-P1-ORD-DTL-FL        PIC X(1).
025420     05  FILLER                        PIC X(6).
025430     05  WS-1961P-P1-PROD-PRT-FL       PIC X(1).
025440     05  FILLER                        PIC X(5).
025450     05  WS-1961P-P1-ORD-PRT-FL        PIC X(1).
025460     05  FILLER                        PIC X(6).
025470     05  WS-1961P-P1-SVC-FEE-FL        PIC X(1).
025480     05  FILLER                        PIC X(4).
025490     05  WS-1961P-P1-EMAIL-FMT         PIC X(1).
025500     05  FILLER                        PIC X(5).
025510     05  WS-1961P-P1-ACCESS-KEY        PIC X(8).
025520     05  FILLER                        PIC X(2).
025530     05  WS-1961P-P1-EMAIL-ADDR        PIC X(60).
025540     05  FILLER                        PIC X(1).
025550     05  WS-1961P-P1-ENCRYPTION-METH   PIC X(1).
025560     05  FILLER                        PIC X(7).
025570   03  WS-1041P-C1.
025580     05  FILLER                   PIC X(50)      VALUE
025590             'RESET CAP DATE/LIMIT                            PC'.
025600     05  FILLER                   PIC X(44)      VALUE
025610             '  BILDTE   NSTDTE   NENDDTE   NEWLIMIT   NLT'.
025620     05  FILLER                   PIC X(57)      VALUE SPACES.
025630   03  WS-1041P-D1.
025640     05  FILLER                   PIC X(50)      VALUE
025650             '---------------------------------------------   - '.
025660     05  FILLER                   PIC X(44)      VALUE
025670             '  ------   ------   ------    -------    -  '.
025680     05  FILLER                   PIC X(57)      VALUE SPACES.
025690   03  WS-1041P-P1                               VALUE SPACES.
025700     05  WS-1041P-P1-979-INST-SEQ PIC X(45).
025710     05  FILLER                   PIC X(3).
025720     05  WS-1041P-P1-979-PGM-CODE PIC X.
025730     05  FILLER                   PIC X(3).
025740     05  WS-1041P-P1-BILLING-DATE PIC X(6).
025750     05  FILLER                   PIC X(3).
025760     05  WS-1041P-P1-NEWSTRT-DATE PIC X(6).
025770     05  FILLER                   PIC X(3).
025780     05  WS-1041P-P1-NEWEND-DATE  PIC X(6).
025790     05  FILLER                   PIC X(4).
025800     05  WS-1041P-P1-NEW-LIMIT    PIC X(7).
025810     05  FILLER                   PIC X(4).
025820     05  WS-1041P-P1-NEWLMT-TYPE  PIC X.
025830     05  FILLER                   PIC X(57).
025840   03  WS-1122P-C1.
025850     05  FILLER                   PIC X(50)      VALUE
025860             '     BC       BR1     BR2   TYPE   SEP INV        '.
025870     05  FILLER                   PIC X(50)      VALUE SPACES.
025880     05  FILLER                   PIC X(51)      VALUE SPACES.
025890   03  WS-1122P-D1.
025900     05  FILLER                   PIC X(50)      VALUE
025910             '  --------   -----   -----   --       --          '.
025920     05  FILLER                   PIC X(101)     VALUE SPACES.
025930   03  WS-1122P-P1                               VALUE SPACES.
025940     05  FILLER                   PIC X(2).
025950     05  WS-1122P-P1-BC           PIC X(8).
025960     05  FILLER                   PIC X(3).
025970     05  WS-1122P-P1-PRI-BR       PIC X(5).
025980     05  FILLER                   PIC X(3).
025990     05  WS-1122P-P1-SEC-BR       PIC X(5).
026000     05  FILLER                   PIC X(3).
026010     05  WS-1122P-P1-BILL-TYPE    PIC X(2).
026020     05  FILLER                   PIC X(7).
026030     05  WS-1122P-P1-SEP-INV-CD   PIC X(2).
026040     05  FILLER                   PIC X(9).
026050     05  FILLER                   PIC X.
026060     05  FILLER                   PIC X(101).
026070   03  WS-575-C1.
026080     05  FILLER                   PIC X(50)      VALUE
026090             '   NACHA   BR1   BR2  TC T #  C TT MERGE-INFO   RP'.
026100     05  FILLER                   PIC X(50)      VALUE
026110             'T  Z PR  DEST ID   ORIGIN ID  D T M F   DESTINATIO'.
026120     05  FILLER                   PIC X(51)      VALUE
026130            'N NAME        ORIGIN NAME            REF CD  E P   '.
026140   03  WS-575-D1.
026150     05  FILLER                   PIC X(50)      VALUE
026160             '  ------- ----- ----- -- - -  - -- -- -------- - -'.
026170     05  FILLER                   PIC X(50)      VALUE
026180             ' - - -- ---------- ---------- - - - - ------------'.
026190     05  FILLER                   PIC X(51)      VALUE
026200            '----------- ----------------------- -------- - -   '.
026210   03  WS-575-P1                                 VALUE SPACES.
026220     05  FILLER                   PIC X(2).
026230     05  WS-575-P1-NACHA-CODE     PIC X(7).
026240     05  FILLER                   PIC X.
026250     05  WS-575-P1-PRI-BR         PIC X(5).
026260     05  FILLER                   PIC X.
026270     05  WS-575-P1-SEC-BR         PIC X(5).
026280     05  FILLER                   PIC X.
026290     05  WS-575-P1-BILLING-TYPE   PIC X(2).
026300     05  FILLER                   PIC X.
026310     05  WS-575-P1-RECORD-TYPE    PIC X.
026320     05  FILLER                   PIC X.
026330     05  WS-575-P1-RECORD-NUMBER  PIC X.
026340     05  FILLER                   PIC X(2).
026350     05  WS-575-P1-RUN-CODE       PIC X.
026360     05  FILLER                   PIC X.
026370     05  WS-575-P1-TAPE-TYPE      PIC X(2).
026380     05  FILLER                   PIC X.
026390     05  WS-575-P1-MERGE-REGION   PIC X(2).
026400     05  FILLER                   PIC X.
026410     05  WS-575-P1-MERGE-NUMBER   PIC X(8).
026420     05  FILLER                   PIC X.
026430     05  WS-575-P1-RPT-DETAIL-OPT PIC X.
026440     05  FILLER                   PIC X.
026450     05  WS-575-P1-RPT-SUBTOT-OPT PIC X.
026460     05  FILLER                   PIC X.
026470     05  WS-575-P1-DUP-RPT-OPT    PIC X.
026480     05  FILLER                   PIC X.
026490     05  WS-575-P1-ZERO-AMT-OPT   PIC X.
026500     05  FILLER                   PIC X.
026510     05  WS-575-P1-PRIORITY-CD    PIC X(2).
026520     05  FILLER                   PIC X.
026530     05  WS-575-P1-DEST-ID        PIC X(10).
026540     05  FILLER                   PIC X.
026550     05  WS-575-P1-ORIGIN-ID      PIC X(10).
026560     05  FILLER                   PIC X.
026570     05  WS-575-P1-TRANS-DATE-OPT PIC X.
026580     05  FILLER                   PIC X.
026590     05  WS-575-P1-TRANS-TIME-OPT PIC X.
026600     05  FILLER                   PIC X.
026610     05  WS-575-P1-FILE-ID-MOD    PIC X.
026620     05  FILLER                   PIC X.
026630     05  WS-575-P1-FORMAT-CODE    PIC X.
026640     05  FILLER                   PIC X.
026650     05  WS-575-P1-DEST-NAME      PIC X(23).
026660     05  FILLER                   PIC X.
026670     05  WS-575-P1-ORIGIN-NAME    PIC X(23).
026680     05  FILLER                   PIC X.
026690     05  WS-575-P1-REF-CODE       PIC X(8).
026700     05  FILLER                   PIC X.
026710     05  WS-575-P1-SPL-EFF-DT-OPT PIC X.
026720     05  FILLER                   PIC X.
026730     05  WS-575-P1-PADDING-FALG   PIC X.
026740     05  FILLER                   PIC X(3).
026750   03  WS-575-C2.
026760     05  FILLER                   PIC X(50)      VALUE
026770             '   NACHA   BR1   BR2  TC T #  COMMENT             '.
026780     05  FILLER                   PIC X(101)     VALUE SPACES.
026790   03  WS-575-D2.
026800     05  FILLER                   PIC X(30)      VALUE
026810             '  ------- ----- ----- -- - -  '.
026820     05  FILLER                   PIC X(114)     VALUE ALL '-'.
026830     05  FILLER                   PIC X(7)       VALUE SPACES.
026840   03  WS-575-P2                                 VALUE SPACES.
026850     05  FILLER                   PIC X(2).
026860     05  WS-575-P2-NACHA-CODE     PIC X(7).
026870     05  FILLER                   PIC X.
026880     05  WS-575-P2-PRI-BR         PIC X(5).
026890     05  FILLER                   PIC X.
026900     05  WS-575-P2-SEC-BR         PIC X(5).
026910     05  FILLER                   PIC X.
026920     05  WS-575-P2-BILLING-TYPE   PIC X(2).
026930     05  FILLER                   PIC X.
026940     05  WS-575-P2-RECORD-TYPE    PIC X.
026950     05  FILLER                   PIC X.
026960     05  WS-575-P2-RECORD-NUMBER  PIC X.
026970     05  FILLER                   PIC X(2).
026980     05  WS-575-P2-COMMENT        PIC X(114).
026990     05  FILLER                   PIC X(7).
027000   03  WS-575-C3.
027010     05  FILLER                   PIC X(50)      VALUE
027020             '   NACHA   BR1   BR2  TC T #  MAILING LABEL LINE 1'.
027030     05  FILLER                   PIC X(50)      VALUE
027040             ' OR 4          MAILING LABEL LINE 2 OR 5          '.
027050     05  FILLER                   PIC X(51)      VALUE
027060            'MAILING LABEL LINE 3 OR 6                          '.
027070   03  WS-575-D3.
027080     05  FILLER                   PIC X(50)      VALUE
027090             '  ------- ----- ----- -- - -  --------------------'.
027100     05  FILLER                   PIC X(50)      VALUE
027110             '-------------- ---------------------------------- '.
027120     05  FILLER                   PIC X(51)      VALUE
027130            '----------------------------------                 '.
027140   03  WS-575-P3                                 VALUE SPACES.
027150     05  FILLER                   PIC X(2).
027160     05  WS-575-P3-NACHA-CODE     PIC X(7).
027170     05  FILLER                   PIC X.
027180     05  WS-575-P3-PRI-BR         PIC X(5).
027190     05  FILLER                   PIC X.
027200     05  WS-575-P3-SEC-BR         PIC X(5).
027210     05  FILLER                   PIC X.
027220     05  WS-575-P3-BILLING-TYPE   PIC X(2).
027230     05  FILLER                   PIC X.
027240     05  WS-575-P3-RECORD-TYPE    PIC X.
027250     05  FILLER                   PIC X.
027260     05  WS-575-P3-RECORD-NUMBER  PIC X.
027270     05  FILLER                   PIC X(2).
027280     05  WS-575-P3-MAIL-LN-1-4    PIC X(34).
027290     05  FILLER                   PIC X.
027300     05  WS-575-P3-MAIL-LN-2-5    PIC X(34).
027310     05  FILLER                   PIC X.
027320     05  WS-575-P3-MAIL-LN-3-6    PIC X(34).
027330     05  FILLER                   PIC X(17).
027340   03  WS-575-C4A.
027350     05  FILLER                   PIC X(50)      VALUE
027360             '                              P   BIL-TCS  PRE-TCS'.
027370     05  FILLER                   PIC X(50)      VALUE
027380             '   FORCED   OPTNS                 N               '.
027390     05  FILLER                   PIC X(51)      VALUE
027400            '         D    AC ADD $0  SAV RSL EXP TC  BC        '.
027410   03  WS-575-C4B.
027420     05  FILLER                   PIC X(50)      VALUE
027430             '   NACHA   BR1   BR2  TC T #  C A DR CR $0 DR CR $'.
027440     05  FILLER                   PIC X(50)      VALUE
027450             '0    BC     A S I   IND ID DATA   O  INDIVIDUAL NA'.
027460     05  FILLER                   PIC X(51)      VALUE
027470            'ME DATA  O DD CN OPT DTL TC  SUM SUM OVR OVR       '.
027480   03  WS-575-D4.
027490     05  FILLER                   PIC X(50)      VALUE
027500             '  ------- ----- ----- -- - -  - - -- -- -- -- -- -'.
027510     05  FILLER                   PIC X(50)      VALUE
027520             '- --------- - - - --------------- - --------------'.
027530     05  FILLER                   PIC X(51)      VALUE
027540            '-------- - -- --  -   -   -   -   -   -   -        '.
027550   03  WS-575-P4                                 VALUE SPACES.
027560     05  FILLER                   PIC X(2).
027570     05  WS-575-P4-NACHA-CODE     PIC X(7).
027580     05  FILLER                   PIC X.
027590     05  WS-575-P4-PRI-BR         PIC X(5).
027600     05  FILLER                   PIC X.
027610     05  WS-575-P4-SEC-BR         PIC X(5).
027620     05  FILLER                   PIC X.
027630     05  WS-575-P4-BILLING-TYPE   PIC X(2).
027640     05  FILLER                   PIC X.
027650     05  WS-575-P4-RECORD-TYPE    PIC X.
027660     05  FILLER                   PIC X.
027670     05  WS-575-P4-RECORD-NUMBER  PIC X.
027680     05  FILLER                   PIC X(2).
027690     05  WS-575-P4-PROD-CD-OPT    PIC X.
027700     05  FILLER                   PIC X.
027710     05  WS-575-P4-PROC-AMT-OPT   PIC X.
027720     05  FILLER                   PIC X.
027730     05  WS-575-P4-BILL-DR-TC     PIC X(2).
027740     05  FILLER                   PIC X.
027750     05  WS-575-P4-BILL-CR-TC     PIC X(2).
027760     05  FILLER                   PIC X.
027770     05  WS-575-P4-BILL-0-TC      PIC X(2).
027780     05  FILLER                   PIC X.
027790     05  WS-575-P4-PRE-N-DR-TC    PIC X(2).
027800     05  FILLER                   PIC X.
027810     05  WS-575-P4-PRE-N-CR-TC    PIC X(2).
027820     05  FILLER                   PIC X.
027830     05  WS-575-P4-PRE-N-0-TC     PIC X(2).
027840     05  FILLER                   PIC X.
027850     05  WS-575-P4-FORCED-BC      PIC X(9).
027860     05  FILLER                   PIC X.
027870     05  WS-575-P4-ACCT-OPT       PIC X.
027880     05  FILLER                   PIC X.
027890     05  WS-575-P4-SPL-REC-DEF    PIC X.
027900     05  FILLER                   PIC X.
027910     05  WS-575-P4-IND-ID-OPT     PIC X.
027920     05  FILLER                   PIC X.
027930     05  WS-575-P4-IND-ID-DATA    PIC X(15).
027940     05  FILLER                   PIC X.
027950     05  WS-575-P4-IND-NAME-OPT   PIC X.
027960     05  FILLER                   PIC X.
027970     05  WS-575-P4-IND-NAME-DATA  PIC X(22).
027980     05  FILLER                   PIC X.
027990     05  WS-575-P4-DSCR-DATA-OPT  PIC X.
028000     05  FILLER                   PIC X.
028010     05  WS-575-P4-DSCR-DATA      PIC X(2).
028020     05  FILLER                   PIC X.
028030     05  WS-575-P4-ACCT-CONSTANT  PIC X(2).
028040     05  FILLER                   PIC X(2).
028050     05  WS-575-P4-ADDENDA-OPT    PIC X.
028060     05  FILLER                   PIC X(3).
028070     05  WS-575-P4-ZERO-DTL-OPT   PIC X.
028080     05  FILLER                   PIC X(3).
028090     05  WS-575-P4-SAV-TC-OPT     PIC X.
028100     05  FILLER                   PIC X(3).
028110     05  WS-575-P4-RSL-SUM-OPT    PIC X.
028120     05  FILLER                   PIC X(3).
028130     05  WS-575-P4-EXP-SUM-OPT    PIC X.
028140     05  FILLER                   PIC X(3).
028150     05  WS-575-P4-TC-OVR-SCOPE   PIC X.
028160     05  FILLER                   PIC X(3).
028170     05  WS-575-P4-BC-OVR-SCOPE   PIC X.
028180     05  FILLER                   PIC X(8).
028190   03  WS-575-C5A.
028200     05  FILLER                   PIC X(50)      VALUE
028210             '                              B                 SV'.
028220     05  FILLER                   PIC X(50)      VALUE
028230             'C                                        COMPANY  '.
028240     05  FILLER                   PIC X(51)      VALUE
028250            ' ENT   ENTRY    D E O   ORIG    BATCH  G S         '.
028260   03  WS-575-C5B.
028270     05  FILLER                   PIC X(50)      VALUE
028280             '   NACHA   BR1   BR2  TC T # PRT  BATCH NAME    CL'.
028290     05  FILLER                   PIC X(50)      VALUE
028300             'S   COMPANY NAME     CO DISCRET DATA        ID    '.
028310     05  FILLER                   PIC X(51)      VALUE
028320            ' CLS   DESCR    D D S  DFI ID   CONST  L T         '.
028330   03  WS-575-D5.
028340     05  FILLER                   PIC X(50)      VALUE
028350             '  ------- ----- ----- -- - -  - --------------- --'.
028360     05  FILLER                   PIC X(50)      VALUE
028370             '- ---------------- -------------------- ----------'.
028380     05  FILLER                   PIC X(51)      VALUE
028390            ' --- ---------- - - - -------- ------- - -         '.
028400   03  WS-575-P5                                 VALUE SPACES.
028410     05  FILLER                   PIC X(2).
028420     05  WS-575-P5-NACHA-CODE     PIC X(7).
028430     05  FILLER                   PIC X.
028440     05  WS-575-P5-PRI-BR         PIC X(5).
028450     05  FILLER                   PIC X.
028460     05  WS-575-P5-SEC-BR         PIC X(5).
028470     05  FILLER                   PIC X.
028480     05  WS-575-P5-BILLING-TYPE   PIC X(2).
028490     05  FILLER                   PIC X.
028500     05  WS-575-P5-RECORD-TYPE    PIC X.
028510     05  FILLER                   PIC X.
028520     05  WS-575-P5-RECORD-NUMBER  PIC X.
028530     05  FILLER                   PIC X(2).
028540     05  WS-575-P5-BATCH-PRT-OPT  PIC X.
028550     05  FILLER                   PIC X.
028560     05  WS-575-P5-BATCH-NAME     PIC X(15).
028570     05  FILLER                   PIC X.
028580     05  WS-575-P5-SERVICE-CLASS  PIC X(3).
028590     05  FILLER                   PIC X.
028600     05  WS-575-P5-COMPANY-NAME   PIC X(16).
028610     05  FILLER                   PIC X.
028620     05  WS-575-P5-CO-DSCR-DATA   PIC X(20).
028630     05  FILLER                   PIC X.
028640     05  WS-575-P5-COMPANY-ID     PIC X(10).
028650     05  FILLER                   PIC X.
028660     05  WS-575-P5-STD-ENT-CLASS  PIC X(3).
028670     05  FILLER                   PIC X.
028680     05  WS-575-P5-ENTRY-DESCR    PIC X(10).
028690     05  FILLER                   PIC X.
028700     05  WS-575-P5-DESCR-DT-OPT   PIC X.
028710     05  FILLER                   PIC X.
028720     05  WS-575-P5-EFF-DT-OPT     PIC X.
028730     05  FILLER                   PIC X.
028740     05  WS-575-P5-ORIG-ST-CD     PIC X.
028750     05  FILLER                   PIC X.
028760     05  WS-575-P5-ORIG-DFI-ID    PIC X(8).
028770     05  FILLER                   PIC X.
028780     05  WS-575-P5-BATCH-NBR-CNS  PIC X(7).
028790     05  FILLER                   PIC X.
028800     05  WS-575-P5-GL-BTCH-OPT    PIC X.
028810     05  FILLER                   PIC X.
028820     05  WS-575-P5-SPL-TRLR-OPT   PIC X.
028830     05  FILLER                   PIC X(9).
028840   03  WS-575-C5X.
028850     05  FILLER                   PIC X(111)     VALUE SPACES.
028860     05  FILLER                   PIC X(40)      VALUE
028870                       'TR BC OVERRIDE  TR SEQ OPT  TR SEQ CONS '.
028880   03  WS-575-D5X.
028890     05  FILLER                   PIC X(111)     VALUE SPACES.
028900     05  FILLER                   PIC X(40)      VALUE
028910                       '   --------         -         -------   '.
028920   03  WS-575-P5X                                VALUE SPACES.
028930     05  FILLER                   PIC X(114).
028940     05  WS-575-P5-TRACE-BC-OVER  PIC X(8).
028950     05  FILLER                   PIC X(9).
028960     05  WS-575-P5-TRACE-SEQ-OPT  PIC X.
028970     05  FILLER                   PIC X(9).
028980     05  WS-575-P5-TRACE-SEQ-CNS  PIC X(7).
028990     05  FILLER                   PIC X(3).
029000   03  WS-575-C6A.
029010     05  FILLER                   PIC X(50)      VALUE
029020             '                              NRML-TCS PRE-TCS   9'.
029030     05  FILLER                   PIC X(50)      VALUE
029040             ' DIGIT   ACCOUNT NUMBER  AMT                      '.
029050     05  FILLER                   PIC X(51)      VALUE
029060            '                DSCR  DEFER  DIR  EA  CK D         '.
029070   03  WS-575-C6B.
029080     05  FILLER                   PIC X(50)      VALUE
029090             '   NACHA   BR1   BR2  TC T #  DR CR $0 DR CR $0   '.
029100     05  FILLER                   PIC X(50)      VALUE
029110             ' BC      / (FORMAT WTS)  OPT  IND ID DATA       IN'.
029120     05  FILLER                   PIC X(51)      VALUE
029130            'D NAME DATA     DATA   FLG   DEP  BR  FMLA         '.
029140   03  WS-575-D6.
029150     05  FILLER                   PIC X(50)      VALUE
029160             '  ------- ----- ----- -- - -  -- -- -- -- -- -- --'.
029170     05  FILLER                   PIC X(50)      VALUE
029180             '------- ----------------- - --------------- ------'.
029190     05  FILLER                   PIC X(51)      VALUE
029200            '---------------- --     -     -    -  ----         '.
029210   03  WS-575-P6                                 VALUE SPACES.
029220     05  FILLER                   PIC X(2).
029230     05  WS-575-P6-NACHA-CODE     PIC X(7).
029240     05  FILLER                   PIC X.
029250     05  WS-575-P6-PRI-BR         PIC X(5).
029260     05  FILLER                   PIC X.
029270     05  WS-575-P6-SEC-BR         PIC X(5).
029280     05  FILLER                   PIC X.
029290     05  WS-575-P6-BILLING-TYPE   PIC X(2).
029300     05  FILLER                   PIC X.
029310     05  WS-575-P6-RECORD-TYPE    PIC X.
029320     05  FILLER                   PIC X.
029330     05  WS-575-P6-RECORD-NUMBER  PIC X.
029340     05  FILLER                   PIC X(2).
029350     05  WS-575-P6-NORM-DR-TC     PIC X(2).
029360     05  FILLER                   PIC X.
029370     05  WS-575-P6-NORM-CR-TC     PIC X(2).
029380     05  FILLER                   PIC X.
029390     05  WS-575-P6-NORM-0-TC      PIC X(2).
029400     05  FILLER                   PIC X.
029410     05  WS-575-P6-PRE-N-DR-TC    PIC X(2).
029420     05  FILLER                   PIC X.
029430     05  WS-575-P6-PRE-N-CR-TC    PIC X(2).
029440     05  FILLER                   PIC X.
029450     05  WS-575-P6-PRE-N-0-TC     PIC X(2).
029460     05  FILLER                   PIC X.
029470     05  WS-575-P6-BC             PIC X(9).
029480     05  FILLER                   PIC X.
029490     05  WS-575-P6-ACCT-NBR       PIC X(17).
029500     05  FILLER                   PIC X.
029510     05  WS-575-P6-AMT-OPT        PIC X.
029520     05  FILLER                   PIC X.
029530     05  WS-575-P6-IND-ID-DATA    PIC X(15).
029540     05  FILLER                   PIC X.
029550     05  WS-575-P6-IND-NAME-DATA  PIC X(22).
029560     05  FILLER                   PIC X.
029570     05  WS-575-P6-DSCR-DATA      PIC X(2).
029580     05  FILLER                   PIC X(5).
029590     05  WS-575-P6-DEFER-FLG      PIC X.
029600     05  FILLER                   PIC X(5).
029610     05  WS-575-P6-DIR-DEP-FLG    PIC X.
029620     05  FILLER                   PIC X(4).
029630     05  WS-575-P6-EACH-BR-FLG    PIC X.
029640     05  FILLER                   PIC X(2).
029650     05  WS-575-P6-ACCT-CALC-FMLA PIC X(4).
029660     05  FILLER                   PIC X(9).
029670   03  WS-8950-C1.
029680     05  FILLER                   PIC X(50)      VALUE
029690             '    ----- 8949 KEY ------  ------- USAGE FLAGS ---'.
029700     05  FILLER                   PIC X(50)      VALUE
029710             '----     MATCH        MATCH        MATCH          '.
029720     05  FILLER                   PIC X(51)      VALUE
029730            '                                 ---- UPDATED ---- '.
029740   03  WS-8950-C2.
029750     05  FILLER                   PIC X(50)      VALUE
029760             '     HC      BC    T  SEQ  UPC RBT TAX BRP WVE EXP'.
029770     05  FILLER                   PIC X(50)      VALUE
029780             ' RTL  BRCH RANGES    PRODUCTS      NACHA   INSTRUC'.
029790     05  FILLER                   PIC X(51)      VALUE
029800            'TIONS                              DATE     ID     '.
029810   03  WS-8950-D1.
029820     05  FILLER                   PIC X(50)      VALUE
029830             '    ----- -------- - ----   -   -   -   -   -   - '.
029840     05  FILLER                   PIC X(50)      VALUE
029850             '  -   -----------  -------------  -------  -------'.
029860     05  FILLER                   PIC X(51)      VALUE
029870            '-------------------------------  -------- -------- '.
029880   03  WS-8950-P1                                VALUE SPACES.
029890     05  FILLER                   PIC X(4).
029900     05  WS-8950-P1-HC            PIC X(5).
029910     05  FILLER                   PIC X.
029920     05  WS-8950-P1-BC            PIC X(8).
029930     05  FILLER                   PIC X.
029940     05  WS-8950-P1-T             PIC X.
029950     05  FILLER                   PIC X.
029960     05  WS-8950-P1-SEQ           PIC X(4).
029970     05  FILLER                   PIC X(3).
029980     05  WS-8950-P1-UPC           PIC X.
029990     05  FILLER                   PIC X(3).
030000     05  WS-8950-P1-RBT           PIC X.
030010     05  FILLER                   PIC X(3).
030020     05  WS-8950-P1-TAX           PIC X.
030030     05  FILLER                   PIC X(3).
030040     05  WS-8950-P1-BRP           PIC X.
030050     05  FILLER                   PIC X(3).
030060     05  WS-8950-P1-WVE           PIC X.
030070     05  FILLER                   PIC X(3).
030080     05  WS-8950-P1-EXP           PIC X.
030090     05  FILLER                   PIC X(3).
030100     05  WS-8950-P1-RTL           PIC X.
030110     05  FILLER                   PIC X(3).
030120     05  WS-8950-P1-M-LOW-BRANCH  PIC X(5).
030130     05  WS-BRANCH-FILLER         PIC X.
030140     05  WS-8950-P1-M-HIGH-BRANCH PIC X(5).
030150     05  FILLER                   PIC X(2).
030160     05  WS-8950-P1-M-PRODUCT     PIC X(13).
030170     05  FILLER                   PIC X(2).
030180     05  WS-8950-P1-M-NACHA       PIC X(7).
030190     05  FILLER                   PIC X(2).
030200     05  WS-8950-P1-INSTRUCTIONS  PIC X(38).
030210     05  FILLER                   PIC X(2).
030220     05  WS-8950-P1-U-DATE        PIC X(8).
030230     05  FILLER                   PIC X.
030240     05  WS-8950-P1-U-USER-ID     PIC X(8).
030250   03 WS-1-8950-INSTRUCTIONS.
030260     05  WS-1-I-ACCOUNT-NUMBER.
030270       07  WS-1-C-ACCOUNT-NUMBER  PIC X(21)
030280             VALUE 'ASSIGN ACCOUNT NBR:  '.
030290       07  WS-1-D-ACCOUNT-NUMBER  PIC X(17).
030300     05  WS-1-I-ACCOUNT-TYPE.
030310       07  WS-1-C-ACCOUNT-TYPE    PIC X(15)
030320             VALUE 'ACCOUNT TYPE:  '.
030330       07  WS-1-D-ACCOUNT-TYPE    PIC X.
030340       07  FILLER                 PIC X(12) VALUE SPACES.
030350     05  WS-1-I-BC.
030360       07  WS-1-C-BC              PIC X(12)
030370             VALUE 'ASSIGN BC:  '.
030380       07  WS-1-D-BC              PIC X(8).
030390       07  FILLER                 PIC X(18) VALUE SPACES.
030400   03 WS-2-8950-INSTRUCTIONS.
030410     05  WS-2-I-WVE-EXP-NAME.
030420       07  WS-2-C-WVE-EXP-NAME    PIC X(29)
030430             VALUE 'WAIVED/EXPENSE NAME OPTION:  '.
030440       07  WS-2-D-WVE-EXP-NAME    PIC X.
030450       07  FILLER                 PIC X(8) VALUE SPACES.
030460     05  WS-2-I-CREDITS-NAME.
030470       07  WS-2-C-CREDITS-NAME    PIC X(22)
030480             VALUE 'CREDITS NAME OPTION:  '.
030490       07  WS-2-D-CREDITS-NAME    PIC X.
030500       07  FILLER                 PIC X(15) VALUE SPACES.
030510     05  WS-2-I-UPCHARGE-NAME.
030520       07  WS-2-C-UPCHARGE-NAME   PIC X(23)
030530             VALUE 'UPCHARGE NAME OPTION:  '.
030540       07  WS-2-D-UPCHARGE-NAME   PIC X.
030550       07  FILLER                 PIC X(14) VALUE SPACES.
030560     05  WS-2-I-TAX-NAME.
030570       07  WS-2-C-TAX-NAME        PIC X(18)
030580             VALUE 'TAX NAME OPTION:  '.
030590       07  WS-2-D-TAX-NAME        PIC X.
030600       07  FILLER                 PIC X(19) VALUE SPACES.
030610   03 WS-3-8950-INSTRUCTIONS.
030620     05  WS-3-I-COMPANY-NAME.
030630       07  WS-3-C-COMPANY-NAME    PIC X(15)
030640             VALUE 'COMPANY NAME:  '.
030650       07  WS-3-D-COMPANY-NAME    PIC X(16).
030660       07  FILLER                 PIC X(7) VALUE SPACES.
030670     05  WS-3-I-DISCRET-DATA.
030680       07  WS-3-C-DISCRET-DATA    PIC X(16)
030690             VALUE 'DISCRET. DATA:  '.
030700       07  WS-3-D-DISCRET-DATA    PIC X(20).
030710       07  FILLER                 PIC X(2) VALUE SPACES.
030720     05  WS-3-I-GL-STD-ENT-CCD-FLAG.
030730       07  WS-3-C-GL-STD-ENT-CCD-FLAG PIC X(30)
030740             VALUE 'GL STD ENTRY CLASS CCD FLAG:  '.
030750       07  WS-3-D-GL-STD-ENT-CCD-FLAG PIC X.
030760       07  FILLER                 PIC X(7) VALUE SPACES.
030770     05  WS-3-I-ENTRY-DESCRIPTION.
030780       07  WS-3-C-ENTRY-DESCRIPTION PIC X(20)
030790             VALUE 'ENTRY DESCRIPTION:  '.
030800       07  WS-3-D-ENTRY-DESCRIPTION PIC X(10).
030810       07  FILLER                 PIC X(8) VALUE SPACES.
030820   03 WS-4-8950-INSTRUCTIONS.
030830     05  WS-4-I-WVE-CHARGE-SUM-INSTR.
030840       07  WS-4-C-WVE-CHARGE-SUM-INSTR PIC X(36)
030850             VALUE 'WAIVED CHARGE SUMMARY INSTRUCTION:  '.
030860       07  WS-4-D-WVE-CHARGE-SUM-INSTR PIC X.
030870       07  FILLER                 PIC X VALUE SPACES.
030880     05  WS-4-I-EXP-CHARGE-SUM-INSTR.
030890       07  WS-4-C-EXP-CHARGE-SUM-INSTR PIC X(37)
030900             VALUE 'EXPENSE CHARGE SUMMARY INSTRUCTION:  '.
030910       07  WS-4-D-EXP-CHARGE-SUM-INSTR PIC X.
030920     05  WS-4-I-RETAIL-CRED-SUM-INSTR.
030930       07  WS-4-C-RETAIL-CRED-SUM-INSTR PIC X(36)
030940             VALUE 'RETAIL CREDIT SUMMARY INSTRUCTION:  '.
030950       07  WS-4-D-RETAIL-CRED-SUM-INSTR PIC X.
030960       07  FILLER                 PIC X VALUE SPACES.
030970     05  WS-4-I-WVE-CREDIT-SUM-INSTR.
030980       07  WS-4-C-WVE-CREDIT-SUM-INSTR PIC X(36)
030990             VALUE 'WAIVED CREDIT SUMMARY INSTRUCTION:  '.
031000       07  WS-4-D-WVE-CREDIT-SUM-INSTR PIC X.
031010       07  FILLER                 PIC X VALUE SPACES.
031020     05  WS-4-I-EXP-CREDIT-SUM-INSTR.
031030       07  WS-4-C-EXP-CREDIT-SUM-INSTR PIC X(37)
031040             VALUE 'EXPENSE CREDIT SUMMARY INSTRUCTION:  '.
031050       07  WS-4-D-EXP-CREDIT-SUM-INSTR PIC X.
031060   03 WS-5-8950-INSTRUCTIONS.
031070     05  WS-5-I-RETAIL-BC-OVERRIDE.
031080       07  WS-5-C-RETAIL-BC-OVERRIDE PIC X(21)
031090             VALUE 'RETAIL BC OVERRIDE:  '.
031100       07  WS-5-D-RETAIL-BC-OVERRIDE PIC X(8).
031110       07  FILLER                 PIC X(9) VALUE SPACES.
031120   03 WS-6-8950-INSTRUCTIONS.
031130     05  WS-6-I-RETAIL-SAVINGS-PRODS.
031140       07  WS-6-C-RETAIL-SAVINGS-PRODS PIC X(33)
031150             VALUE 'RETAIL SAVINGS PRODUCTS OPTION:  '.
031160       07  WS-6-D-RETAIL-SAVINGS-PRODS PIC X.
031170       07  FILLER                 PIC X(4) VALUE SPACES.
031180   03  WS-751P-C1.
031190     05  FILLER                   PIC X(50)      VALUE
031200             '     BC/BR/BR/TYPE     C  INS  EXP PROD CD    EXP '.
031210     05  FILLER                   PIC X(50)      VALUE
031220             'PROD DESCRIPT   EXP BR/BR/TC C  CR PROD CD     CR '.
031230     05  FILLER                   PIC X(51)      VALUE
031240            'PROD DESCRIPT    C  EXP BC   CR BR/BR/TC           '.
031250   03  WS-751P-D1.
031260     05  FILLER                   PIC X(50)      VALUE
031270             '  -------------------- -  --  ------------- ------'.
031280     05  FILLER                   PIC X(50)      VALUE
031290             '--------------- ------------ - ------------- -----'.
031300     05  FILLER                   PIC X(51)      VALUE
031310            '---------------- - -------- ------------           '.
031320   03  WS-751P-P1                                VALUE SPACES.
031330     05  FILLER                   PIC X(2).
031340     05  WS-751P-P1-BC            PIC X(8).
031350     05  WS-751P-P1-PRI-BR        PIC X(5).
031360     05  WS-751P-P1-SEC-BR        PIC X(5).
031370     05  WS-751P-P1-BILL-TYPE     PIC X(2).
031380     05  FILLER                   PIC X.
031390     05  WS-751P-P1-CARD-CD       PIC X.
031400     05  FILLER                   PIC X(2).
031410     05  WS-751P-P1-RSL-INSTR     PIC X.
031420     05  WS-751P-P1-EXP-INSTR     PIC X.
031430     05  FILLER                   PIC X(2).
031440     05  WS-751P-P1-EXP-NEW-PROD  PIC X(13).
031450     05  FILLER                   PIC X.
031460     05  WS-751P-P1-EXP-PROD-DESC PIC X(21).
031470     05  FILLER                   PIC X.
031480     05  WS-751P-P1-EXP-PRI-BR    PIC X(5).
031490     05  WS-751P-P1-EXP-SEC-BR    PIC X(5).
031500     05  WS-751P-P1-EXP-BILL-TYPE PIC X(2).
031510     05  FILLER                   PIC X.
031520     05  WS-751P-P1-CR-INSTR      PIC X.
031530     05  FILLER                   PIC X.
031540     05  WS-751P-P1-CR-NEW-PROD   PIC X(13).
031550     05  FILLER                   PIC X.
031560     05  WS-751P-P1-CR-PROD-DESC  PIC X(21).
031570     05  FILLER                   PIC X.
031580     05  WS-751P-P1-CR-COST-FLAG  PIC X.
031590     05  FILLER                   PIC X.
031600     05  WS-751P-P1-EXP-BC        PIC X(8).
031610     05  FILLER                   PIC X.
031620     05  WS-751P-P1-CR-PRI-BR     PIC X(5).
031630     05  WS-751P-P1-CR-SEC-BR     PIC X(5).
031640     05  WS-751P-P1-CR-BILL-TYPE  PIC X(2).
031650     05  FILLER                   PIC X(11).
031660   03  WS-751P-C2.
031670     05  FILLER                   PIC X(50)      VALUE
031680             '     BC/BR/BR/TYPE     C IAI  INV PROD CD   INVAL '.
031690     05  FILLER                   PIC X(50)      VALUE
031700             'PROD DESCRIPT  CF                                 '.
031710     05  FILLER                   PIC X(51)      VALUE SPACES.
031720   03  WS-751P-D2.
031730     05  FILLER                   PIC X(50)      VALUE
031740             '  -------------------- -  -  ------------- -------'.
031750     05  FILLER                   PIC X(50)      VALUE
031760             '-------------- -                                  '.
031770     05  FILLER                   PIC X(51)      VALUE SPACES.
031780   03  WS-751P-P2                                VALUE SPACES.
031790     05  FILLER                   PIC X(2).
031800     05  WS-751P-P2-BC            PIC X(8).
031810     05  WS-751P-P2-PRI-BR        PIC X(5).
031820     05  WS-751P-P2-SEC-BR        PIC X(5).
031830     05  WS-751P-P2-BILL-TYPE     PIC X(2).
031840     05  FILLER                   PIC X.
031850     05  WS-751P-P2-CARD-CD       PIC X.
031860     05  FILLER                   PIC X(2).
031870     05  WS-751P-P2-INV-INSTR     PIC X.
031880     05  FILLER                   PIC X(2).
031890     05  WS-751P-P2-INV-NEW-PROD  PIC X(13).
031900     05  FILLER                   PIC X.
031910     05  WS-751P-P2-INV-PROD-DESC PIC X(21).
031920     05  FILLER                   PIC X.
031930     05  WS-751P-P2-INV-COST-FLAG PIC X.
031940     05  FILLER                   PIC X(85).
031950   03  WS-871-C1.
031960     05  FILLER                   PIC X(50)      VALUE
031970             '     BC    SEQ UPDATE BRANCH PRODUCT CODE  AC-L AC'.
031980     05  FILLER                   PIC X(50)      VALUE
031990             'COUNT NUMBER       TT-L FORMAT INSTRUCTIONS       '.
032000     05  FILLER                   PIC X(51)      VALUE SPACE.
032010   03  WS-871-D1.
032020     05  FILLER                   PIC X(50)      VALUE
032030             '  -------- --- ------  ----- -------------  --  --'.
032040     05  FILLER                   PIC X(50)      VALUE
032050             '------------------   -  --------------------------'.
032060     05  FILLER                   PIC X(51)      VALUE
032070            '--------------                                     '.
032080   03  WS-871-P1                                 VALUE SPACES.
032090     05  FILLER                   PIC X(2).
032100     05  WS-871-P1-BC             PIC X(8).
032110     05  FILLER                   PIC X.
032120     05  WS-871-P1-SEQ-NBR        PIC X(3).
032130     05  FILLER                   PIC X.
032140     05  WS-871-P1-UPDATED        PIC X(6).
032150     05  FILLER                   PIC X(2).
032160     05  WS-871-P1-BRANCH         PIC X(5).
032170     05  FILLER                   PIC X.
032180     05  WS-871-P1-PROD-CODE      PIC X(13).
032190     05  FILLER                   PIC X(2).
032200     05  WS-871-P1-ACCT-LENGTH    PIC X(2).
032210     05  FILLER                   PIC X(2).
032220     05  WS-871-P1-ACCT-NBR       PIC X(20).
032230     05  FILLER                   PIC X(3).
032240     05  WS-871-P1-TT-LENGTH      PIC X.
032250     05  FILLER                   PIC X(2).
032260     05  WS-871-P1-FORMAT-INSTR   PIC X(40).
032270     05  FILLER                   PIC X(37).
032280   03  WS-1130P-C1.
032290     05  FILLER                   PIC X(50)      VALUE
032300             'CONSID#  PRODUCT-CODE  NAME                       '.
032310     05  FILLER                   PIC X(21)      VALUE
032320             '    PROD. DESCRIPTION'.
032330     05  FILLER                   PIC X(61)      VALUE SPACES.
032340   03  WS-1130P-D1.
032350     05  FILLER                   PIC X(50)      VALUE
032360             '-----    ------------- ---------------------------'.
032370     05  FILLER                   PIC X(21)      VALUE
032380             '    -----------------'.
032390     05  FILLER                   PIC X(61)      VALUE SPACES.
032400   03  WS-1130P-P1                               VALUE SPACES.
032410     05  WS-1130P-P1-CONSID-NBR   PIC X(5).
032420     05  FILLER                   PIC X(4).
032430     05  WS-1130P-P1-PROD-CODE    PIC X(13).
032440     05  FILLER                   PIC X.
032450     05  WS-1130P-P1-NAME         PIC X(27).
032460     05  FILLER                   PIC X(4).
032470     05  WS-1130P-P1-PROD-DESC    PIC X(17).
032480     05  FILLER                   PIC X.
032490   03  WS-8920-C1.
032500     05  FILLER                   PIC X(50)      VALUE
032510             '  CNSD#     BC      BANK NAME  /  ADDRESS LINE 3  '.
032520     05  FILLER                   PIC X(50)      VALUE
032530             '   ADDRESS LINE 1  /  CITY          ATTENTION  /  '.
032540     05  FILLER                   PIC X(51)      VALUE
032550            'STATE              ADDRESS LINE 2  /  ZIP CODE     '.
032560   03  WS-8920-D1.
032570     05  FILLER                   PIC X(50)      VALUE
032580             '  -----  --------   ------------------------------'.
032590     05  FILLER                   PIC X(50)      VALUE
032600             '   ------------------------------   --------------'.
032610     05  FILLER                   PIC X(51)      VALUE
032620            '----------------   ------------------------------  '.
032630   03  WS-8920-P1                                VALUE SPACES.
032640     05  FILLER                   PIC X(2).
032650     05  WS-8920-P1-CONSID-NBR    PIC X(5).
032660     05  FILLER                   PIC X(2).
032670     05  WS-8920-P1-BC            PIC X(8).
032680     05  FILLER                   PIC X(3).
032690     05  WS-8920-P1-BANK-NAME     PIC X(30).
032700     05  FILLER                   PIC X(3).
032710     05  WS-8920-P1-ADDR-LN-1     PIC X(30).
032720     05  FILLER                   PIC X(3).
032730     05  WS-8920-P1-ATTN-LN       PIC X(30).
032740     05  FILLER                   PIC X(3).
032750     05  WS-8920-P1-ADDR-LN-2     PIC X(30).
032760     05  FILLER                   PIC X(2).
032770   03  WS-8920-P2                                VALUE SPACES.
032780     05  FILLER                   PIC X(20).
032790     05  WS-8920-P2-ADDR-LN-3     PIC X(30).
032800     05  FILLER                   PIC X(3).
032810     05  WS-8920-P2-CITY          PIC X(30).
032820     05  FILLER                   PIC X(3).
032830     05  WS-8920-P2-STATE         PIC X(2).
032840     05  FILLER                   PIC X(31).
032850     05  WS-8920-P2-ZIP           PIC X(12).
032860     05  FILLER                   PIC X(20).
032870   03  WS-781P-C1.
032880     05  FILLER                   PIC X(50)      VALUE
032890             '  HLDCO L1 L2 L3    MBC    L1 L2 L3     BC     BR1'.
032900     05  FILLER                   PIC X(50)      VALUE
032910             '   BR2  TYPE  CARD    REPORT N/C FLAG REPORT N/C F'.
032920     05  FILLER                   PIC X(51)      VALUE
032930            'LAG REPORT N/C FLAG REPORT N/C FLAG   COMMENT      '.
032940   03  WS-781P-D1.
032950     05  FILLER                   PIC X(50)      VALUE
032960             '  ----- -- -- --  -------- -- -- --  -------- ----'.
032970     05  FILLER                   PIC X(50)      VALUE
032980             '- -----  --    -      ------  -    -  ------  -   '.
032990     05  FILLER                   PIC X(51)      VALUE
033000            ' -  ------  -    -  ------  -    -    -------      '.
033010   03  WS-781P-P1                                VALUE SPACES.
033020     05  FILLER                   PIC X(2).
033030     05  WS-781P-P1-HOLDCO        PIC X(5).
033040     05  FILLER                   PIC X.
033050     05  WS-781P-P1-HC-DIV-1      PIC X(2).
033060     05  FILLER                   PIC X.
033070     05  WS-781P-P1-HC-DIV-2      PIC X(2).
033080     05  FILLER                   PIC X.
033090     05  WS-781P-P1-HC-DIV-3      PIC X(2).
033100     05  FILLER                   PIC X(2).
033110     05  WS-781P-P1-MASTER-BC     PIC X(8).
033120     05  FILLER                   PIC X.
033130     05  WS-781P-P1-FI-DIV-1      PIC X(2).
033140     05  FILLER                   PIC X.
033150     05  WS-781P-P1-FI-DIV-2      PIC X(2).
033160     05  FILLER                   PIC X.
033170     05  WS-781P-P1-FI-DIV-3      PIC X(2).
033180     05  FILLER                   PIC X(2).
033190     05  WS-781P-P1-BC            PIC X(8).
033200     05  FILLER                   PIC X.
033210     05  WS-781P-P1-PRI-BR        PIC X(5).
033220     05  FILLER                   PIC X.
033230     05  WS-781P-P1-SEC-BR        PIC X(5).
033240     05  FILLER                   PIC X(2).
033250     05  WS-781P-P1-BILL-TYPE     PIC X(2).
033260     05  FILLER                   PIC X(4).
033270     05  WS-781P-P1-CARD-CODE     PIC X.
033280     05  FILLER                   PIC X(6).
033290     05  WS-781P-P1-RPT-NBR-1     PIC X(6).
033300     05  FILLER                   PIC X(2).
033310     05  WS-781P-P1-NC-INCL-1     PIC X.
033320     05  FILLER                   PIC X(4).
033330     05  WS-781P-P1-REB-FLAG-1    PIC X(1).
033340     05  FILLER                   PIC X(2).
033350     05  WS-781P-P1-RPT-NBR-2     PIC X(6).
033360     05  FILLER                   PIC X(2).
033370     05  WS-781P-P1-NC-INCL-2     PIC X.
033380     05  FILLER                   PIC X(4).
033390     05  WS-781P-P1-REB-FLAG-2    PIC X(1).
033400     05  FILLER                   PIC X(2).
033410     05  WS-781P-P1-RPT-NBR-3     PIC X(6).
033420     05  FILLER                   PIC X(2).
033430     05  WS-781P-P1-NC-INCL-3     PIC X.
033440     05  FILLER                   PIC X(4).
033450     05  WS-781P-P1-REB-FLAG-3    PIC X(1).
033460     05  FILLER                   PIC X(2).
033470     05  WS-781P-P1-RPT-NBR-4     PIC X(6).
033480     05  FILLER                   PIC X(2).
033490     05  WS-781P-P1-NC-INCL-4     PIC X.
033500     05  FILLER                   PIC X(4).
033510     05  WS-781P-P1-REB-FLAG-4    PIC X(1).
033520     05  FILLER                   PIC X(4).
033530     05  WS-781P-P1-COMMENT       PIC X(6).
033540   03  WS-782P-C1.
033550     05  FILLER                   PIC X(50)      VALUE
033560             '  CONSID  BC        PR BR  SEC BR  TYPE  PROD GRP '.
033570     05  FILLER                   PIC X(44)      VALUE
033580             ' CARD CODE  ASSIGNMENTS                    '.
033590   03  WS-782P-D1.
033600     05  FILLER                   PIC X(50)      VALUE
033610             '  ------  --------  -----  ------  ----  -------- '.
033620     05  FILLER                   PIC X(48)      VALUE
033630             ' ---------  ---------------------------------  '.
033640   03  WS-782P-P1                                VALUE SPACES.
033650     05  FILLER                   PIC X(2).
033660     05  WS-I782P-CONSID-NBR      PIC X(5).
033670     05  FILLER                   PIC X(3).
033680     05  WS-I782P-BC              PIC X(8).
033690     05  FILLER                   PIC X(2).
033700     05  WS-I782P-PRI-BR          PIC X(5).
033710     05  FILLER                   PIC X(2).
033720     05  WS-I782P-SEC-BR          PIC X(5).
033730     05  FILLER                   PIC X(3).
033740     05  WS-I782P-BILL-TYPE       PIC X(2).
033750     05  FILLER                   PIC X(4).
033760     05  WS-I782P-PRODUCT-GROUP   PIC X(2).
033770     05  FILLER                   PIC X(8).
033780     05  WS-I782P-CARD-CODE       PIC X(1).
033790     05  FILLER                   PIC X(10).
033800     05  WS-I782P-ASSIGNMENTS-1   PIC X(29).
033810     05  FILLER                   PIC X(2).
033820   03  WS-782P-P2                                VALUE SPACES.
033830     05  FILLER                   PIC X(62).
033840     05  WS-I782P-ASSIGNMENTS-2   PIC X(29).
033850     05  FILLER                   PIC X(8).
033860   03  WS-782P-P3                                VALUE SPACES.
033870     05  FILLER                   PIC X(62).
033880     05  WS-I782P-ASSIGNMENTS-3   PIC X(29).
033890     05  FILLER                   PIC X(8).
033900   03  WS-1712P-C1.
033910     05  FILLER                   PIC X(50)      VALUE
033920             '  REPORT    DATE FIRST     DATE NO LONGER  BILL-TO'.
033930     05  FILLER                   PIC X(50)      VALUE
033940             '   BILL-TO                 ADDITIONAL     ADDITION'.
033950     05  FILLER                   PIC X(51)      VALUE
033960            'AL   SET-UP     RUSH       PAGE                    '.
033970   03  WS-1712P-C1A.
033980     05  FILLER                   PIC X(50)      VALUE
033990             '  NUMBER      BILLED           BILLED         BC  '.
034000     05  FILLER                   PIC X(50)      VALUE
034010             '    BRANCH   FREQ  DISK   MANUAL HOURS  SHIPPING C'.
034020     05  FILLER                   PIC X(51)      VALUE
034030            'ODE  HOURS  DEVELOPEMENT   COUNT                   '.
034040   03  WS-1712P-D1.
034050     05  FILLER                   PIC X(50)      VALUE
034060             '  ------    ----------     --------------  -------'.
034070     05  FILLER                   PIC X(50)      VALUE
034080             '-  -------   ----  ----   ------------  ----------'.
034090     05  FILLER                   PIC X(51)      VALUE
034100            '---  ------ ------------   -----                   '.
034110   03  WS-1712P-P1                               VALUE SPACES.
034120     05  FILLER                   PIC X(2).
034130     05  WS-1712P-REPORT-NUMBER   PIC X(6).
034140     05  FILLER                   PIC X(4).
034150     05  WS-1712P-DATE-FIRST-BILL PIC X(8).
034160     05  FILLER                   PIC X(7).
034170     05  WS-1712P-DATE-FINAL-BILL PIC X(8).
034180     05  FILLER                   PIC X(8).
034190     05  WS-1712P-BILL-TO-BC      PIC X(8).
034200     05  FILLER                   PIC X(2).
034210     05  WS-1712P-BILL-TO-BRANCH  PIC X(5).
034220     05  FILLER                   PIC X(6).
034230     05  WS-1712P-FREQUENCY       PIC X(1).
034240     05  FILLER                   PIC X(5).
034250     05  WS-1712P-DISK            PIC X(1).
034260     05  FILLER                   PIC X(10).
034270     05  WS-1712P-HOURS           PIC X(3).
034280     05  FILLER                   PIC X(13).
034290     05  WS-1712P-SHIPPING        PIC X(2).
034300     05  FILLER                   PIC X(8).
034310     05  WS-1712P-SET-UP-TIME     PIC X(3).
034320     05  FILLER                   PIC X(8).
034330     05  WS-1712P-RUSH-DEVELOPE   PIC X(1).
034340     05  FILLER                   PIC X(10).
034350     05  WS-1712P-PAGE-COUNT      PIC X(3).
034360     05  FILLER                   PIC X(101).
034370   03  WS-896-C1A.
034380     05  FILLER                   PIC X(51)      VALUE
034390            '  REPORT R      UPDATE                             '.
034400     05  FILLER                   PIC X(50)      VALUE
034410             '        RPT LAST PROD NAME ACCT P.O. RPT RPT HC  M'.
034420     05  FILLER                   PIC X(50)      VALUE
034430             'BC    NON-PRIMARY    PC    MAIL   MANUAL  MAIL    '.
034440   03  WS-896-C1B.
034450     05  FILLER                   PIC X(51)      VALUE
034460            '  NUMBER T       DATE              REPORT NAME     '.
034470     05  FILLER                   PIC X(50)      VALUE
034480             '        PER  WK  TRNC LEN  LEN  LEN  MED CPY SRP S'.
034490     05  FILLER                   PIC X(50)      VALUE
034500             'RP  C/T CVR DEP OTH  O/P  TO RPT  REPORT  BY BR   '.
034510   03  WS-896-D1.
034520     05  FILLER                   PIC X(51)      VALUE
034530            '  ------ -      ------ ----------------------------'.
034540     05  FILLER                   PIC X(50)      VALUE
034550             '-------  -   --   -    --   --   --   -   -   -   '.
034560     05  FILLER                   PIC X(50)      VALUE
034570             '-    -   -   -   -    -   ------    -       -     '.
034580   03  WS-896-P1                                 VALUE SPACES.
034590     05  FILLER                   PIC X(2).
034600     05  WS-896-P1-REPORT-NBR     PIC X(6).
034610     05  FILLER                   PIC X.
034620     05  WS-896-P1-RECORD-TYPE    PIC X.
034630     05  FILLER                   PIC X(6).
034640     05  WS-896-P1-UPDATE-DATE    PIC X(6).
034650     05  FILLER                   PIC X.
034660     05  WS-896-P1-REPORT-NAME    PIC X(35).
034670     05  FILLER                   PIC X(2).
034680     05  WS-896-P1-RPT-PERIOD     PIC X.
034690     05  FILLER                   PIC X(3).
034700     05  WS-896-P1-LST-WK-FI-YR   PIC X(2).
034710     05  FILLER                   PIC X(3).
034720     05  WS-896-P1-PROD-TRNC-FLG  PIC X.
034730     05  FILLER                   PIC X(4).
034740     05  WS-896-P1-NAME-LENGTH    PIC X(2).
034750     05  FILLER                   PIC X(3).
034760     05  WS-896-P1-ACCT-LENGTH    PIC X(2).
034770     05  FILLER                   PIC X(3).
034780     05  WS-896-P1-PO-NBR-LENGTH  PIC X(2).
034790     05  FILLER                   PIC X(3).
034800     05  WS-896-P1-RPT-MEDIUM     PIC X.
034810     05  FILLER                   PIC X(3).
034820     05  WS-896-P1-RPT-COPIES     PIC X.
034830     05  FILLER                   PIC X(3).
034840     05  WS-896-P1-HC-GRP-SUPRS   PIC X.
034850     05  FILLER                   PIC X(3).
034860     05  WS-896-P1-MBC-GRP-SUPRS  PIC X.
034870     05  FILLER                   PIC X(4).
034880     05  WS-896-P1-NP-CUT-TYPE-F  PIC X.
034890     05  FILLER                   PIC X(3).
034900     05  WS-896-P1-NP-CVR-ETC-FL  PIC X.
034910     05  FILLER                   PIC X(3).
034920     05  WS-896-P1-NP-BUS-DEP-FL  PIC X.
034930     05  FILLER                   PIC X(3).
034940     05  WS-896-P1-NP-OTHER-FLAG  PIC X.
034950     05  FILLER                   PIC X(4).
034960     05  WS-896-P1-PC-OUTPUT-FLG  PIC X.
034970     05  FILLER                   PIC X(3).
034980     05  WS-896-P1-MAIL-TO-RPT    PIC X(6).
034990     05  FILLER                   PIC X(4).
035000     05  WS-896-P1-MANUAL-RPT     PIC X(1).
035010     05  FILLER                   PIC X(7).
035020     05  WS-896-P1-MAIL-BY-BR     PIC X(1).
035030     05  FILLER                   PIC X(5).
035040   03  WS-896-C1A2.
035050     05  FILLER                   PIC X(51)      VALUE
035060            '  REPORT R      CHARGEABLE     BILL-TO            A'.
035070     05  FILLER                   PIC X(50)      VALUE
035080             'DDITIONAL          ADDITIONAL                     '.
035090     05  FILLER                   PIC X(50)      VALUE
035100             '                                                  '.
035110   03  WS-896-C1B2.
035120     05  FILLER                   PIC X(51)      VALUE
035130            '  NUMBER T         FLAG          BC              MA'.
035140     05  FILLER                   PIC X(50)      VALUE
035150             'NUAL HOURS       SHIPPING CODE                    '.
035160     05  FILLER                   PIC X(50)      VALUE
035170             '                                                  '.
035180   03  WS-896-D12.
035190     05  FILLER                   PIC X(51)      VALUE
035200            '  ------ -      ----------     --------         ---'.
035210     05  FILLER                   PIC X(50)      VALUE
035220             '----------       -------------                    '.
035230     05  FILLER                   PIC X(50)      VALUE
035240             '                                                  '.
035250   03  WS-896-P12                                VALUE SPACES.
035260     05  FILLER                   PIC X(2).
035270     05  WS-896-P12-REPORT-NBR    PIC X(6).
035280     05  FILLER                   PIC X.
035290     05  WS-896-P12-RECORD-TYPE   PIC X.
035300     05  FILLER                   PIC X(11).
035310     05  WS-896-P12-CHARGE-FLAG   PIC X(1).
035320     05  FILLER                   PIC X(09).
035330     05  WS-896-P12-BILL-TO-BC    PIC X(8).
035340     05  FILLER                   PIC X(15).
035350     05  WS-896-P12-MANUAL-HOURS  PIC X(02).
035360     05  FILLER                   PIC X(18).
035370     05  WS-896-P12-SHIPPING-CD   PIC X(2).
035380     05  FILLER                   PIC X(100).
035390   03  WS-896-C2.
035400     05  FILLER                   PIC X(151)     VALUE
035410            '  REPORT T #    UPDATE   COMMENT LINE'.
035420   03  WS-896-D2.
035430     05  FILLER                   PIC X(25)      VALUE
035440            '  ------ - -    ------   '.
035450     05  FILLER                   PIC X(109)     VALUE ALL '-'.
035460     05  FILLER                   PIC X(17)      VALUE SPACES.
035470   03  WS-896-P2                                 VALUE SPACES.
035480     05  FILLER                   PIC X(2).
035490     05  WS-896-P2-REPORT-NBR     PIC X(6).
035500     05  FILLER                   PIC X.
035510     05  WS-896-P2-RECORD-TYPE    PIC X.
035520     05  FILLER                   PIC X.
035530     05  WS-896-P2-REC-NBR        PIC X.
035540     05  FILLER                   PIC X(4).
035550     05  WS-896-P2-UPDATE-DATE    PIC X(6).
035560     05  FILLER                   PIC X(3).
035570     05  WS-896-P2-COMMENT-LINE   PIC X(109).
035580     05  FILLER                   PIC X(17).
035590   03  WS-896-C3.
035600     05  FILLER                   PIC X(51)      VALUE
035610            '  REPORT T NBR  UPDATE  ALT  BR#  LABEL LINE 1 OR 4'.
035620     05  FILLER                   PIC X(50)      VALUE
035630             '                  LABEL LINE 2 OR 5               '.
035640     05  FILLER                   PIC X(50)      VALUE
035650             '   LABEL LINE 3 OR 6                  BARCODE ZIP '.
035660   03  WS-896-D3.
035670     05  FILLER                   PIC X(51)      VALUE
035680            '  ------ - ---  ------   -  ----- -----------------'.
035690     05  FILLER                   PIC X(50)      VALUE
035700             '----------------- --------------------------------'.
035710     05  FILLER                   PIC X(50)      VALUE
035720             '-- ---------------------------------- ------------'.
035730   03  WS-896-P3                                 VALUE SPACES.
035740     05  FILLER                   PIC X(2).
035750     05  WS-896-P3-REPORT-NBR     PIC X(6).
035760     05  FILLER                   PIC X.
035770     05  WS-896-P3-RECORD-TYPE    PIC X.
035780     05  FILLER                   PIC X.
035790     05  WS-896-P3-REC-NBR        PIC X(3).
035800     05  FILLER                   PIC X(2).
035810     05  WS-896-P3-UPDATE-DATE    PIC X(6).
035820     05  FILLER                   PIC X(3).
035830     05  WS-896-P3-ALT-ADDR-FLG   PIC X.
035840     05  FILLER                   PIC X(2).
035850     05  WS-896-P3-BRANCH-NBR     PIC X(5).
035860     05  FILLER                   PIC X.
035870     05  WS-896-P3-LBL-LN-1-OR-4  PIC X(34).
035880     05  FILLER                   PIC X.
035890     05  WS-896-P3-LBL-LN-2-OR-5  PIC X(34).
035900     05  FILLER                   PIC X.
035910     05  WS-896-P3-LBL-LN-3-OR-6  PIC X(34).
035920     05  FILLER                   PIC X.
035930     05  WS-896-P3-BARCODE-ZIP    PIC X(12).
035940   03  WS-896-C4.
035950     05  FILLER       PIC X(25) VALUE '  REPORT T #    UPDATE   '.
035960     05  FILLER                   PIC X(126) VALUE 'HEADING TEXT'.
035970   03  WS-896-D4.
035980     05  FILLER       PIC X(25) VALUE '  ------ - -    ------   '.
035990     05  FILLER                   PIC X(80)      VALUE ALL '-'.
036000     05  FILLER                   PIC X(46)      VALUE SPACES.
036010   03  WS-896-P4                                 VALUE SPACES.
036020     05  FILLER                   PIC X(2).
036030     05  WS-896-P4-REPORT-NBR     PIC X(6).
036040     05  FILLER                   PIC X.
036050     05  WS-896-P4-RECORD-TYPE    PIC X.
036060     05  FILLER                   PIC X.
036070     05  WS-896-P4-REC-NBR        PIC X.
036080     05  FILLER                   PIC X(4).
036090     05  WS-896-P4-UPDATE-DATE    PIC X(6).
036100     05  FILLER                   PIC X(3).
036110     05  WS-896-P4-HEADING-TEXT   PIC X(80).
036120     05  FILLER                   PIC X(46).
036130   03  WS-896-C5.
036140     05  FILLER                   PIC X(51)      VALUE
036150            '  REPORT T      UPDATE   DETAIL REPORT COLUMN CODES'.
036160     05  FILLER                   PIC X(50)      VALUE
036170             '               SUMMARY REPORT COLUMN CODES        '.
036180     05  FILLER                   PIC X(50)      VALUE SPACES.
036190   03  WS-896-D5.
036200     05  FILLER                   PIC X(51)      VALUE
036210            '  ------ -      ------   -- -- -- -- -- -- -- -- --'.
036220     05  FILLER                   PIC X(50)      VALUE
036230             ' -- -- -- --   -- -- -- -- -- -- -- -- -- -- -- --'.
036240     05  FILLER                   PIC X(50)      VALUE
036250             ' --                                               '.
036260   03  WS-896-P5                                 VALUE SPACES.
036270     05  FILLER                   PIC X(2).
036280     05  WS-896-P5-REPORT-NBR     PIC X(6).
036290     05  FILLER                   PIC X.
036300     05  WS-896-P5-RECORD-TYPE    PIC X.
036310     05  FILLER                   PIC X(6).
036320     05  WS-896-P5-UPDATE-DATE    PIC X(6).
036330     05  FILLER                   PIC X(3).
036340     05  WS-896-P5-DTL-COL-01     PIC X(2).
036350     05  FILLER                   PIC X.
036360     05  WS-896-P5-DTL-COL-02     PIC X(2).
036370     05  FILLER                   PIC X.
036380     05  WS-896-P5-DTL-COL-03     PIC X(2).
036390     05  FILLER                   PIC X.
036400     05  WS-896-P5-DTL-COL-04     PIC X(2).
036410     05  FILLER                   PIC X.
036420     05  WS-896-P5-DTL-COL-05     PIC X(2).
036430     05  FILLER                   PIC X.
036440     05  WS-896-P5-DTL-COL-06     PIC X(2).
036450     05  FILLER                   PIC X.
036460     05  WS-896-P5-DTL-COL-07     PIC X(2).
036470     05  FILLER                   PIC X.
036480     05  WS-896-P5-DTL-COL-08     PIC X(2).
036490     05  FILLER                   PIC X.
036500     05  WS-896-P5-DTL-COL-09     PIC X(2).
036510     05  FILLER                   PIC X.
036520     05  WS-896-P5-DTL-COL-10     PIC X(2).
036530     05  FILLER                   PIC X.
036540     05  WS-896-P5-DTL-COL-11     PIC X(2).
036550     05  FILLER                   PIC X.
036560     05  WS-896-P5-DTL-COL-12     PIC X(2).
036570     05  FILLER                   PIC X.
036580     05  WS-896-P5-DTL-COL-13     PIC X(2).
036590     05  FILLER                   PIC X(3).
036600     05  WS-896-P5-SUM-COL-01     PIC X(2).
036610     05  FILLER                   PIC X.
036620     05  WS-896-P5-SUM-COL-02     PIC X(2).
036630     05  FILLER                   PIC X.
036640     05  WS-896-P5-SUM-COL-03     PIC X(2).
036650     05  FILLER                   PIC X.
036660     05  WS-896-P5-SUM-COL-04     PIC X(2).
036670     05  FILLER                   PIC X.
036680     05  WS-896-P5-SUM-COL-05     PIC X(2).
036690     05  FILLER                   PIC X.
036700     05  WS-896-P5-SUM-COL-06     PIC X(2).
036710     05  FILLER                   PIC X.
036720     05  WS-896-P5-SUM-COL-07     PIC X(2).
036730     05  FILLER                   PIC X.
036740     05  WS-896-P5-SUM-COL-08     PIC X(2).
036750     05  FILLER                   PIC X.
036760     05  WS-896-P5-SUM-COL-09     PIC X(2).
036770     05  FILLER                   PIC X.
036780     05  WS-896-P5-SUM-COL-10     PIC X(2).
036790     05  FILLER                   PIC X.
036800     05  WS-896-P5-SUM-COL-11     PIC X(2).
036810     05  FILLER                   PIC X.
036820     05  WS-896-P5-SUM-COL-12     PIC X(2).
036830     05  FILLER                   PIC X.
036840     05  WS-896-P5-SUM-COL-13     PIC X(2).
036850     05  FILLER                   PIC X(47).
036860   03  WS-896-C6.
036870     05  FILLER                   PIC X(51)      VALUE
036880            '  REPORT T COL  UPDATE   HEADING 1 OVERRIDE (TOP)  '.
036890     05  FILLER                   PIC X(50)      VALUE
036900             '           HEADING 2 OVERRIDE (MIDDLE)          HE'.
036910     05  FILLER                   PIC X(50)      VALUE
036920             'ADING 3 OVERRIDE (BOTTOM OR ONLY)                 '.
036930   03  WS-896-D6.
036940     05  FILLER                   PIC X(51)      VALUE
036950            '  ------ - --   ------   --------------------------'.
036960     05  FILLER                   PIC X(50)      VALUE
036970             '---------- ------------------------------------ --'.
036980     05  FILLER                   PIC X(50)      VALUE
036990             '----------------------------------                '.
037000   03  WS-896-P6                                 VALUE SPACES.
037010     05  FILLER                   PIC X(2).
037020     05  WS-896-P6-REPORT-NBR     PIC X(6).
037030     05  FILLER                   PIC X.
037040     05  WS-896-P6-RECORD-TYPE    PIC X.
037050     05  FILLER                   PIC X.
037060     05  WS-896-P6-COL-CD         PIC X(2).
037070     05  FILLER                   PIC X(3).
037080     05  WS-896-P6-UPDATE-DATE    PIC X(6).
037090     05  FILLER                   PIC X(3).
037100     05  WS-896-P6-HD-1-OVERRIDE  PIC X(36).
037110     05  FILLER                   PIC X.
037120     05  WS-896-P6-HD-2-OVERRIDE  PIC X(36).
037130     05  FILLER                   PIC X.
037140     05  WS-896-P6-HD-3-OVERRIDE  PIC X(36).
037150     05  FILLER                   PIC X(16).
037160   03  WS-896-C7.
037170     05  FILLER       PIC X(25) VALUE '  REPORT T      UPDATE   '.
037180     05  FILLER       PIC X(109) VALUE  'SUMMARY REPORT FOOTNOTE'.
037190     05  FILLER                   PIC X(17)      VALUE SPACES.
037200   03  WS-896-D7.
037210     05  FILLER       PIC X(25) VALUE '  ------ -      ------   '.
037220     05  FILLER                   PIC X(109)     VALUE ALL '-'.
037230     05  FILLER                   PIC X(17)      VALUE SPACES.
037240   03  WS-896-P7                                 VALUE SPACES.
037250     05  FILLER                   PIC X(2).
037260     05  WS-896-P7-REPORT-NBR     PIC X(6).
037270     05  FILLER                   PIC X.
037280     05  WS-896-P7-RECORD-TYPE    PIC X.
037290     05  FILLER                   PIC X(6).
037300     05  WS-896-P7-UPDATE-DATE    PIC X(6).
037310     05  FILLER                   PIC X(3).
037320     05  WS-896-P7-SUM-FTNOTE     PIC X(109).
037330     05  FILLER                   PIC X(17).
037340   03  WS-896-C8.
037350     05  FILLER                   PIC X(51)      VALUE
037360            '  REPORT T CAT  UPDATE   CATEGORY TITLE            '.
037370     05  FILLER                   PIC X(100)     VALUE SPACES.
037380   03  WS-896-D8.
037390     05  FILLER                   PIC X(51)      VALUE
037400            '  ------ - --   ------   --------------------      '.
037410     05  FILLER                   PIC X(100)     VALUE SPACES.
037420   03  WS-896-P8                                 VALUE SPACES.
037430     05  FILLER                   PIC X(2).
037440     05  WS-896-P8-REPORT-NBR     PIC X(6).
037450     05  FILLER                   PIC X.
037460     05  WS-896-P8-RECORD-TYPE    PIC X.
037470     05  FILLER                   PIC X.
037480     05  WS-896-P8-CAT-CD         PIC X(2).
037490     05  FILLER                   PIC X(3).
037500     05  WS-896-P8-UPDATE-DATE    PIC X(6).
037510     05  FILLER                   PIC X(3).
037520     05  WS-896-P8-CAT-TITLE      PIC X(20).
037530     05  FILLER                   PIC X(106).
037540   03  WS-896-C9A.
037550     05  FILLER                   PIC X(51)      VALUE
037560            '  REPORT R RPT  UPDATE RPT D-TOT SUM  -RECAP-  OMT '.
037570     05  FILLER                   PIC X(100)     VALUE SPACES.
037580   03  WS-896-C9B.
037590     05  FILLER                   PIC X(51)      VALUE
037600            '  NUMBER T LVL   DATE  SEL P C F TOT LV TOT PG INS '.
037610     05  FILLER                PIC X(100) VALUE 'OMIT CATEGORIES'.
037620   03  WS-896-D9.
037630     05  FILLER                   PIC X(51)      VALUE
037640            '  ------ - -    ------  -  - - -  -   -  -  -   -  '.
037650     05  FILLER                   PIC X(100)     VALUE ALL '-'.
037660   03  WS-896-P9                                 VALUE SPACES.
037670     05  FILLER                   PIC X(2).
037680     05  WS-896-P9-REPORT-NBR     PIC X(6).
037690     05  FILLER                   PIC X.
037700     05  WS-896-P9-RECORD-TYPE    PIC X.
037710     05  FILLER                   PIC X.
037720     05  WS-896-P9-RP-LV          PIC X.
037730     05  FILLER                   PIC X(4).
037740     05  WS-896-P9-UPDATE-DATE    PIC X(6).
037750     05  FILLER                   PIC X(2).
037760     05  WS-896-P9-RPT-SEL        PIC X.
037770     05  FILLER                   PIC X(2).
037780     05  WS-896-P9-DTL-PROD-TOT   PIC X.
037790     05  FILLER                   PIC X.
037800     05  WS-896-P9-DTL-CAT-TOT    PIC X.
037810     05  FILLER                   PIC X.
037820     05  WS-896-P9-DTL-FI-TOT     PIC X.
037830     05  FILLER                   PIC X(2).
037840     05  WS-896-P9-SUM-TOT-OPT    PIC X.
037850     05  FILLER                   PIC X(3).
037860     05  WS-896-P9-SUM-RECAP-LVL  PIC X.
037870     05  FILLER                   PIC X(2).
037880     05  WS-896-P9-RECAP-TOT-OPT  PIC X.
037890     05  FILLER                   PIC X(2).
037900     05  WS-896-P9-RECAP-PG-BRK   PIC X.
037910     05  FILLER                   PIC X(3).
037920     05  WS-896-P9-OMIT-INSTR     PIC X.
037930     05  FILLER                   PIC X(2).
037940     05  WS-896-P9-OMIT-CATS      PIC X(100).
037950   03  WS-896-C10A.
037960     05  FILLER                   PIC X(51)      VALUE
037970            '  REPORT R REC  UPDATE  ASGN                       '.
037980     05  FILLER                   PIC X(50)      VALUE
037990             '                                                  '.
038000     05  FILLER                   PIC X(50)      VALUE
038010             '                              NW/         C SEP D '.
038020   03  WS-896-C10B.
038030     05  FILLER                   PIC X(51)      VALUE
038040            '  NUMBER T NBR   DATE   CAT    BC     BR1   BR2  TC'.
038050     05  FILLER                   PIC X(50)      VALUE
038060             '   PROD CODE     BILL-TO ACCOUNT      PRINTED ACCO'.
038070     05  FILLER                   PIC X(50)      VALUE
038080             'UNT    PURCHASE ORDER MED AOE REO  NACHA  R INV WV'.
038090   03  WS-896-D10.
038100     05  FILLER                   PIC X(51)      VALUE
038110            '  ------ - ---  ------   -- -------- ----- ----- --'.
038120     05  FILLER                   PIC X(50)      VALUE
038130             ' ------------- -------------------- --------------'.
038140     05  FILLER                   PIC X(50)      VALUE
038150             '------ --------------- -   -   -  ------- -  -- - '.
038160   03  WS-896-P10                                VALUE SPACES.
038170     05  FILLER                   PIC X(2).
038180     05  WS-896-P10-REPORT-NBR    PIC X(6).
038190     05  FILLER                   PIC X.
038200     05  WS-896-P10-RECORD-TYPE   PIC X.
038210     05  FILLER                   PIC X.
038220     05  WS-896-P10-REC-NBR       PIC X(4).
038230     05  FILLER                   PIC X.
038240     05  WS-896-P10-UPDATE-DATE   PIC X(6).
038250     05  FILLER                   PIC X(3).
038260     05  WS-896-P10-ASSIGN-CAT    PIC X(2).
038270     05  FILLER                   PIC X.
038280     05  WS-896-P10-M-BC          PIC X(8).
038290     05  FILLER                   PIC X.
038300     05  WS-896-P10-M-PRI-BR      PIC X(5).
038310     05  FILLER                   PIC X.
038320     05  WS-896-P10-M-SEC-BR      PIC X(5).
038330     05  FILLER                   PIC X.
038340     05  WS-896-P10-M-BIL-TYP     PIC X(2).
038350     05  FILLER                   PIC X.
038360     05  WS-896-P10-M-PROD-CD     PIC X(13).
038370     05  FILLER                   PIC X.
038380     05  WS-896-P10-M-BL-ACCT     PIC X(20).
038390     05  FILLER                   PIC X.
038400     05  WS-896-P10-M-PR-ACCT     PIC X(20).
038410     05  FILLER                   PIC X.
038420     05  WS-896-P10-M-PUR-ORD     PIC X(15).
038430     05  FILLER                   PIC X.
038440     05  WS-896-P10-M-BIL-MED     PIC X.
038450     05  FILLER                   PIC X(3).
038460     05  WS-896-P10-M-AOE-FLG     PIC X.
038470     05  FILLER                   PIC X(3).
038480     05  WS-896-P10-M-REORDER     PIC X.
038490     05  FILLER                   PIC X(2).
038500     05  WS-896-P10-M-NACHA       PIC X(7).
038510     05  FILLER                   PIC X.
038520     05  WS-896-P10-M-CR-FLAG     PIC X.
038530     05  FILLER                   PIC X(2).
038540     05  WS-896-P10-M-SEP-INV     PIC X(2).
038550     05  FILLER                   PIC X.
038560     05  WS-896-P10-M-D-WV-FLG    PIC X.
038570     05  FILLER                   PIC X.
038580   03  WS-850P-C1.
038590     05  FILLER                   PIC X(50)      VALUE
038600             '  INST TYPE   INST NBR   CONSID NBR               '.
038610     05  FILLER                   PIC X(101)     VALUE SPACE.
038620   03  WS-850P-D1.
038630     05  FILLER                   PIC X(50)      VALUE
038640             '      -       --------      -----                 '.
038650     05  FILLER                   PIC X(101)     VALUE SPACE.
038660   03  WS-850P-P1                                VALUE SPACE.
038670     05  FILLER                   PIC X(6).
038680     05  WS-850P-P1-INST-TYP      PIC X.
038690     05  FILLER                   PIC X(7).
038700     05  WS-850P-P1-INST-BC       PIC X(8).
038710     05  FILLER                   PIC X(6).
038720     05  WS-850P-P1-CONSID-NBR    PIC X(5).
038730     05  FILLER                   PIC X(68).
038740   03  WS-851P-C1.
038750     05  FILLER                   PIC X(50)      VALUE
038760             '  CONSID NBR   CLIENT SHARE   FREQUENCY   HOLD DAY'.
038770     05  FILLER                   PIC X(50)      VALUE
038780             'S                                                 '.
038790     05  FILLER                   PIC X(51)      VALUE SPACE.
038800   03  WS-851P-D1.
038810     05  FILLER                   PIC X(50)      VALUE
038820             '     -----       --------         -          --   '.
038830     05  FILLER                   PIC X(101)     VALUE SPACE.
038840   03  WS-851P-P1.
038850     05  FILLER                                  VALUE SPACE.
038860       07  FILLER                 PIC X(5).
038870       07  WS-851P-P1-CONSID-NBR  PIC X(5).
038880       07  FILLER                 PIC X(7).
038890       07  WS-851P-P1-CLI-SHR-PCT PIC X(6).
038900       07  FILLER                 PIC X.
038910     05  FILLER                   PIC X          VALUE '%'.
038920     05  FILLER                                  VALUE SPACE.
038930       07  FILLER                 PIC X(9).
038940       07  WS-851P-P1-FREQ        PIC X.
038950       07  FILLER                 PIC X(10).
038960       07  WS-851P-P1-HOLD-DAYS   PIC X(2).
038970       07  FILLER                 PIC X(104).
038980   03  WS-761P-C1.
038990     05  FILLER                   PIC X(50)      VALUE
039000             '  MEMBER   HLDCO L1 L2 L3  MAST BC  L1 L2 L3     B'.
039010     05  FILLER                   PIC X(50)      VALUE
039020             'C     BR1   BR2  TYPE   CONSID NUMBERS            '.
039030     05  FILLER                   PIC X(51)      VALUE
039040            '                                                   '.
039050   03  WS-761P-D1.
039060     05  FILLER                   PIC X(50)      VALUE
039070             '  ------   ----- -- -- --  -------- -- -- --  ----'.
039080     05  FILLER                   PIC X(50)      VALUE
039090             '---- ----- -----  --    ----- ----- ----- ----- --'.
039100     05  FILLER                   PIC X(51)      VALUE
039110            '--- ----- -----                                    '.
039120   03  WS-761P-P1                                VALUE SPACES.
039130     05  FILLER                   PIC X(2).
039140     05  WS-761P-P1-MEMBER        PIC X(6).
039150     05  FILLER                   PIC X(3).
039160     05  WS-761P-P1-HOLDCO        PIC X(5).
039170     05  FILLER                   PIC X.
039180     05  WS-761P-P1-HC-DIV-1      PIC X(2).
039190     05  FILLER                   PIC X.
039200     05  WS-761P-P1-HC-DIV-2      PIC X(2).
039210     05  FILLER                   PIC X.
039220     05  WS-761P-P1-HC-DIV-3      PIC X(2).
039230     05  FILLER                   PIC X(2).
039240     05  WS-761P-P1-MASTER-BC     PIC X(8).
039250     05  FILLER                   PIC X.
039260     05  WS-761P-P1-FI-DIV-1      PIC X(2).
039270     05  FILLER                   PIC X.
039280     05  WS-761P-P1-FI-DIV-2      PIC X(2).
039290     05  FILLER                   PIC X.
039300     05  WS-761P-P1-FI-DIV-3      PIC X(2).
039310     05  FILLER                   PIC X(2).
039320     05  WS-761P-P1-BC            PIC X(8).
039330     05  FILLER                   PIC X.
039340     05  WS-761P-P1-PRI-BR        PIC X(5).
039350     05  FILLER                   PIC X.
039360     05  WS-761P-P1-SEC-BR        PIC X(5).
039370     05  FILLER                   PIC X(2).
039380     05  WS-761P-P1-BILL-TYPE     PIC X(2).
039390     05  FILLER                   PIC X(4).
039400     05  WS-761P-P1-CONSID-NBR-1  PIC X(5).
039410     05  FILLER                   PIC X.
039420     05  WS-761P-P1-CONSID-NBR-2  PIC X(5).
039430     05  FILLER                   PIC X.
039440     05  WS-761P-P1-CONSID-NBR-3  PIC X(5).
039450     05  FILLER                   PIC X.
039460     05  WS-761P-P1-CONSID-NBR-4  PIC X(5).
039470     05  FILLER                   PIC X.
039480     05  WS-761P-P1-CONSID-NBR-5  PIC X(5).
039490     05  FILLER                   PIC X.
039500     05  WS-761P-P1-CONSID-NBR-6  PIC X(5).
039510     05  FILLER                   PIC X.
039520     05  WS-761P-P1-CONSID-NBR-7  PIC X(5).
039530     05  FILLER                   PIC X(36).
039540   03  WS-877-C1A.
039550     05  FILLER                   PIC X(50)      VALUE
039560             '  CONSID      UPDATE        CK   CREDIT   CR    CR'.
039570     05  FILLER                   PIC X(50)      VALUE
039580             '   CR   CREDIT "BILL-TO"                          '.
039590     05  FILLER                   PIC X(51)      VALUE
039600            '             START   END   PR  PR LDGR RPT OVRD PR '.
039610   03  WS-877-C1B.
039620     05  FILLER                   PIC X(50)      VALUE
039630             '   NBR  T      DATE  M P WK LV     BC     BR1   BR'.
039640     05  FILLER                   PIC X(50)      VALUE
039650             '2  TC    ACCOUNT NUMBER             ORGANIZATION N'.
039660     05  FILLER                   PIC X(51)      VALUE
039670            'AME           DATE   DATE  BKD DS ACCT SEL H MB UN '.
039680   03  WS-877-D1.
039690     05  FILLER                   PIC X(50)      VALUE
039700             '  ----- -     ------ - - --  -  -------- ----- ---'.
039710     05  FILLER                   PIC X(50)      VALUE
039720             '-- -- -------------------- -----------------------'.
039730     05  FILLER                   PIC X(51)      VALUE
039740            '------------ ------ ------  -  -- ----  -  - -   - '.
039750   03  WS-877-P1                                 VALUE SPACES.
039760     05  FILLER                   PIC X(2).
039770     05  WS-877-P1-CONSID-NBR     PIC X(5).
039780     05  FILLER                   PIC X.
039790     05  WS-877-P1-REC-TYPE       PIC X.
039800     05  FILLER                   PIC X.
039810     05  WS-877-P1-RECORD-NBR     PIC X(3).
039820     05  FILLER                   PIC X.
039830     05  WS-877-P1-UPDATE-DATE    PIC X(6).
039840     05  FILLER                   PIC X.
039850     05  WS-877-P1-CONSID-METH    PIC X.
039860     05  FILLER                   PIC X.
039870     05  WS-877-P1-CONSID-PERIOD  PIC X.
039880     05  FILLER                   PIC X.
039890     05  WS-877-P1-YEAR-END-WK    PIC X(2).
039900     05  FILLER                   PIC X(2).
039910     05  WS-877-P1-CHECK-LEVEL    PIC X.
039920     05  FILLER                   PIC X(2).
039930     05  WS-877-P1-CR-BC          PIC X(8).
039940     05  FILLER                   PIC X.
039950     05  WS-877-P1-CR-PRI-BR      PIC X(5).
039960     05  FILLER                   PIC X.
039970     05  WS-877-P1-CR-SEC-BR      PIC X(5).
039980     05  FILLER                   PIC X.
039990     05  WS-877-P1-CR-BILL-TYPE   PIC X(2).
040000     05  FILLER                   PIC X.
040010     05  WS-877-P1-CR-BILL-ACCT   PIC X(20).
040020     05  FILLER                   PIC X.
040030     05  WS-877-P1-ORG-NAME       PIC X(35).
040040     05  FILLER                   PIC X.
040050     05  WS-877-P1-PROG-START-DT  PIC X(6).
040060     05  FILLER                   PIC X.
040070     05  WS-877-P1-PROG-END-DATE  PIC X(6).
040080     05  FILLER                   PIC X(2).
040090     05  WS-877-P1-PR-BKDWN-OPT   PIC X.
040100     05  FILLER                   PIC X(2).
040110     05  WS-877-P1-PRICE-DESIG    PIC X(2).
040120     05  FILLER                   PIC X.
040130     05  WS-877-P1-LDGR-ACCT-2    PIC X(4).
040140     05  FILLER                   PIC X(2).
040150     05  WS-877-P1-RPT-SEL        PIC X.
040160     05  FILLER                   PIC X(2).
040170     05  WS-877-P1-HC-GRP-OVER    PIC X.
040180     05  FILLER                   PIC X.
040190     05  WS-877-P1-MBC-GRP-OVER   PIC X.
040200     05  FILLER                   PIC X(3).
040210     05  WS-877-P1-USE-PR-UNITS   PIC X.
040220   03  WS-877-C2A.
040230     05  FILLER                   PIC X(50)      VALUE
040240             '  CONSID      UPDATE    - - NORMAL REPORT COLUMN S'.
040250     05  FILLER                   PIC X(50)      VALUE
040260             'ELECTIONS - -     - - - - NORMAL REPORT LEVEL SELE'.
040270     05  FILLER                   PIC X(51)      VALUE
040280            'CTIONS - - - -   PG   - R7 LVL SEL -  - R7 OPTS - '.
040290   03  WS-877-C2B.
040300     05  FILLER                   PIC X(50)      VALUE
040310             '   NBR  T      DATE   CAT ORD UNI B&D DEL BAS P/A '.
040320     05  FILLER                   PIC X(50)      VALUE
040330             'O/A A/B ANN RAT  CC HC HL1 HL2 HL3 MBC ML1 ML2 ML3'.
040340     05  FILLER                   PIC X(51)      VALUE
040350            ' BC BR1 BR2 TYP  BRK  RPT BC BR1 TYP  PG 31/36 C/S '.
040360   03  WS-877-D2.
040370     05  FILLER                   PIC X(50)      VALUE
040380             '  ----- -     ------   -   -   -   -   -   -   -  '.
040390     05  FILLER                   PIC X(50)      VALUE
040400             ' -   -   -   -    -  -  -   -   -   -   -   -   - '.
040410     05  FILLER                   PIC X(51)      VALUE
040420            '  -  -   -   -    -    -   -  -   -    -   -    -  '.
040430   03  WS-877-P2                                 VALUE SPACES.
040440     05  FILLER                   PIC X(2).
040450     05  WS-877-P2-CONSID-NBR     PIC X(5).
040460     05  FILLER                   PIC X.
040470     05  WS-877-P2-REC-TYPE       PIC X.
040480     05  FILLER                   PIC X.
040490     05  WS-877-P2-RECORD-NBR     PIC X(3).
040500     05  FILLER                   PIC X.
040510     05  WS-877-P2-UPDATE-DATE    PIC X(6).
040520     05  FILLER                   PIC X(3).
040530     05  WS-877-P2-CAT-SEL        PIC X.
040540     05  FILLER                   PIC X(3).
040550     05  WS-877-P2-ORDS-SEL       PIC X.
040560     05  FILLER                   PIC X(3).
040570     05  WS-877-P2-UNITS-SEL      PIC X.
040580     05  FILLER                   PIC X(3).
040590     05  WS-877-P2-NET-SLS-SEL    PIC X.
040600     05  FILLER                   PIC X(3).
040610     05  WS-877-P2-DELIV-SEL      PIC X.
040620     05  FILLER                   PIC X(3).
040630     05  WS-877-P2-BASE-SEL       PIC X.
040640     05  FILLER                   PIC X(3).
040650     05  WS-877-P2-PR-ADJ-SEL     PIC X.
040660     05  FILLER                   PIC X(3).
040670     05  WS-877-P2-OTH-ADJ-SEL    PIC X.
040680     05  FILLER                   PIC X(3).
040690     05  WS-877-P2-ADJ-BASE-SEL   PIC X.
040700     05  FILLER                   PIC X(3).
040710     05  WS-877-P2-ANNUAL-SEL     PIC X.
040720     05  FILLER                   PIC X(3).
040730     05  WS-877-P2-RATE-SEL       PIC X.
040740     05  FILLER                   PIC X(4).
040750     05  WS-877-P2-CN-CD-LVL-SEL  PIC X.
040760     05  FILLER                   PIC X(2).
040770     05  WS-877-P2-HLDCO-LVL-SEL  PIC X.
040780     05  FILLER                   PIC X(2).
040790     05  WS-877-P2-HC-D1-LVL-SEL  PIC X.
040800     05  FILLER                   PIC X(3).
040810     05  WS-877-P2-HC-D2-LVL-SEL  PIC X.
040820     05  FILLER                   PIC X(3).
040830     05  WS-877-P2-HC-D3-LVL-SEL  PIC X.
040840     05  FILLER                   PIC X(3).
040850     05  WS-877-P2-MBC-LVL-SEL    PIC X.
040860     05  FILLER                   PIC X(3).
040870     05  WS-877-P2-MBC-D1-LVL-SEL PIC X.
040880     05  FILLER                   PIC X(3).
040890     05  WS-877-P2-MBC-D2-LVL-SEL PIC X.
040900     05  FILLER                   PIC X(3).
040910     05  WS-877-P2-MBC-D3-LVL-SEL PIC X.
040920     05  FILLER                   PIC X(3).
040930     05  WS-877-P2-BC-LVL-SEL     PIC X.
040940     05  FILLER                   PIC X(2).
040950     05  WS-877-P2-PRI-B-LVL-SEL  PIC X.
040960     05  FILLER                   PIC X(3).
040970     05  WS-877-P2-SEC-B-LVL-SEL  PIC X.
040980     05  FILLER                   PIC X(3).
040990     05  WS-877-P2-B-TYP-LVL-SEL  PIC X.
041000     05  FILLER                   PIC X(4).
041010     05  WS-877-P2-PG-BK-FLG      PIC X.
041020     05  FILLER                   PIC X(4).
041030     05  WS-877-P2-R7-RP-LVL-SEL  PIC X.
041040     05  FILLER                   PIC X(3).
041050     05  WS-877-P2-R7-BC-LVL-SEL  PIC X.
041060     05  FILLER                   PIC X(2).
041070     05  WS-877-P2-R7-PB-LVL-SEL  PIC X.
041080     05  FILLER                   PIC X(3).
041090     05  WS-877-P2-R7-TY-LVL-SEL  PIC X.
041100     05  FILLER                   PIC X(4).
041110     05  WS-877-P2-R7-BC-PG-OPT   PIC X.
041120     05  FILLER                   PIC X(3).
041130     05  WS-877-P2-R7-CAT-31-36   PIC X.
041140     05  FILLER                   PIC X(4).
041150     05  WS-877-P2-R7-CTY-ST-OPT  PIC X.
041160     05  FILLER                   PIC X(2).
041170   03  WS-877-C3.
041180     05  FILLER                   PIC X(50)      VALUE
041190             '  CONS# T     UPDATE  CATEGORY / PRICE ADJ  ORDERS'.
041200     05  FILLER                   PIC X(50)      VALUE
041210             '/OTH ADJ   UNITS/ADJ BASE   B & D / ANNUAL   DELIV'.
041220     05  FILLER                   PIC X(51)      VALUE
041230            'ERY / RATE  BASE / CONSID                          '.
041240   03  WS-877-D3.
041250     05  FILLER                   PIC X(50)      VALUE
041260             '  ----- -     ------  --------------------  ------'.
041270     05  FILLE                    PIC X(50)      VALUE
041280             '---------  ---------------  ---------------  -----'.
041290     05  FILLER                   PIC X(51)      VALUE
041300            '----------  ---------------                        '.
041310   03  WS-877-P3A                                VALUE SPACES.
041320     05  FILLER                   PIC X(2).
041330     05  WS-877-P3-CONSID-NBR     PIC X(5).
041340     05  FILLER                   PIC X.
041350     05  WS-877-P3-REC-TYPE       PIC X.
041360     05  FILLER                   PIC X.
041370     05  WS-877-P3-RECORD-NBR     PIC X(3).
041380     05  FILLER                   PIC X.
041390     05  WS-877-P3-UPDATE-DATE    PIC X(6).
041400     05  FILLER                   PIC X(2).
041410     05  WS-877-P3-CATG-HEADING   PIC X(20).
041420     05  FILLER                   PIC X(2).
041430     05  WS-877-P3-ORDS-HEADING   PIC X(10).
041440     05  FILLER                   PIC X(7).
041450     05  WS-877-P3-UNITS-HEADING  PIC X(10).
041460     05  FILLER                   PIC X(7).
041470     05  WS-877-P3-B-AND-D-HEAD   PIC X(15).
041480     05  FILLER                   PIC X(2).
041490     05  WS-877-P3-DELIV-HEAD     PIC X(13).
041500     05  FILLER                   PIC X(4).
041510     05  WS-877-P3-BASE-HEADING   PIC X(15).
041520     05  FILLER                   PIC X(24).
041530   03  WS-877-P3B.
041540     05  FILLER          PIC X(22) VALUE '         (CONTINUED)  '.
041550     05  WS-877-P3-PR-ADJ-HEAD    PIC X(13)      VALUE SPACES.
041560     05  FILLER                   PIC X(9)       VALUE SPACES.
041570     05  WS-877-P3-OTH-ADJ-HEAD   PIC X(13)      VALUE SPACES.
041580     05  FILLER                   PIC X(4)       VALUE SPACES.
041590     05  WS-877-P3-ADJ-BASE-HEAD  PIC X(15)      VALUE SPACES.
041600     05  FILLER                   PIC X(2)       VALUE SPACES.
041610     05  WS-877-P3-ANNUAL-HEAD    PIC X(15)      VALUE SPACES.
041620     05  FILLER                   PIC X(2)       VALUE SPACES.
041630     05  WS-877-P3-RATE-HEADING   PIC X(15)      VALUE SPACES.
041640     05  FILLER                   PIC X(2)       VALUE SPACES.
041650     05  WS-877-P3-CONSID-HEAD    PIC X(13)      VALUE SPACES.
041660     05  FILLER                   PIC X(26)      VALUE SPACES.
041670   03  WS-877-C4FA.
041680     05  FILLER                   PIC X(50)      VALUE
041690             '  CONSID  REC UPDATE C                           Y'.
041700     05  FILLER                   PIC X(50)      VALUE
041710             'EARLY                        - - 1ST - -   - - 2ND'.
041720     05  FILLER                   PIC X(51)      VALUE
041730            ' - -   - - 3RD - -   - - 4TH - -   - - 5TH - -     '.
041740   03  WS-877-C4FB.
041750     05  FILLER                   PIC X(50)      VALUE
041760             '   NBR  T NBR  DATE  T TITLE                    $ '.
041770     05  FILLER                   PIC X(50)      VALUE
041780             'AMOUNT    INSTITUTION ID     PLT# PERCENT  PLT# PE'.
041790     05  FILLER                   PIC X(51)      VALUE
041800            'RCENT  PLT# PERCENT  PLT# PERCENT  PLT# PERCENT    '.
041810   03  WS-877-D4F.
041820     05  FILLER                   PIC X(50)      VALUE
041830             '  ----- - --  ------ - -------------------- ------'.
041840     05  FILLER                   PIC X(50)      VALUE
041850             '------ --------------------  ---- -------  ---- --'.
041860     05  FILLER                   PIC X(51)      VALUE
041870            '-----  ---- -------  ---- -------  ---- -------    '.
041880   03  WS-877-P4F                                VALUE SPACES.
041890     05  FILLER                   PIC X(2).
041900     05  WS-877-P4F-CONSID-NBR    PIC X(5).
041910     05  FILLER                   PIC X.
041920     05  WS-877-P4F-REC-TYPE      PIC X.
041930     05  FILLER                   PIC X.
041940     05  WS-877-P4F-RECORD-NBR    PIC X(3).
041950     05  FILLER                   PIC X.
041960     05  WS-877-P4F-UPDATE-DATE   PIC X(6).
041970     05  FILLER                   PIC X.
041980     05  WS-877-P4F-CONSID-TYPE   PIC X.
041990     05  FILLER                   PIC X.
042000     05  WS-877-P4F-CAT-TITLE     PIC X(20).
042010     05  FILLER                   PIC X.
042020     05  WS-877-P4F-YRLY-AMT      PIC Z,ZZZ,ZZZ.99.
042030     05  FILLER                   PIC X.
042040     05  WS-877-P4F-INST-ID       PIC X(20).
042050     05  FILLER                   PIC X(2).
042060     05  WS-877-P4F-PLT-INFO-1.
042070       07  WS-877-P4F-PLT-NBR-1   PIC X(4).
042080       07  FILLER                 PIC X.
042090       07  WS-877-P4F-PLT-PCT-1   PIC ZZZ.99.
042100       07  WS-877-P4F-PLT-SGN-1   PIC X.
042110     05  FILLER                   PIC X(2).
042120     05  WS-877-P4F-PLT-INFO-2.
042130       07  WS-877-P4F-PLT-NBR-2   PIC X(4).
042140       07  FILLER                 PIC X.
042150       07  WS-877-P4F-PLT-PCT-2   PIC ZZZ.99.
042160       07  WS-877-P4F-PLT-SGN-2   PIC X.
042170     05  FILLER                   PIC X(2).
042180     05  WS-877-P4F-PLT-INFO-3.
042190       07  WS-877-P4F-PLT-NBR-3   PIC X(4).
042200       07  FILLER                 PIC X.
042210       07  WS-877-P4F-PLT-PCT-3   PIC ZZZ.99.
042220       07  WS-877-P4F-PLT-SGN-3   PIC X.
042230     05  FILLER                   PIC X(2).
042240     05  WS-877-P4F-PLT-INFO-4.
042250       07  WS-877-P4F-PLT-NBR-4   PIC X(4).
042260       07  FILLER                 PIC X.
042270       07  WS-877-P4F-PLT-PCT-4   PIC ZZZ.99.
042280       07  WS-877-P4F-PLT-SGN-4   PIC X.
042290     05  FILLER                   PIC X(2).
042300     05  WS-877-P4F-PLT-INFO-5.
042310       07  WS-877-P4F-PLT-NBR-5   PIC X(4).
042320       07  FILLER                 PIC X.
042330       07  WS-877-P4F-PLT-PCT-5   PIC ZZZ.99.
042340       07  WS-877-P4F-PLT-SGN-5   PIC X.
042350     05  FILLER                   PIC X(4).
042360   03  WS-877-C4G.
042370     05  FILLER                   PIC X(50)      VALUE
042380             '  CONS# T R#  UPDATE T TITLE                BASIS '.
042390     05  FILLER                   PIC X(50)      VALUE
042400             'CODE    RATE   REDUCE BASIS  REDUCE RATE          '.
042410     05  FILLER                   PIC X(51)      VALUE SPACES.
042420   03  WS-877-D4G.
042430     05  FILLER                   PIC X(50)      VALUE
042440             '  ----- - --  ------ - --------------------      -'.
042450     05  FILLER                   PIC X(50)      VALUE
042460             '      -------        -         -------            '.
042470     05  FILLER                   PIC X(51)      VALUE SPACES.
042480   03  WS-877-P4G                                VALUE SPACES.
042490     05  FILLER                   PIC X(2).
042500     05  WS-877-P4G-CONSID-NBR    PIC X(5).
042510     05  FILLER                   PIC X.
042520     05  WS-877-P4G-REC-TYPE      PIC X.
042530     05  FILLER                   PIC X.
042540     05  WS-877-P4G-RECORD-NBR    PIC X(3).
042550     05  FILLER                   PIC X.
042560     05  WS-877-P4G-UPDATE-DATE   PIC X(6).
042570     05  FILLER                   PIC X.
042580     05  WS-877-P4G-CONSID-TYPE   PIC X.
042590     05  FILLER                   PIC X.
042600     05  WS-877-P4G-CAT-TITLE     PIC X(20).
042610     05  FILLER                   PIC X(6).
042620     05  WS-877-P4G-BASIS-CD      PIC X.
042630     05  FILLER                   PIC X(6).
042640     05  WS-877-P4G-DLRS          PIC $$$$.99.
042650     05  WS-877-P4G-RATE REDEFINES WS-877-P4G-DLRS.
042660       07  WS-877-P4G-PCT         PIC ZZ.999.
042670       07  WS-877-P4G-PCT-SGN     PIC X.
042680     05  FILLER                   PIC X(8).
042690     05  WS-877-P4G-RED-BASIS     PIC X.
042700     05  FILLER                   PIC X(9).
042710     05  WS-877-P4G-RED-DLRS      PIC $$$$.99.
042720     05  WS-877-P4G-RED-RATE REDEFINES WS-877-P4G-RED-DLRS.
042730       07  WS-877-P4G-RED-PCT     PIC ZZ.999.
042740       07  WS-877-P4G-RED-PCT-SGN PIC X.
042750     05  FILLER                   PIC X(63).
042760   03  WS-877-C4TA.
042770     05  FILLER                   PIC X(50)      VALUE
042780             '  CONSID  REC UPDATE C                     ANNL   '.
042790     05  FILLER                   PIC X(50)      VALUE
042800             '    OTHER      REDUCE     TIER   - - - - TIER - - '.
042810     05  FILLER                   PIC X(51)      VALUE
042820            '- -   - - - - TIER - - - -   - - - - TIER - - - -  '.
042830   03  WS-877-C4TB.
042840     05  FILLER                   PIC X(50)      VALUE
042850             '   NBR  T NBR  DATE  T TITLE               METH   '.
042860     05  FILLER                   PIC X(50)      VALUE
042870             '  ADJUSTMENT  BASIS  RATE  CT     MINIMUM  BASIS  '.
042880     05  FILLER                   PIC X(51)      VALUE
042890            'RATE   MINIMUM  BASIS  RATE   MINIMUM  BASIS  RATE '.
042900   03  WS-877-D4T.
042910     05  FILLER                   PIC X(50)      VALUE
042920             '  ----- - --  ------ - --------------------  -  --'.
042930     05  FILLER                   PIC X(50)      VALUE
042940             '------------   -  -------  ---  ------------ - ---'.
042950     05  FILLER                   PIC X(51)      VALUE
042960            '---- ------------ - ------- ------------ - ------- '.
042970   03  WS-877-P4TA                               VALUE SPACES.
042980     05  FILLER                   PIC X(2).
042990     05  WS-877-P4T-CONSID-NBR    PIC X(5).
043000     05  FILLER                   PIC X.
043010     05  WS-877-P4T-REC-TYPE      PIC X.
043020     05  FILLER                   PIC X.
043030     05  WS-877-P4T-RECORD-NBR    PIC X(3).
043040     05  FILLER                   PIC X.
043050     05  WS-877-P4T-UPDATE-DATE   PIC X(6).
043060     05  FILLER                   PIC X.
043070     05  WS-877-P4T-CONSID-TYPE   PIC X.
043080     05  FILLER                   PIC X.
043090     05  WS-877-P4T-CAT-TITLE     PIC X(20).
043100     05  FILLER                   PIC X(2).
043110     05  WS-877-P4T-ANNL-MTHD     PIC X.
043120     05  FILLER                   PIC X(2).
043130     05  WS-877-P4T-OTH-ADJ       PIC ZZZ,ZZZ,ZZZ.99.
043140     05  FILLER                   PIC X(3).
043150     05  WS-877-P4T-RED-BASIS     PIC X.
043160     05  FILLER                   PIC X(2).
043170     05  WS-877-P4T-RED-DLRS      PIC $$$$.99.
043180     05  WS-877-P4T-RED-RATE REDEFINES WS-877-P4T-RED-DLRS.
043190       07  WS-877-P4T-RED-PCT     PIC ZZ.999.
043200       07  WS-877-P4T-RED-PCT-SGN PIC X.
043210     05  FILLER                   PIC X(2).
043220     05  WS-877-P4T-TIER-COUNT    PIC ZZ9.
043230     05  FILLER                   PIC X(2).
043240     05  WS-877-P4TA1-TIER-INFO.
043250       07  WS-877-P4TA1-MIN-ANNL  PIC Z(9).99.
043260       07  FILLER                 PIC X.
043270       07  WS-877-P4TA1-BASIS-CD  PIC X.
043280       07  FILLER                 PIC X.
043290       07  WS-877-P4TA1-DLRS      PIC $$$$.99.
043300       07  FILLER REDEFINES WS-877-P4TA1-DLRS.
043310         09  WS-877-P4TA1-PCT     PIC ZZ.999.
043320         09  WS-877-P4TA1-PCT-SGN PIC X.
043330     05  FILLER                   PIC X.
043340     05  WS-877-P4TA2-TIER-INFO.
043350       07  WS-877-P4TA2-MIN-ANNL  PIC Z(9).99.
043360       07  FILLER                 PIC X.
043370       07  WS-877-P4TA2-BASIS-CD  PIC X.
043380       07  FILLER                 PIC X.
043390       07  WS-877-P4TA2-DLRS      PIC $$$$.99.
043400       07  FILLER REDEFINES WS-877-P4TA2-DLRS.
043410         09  WS-877-P4TA2-PCT     PIC ZZ.999.
043420         09  WS-877-P4TA2-PCT-SGN PIC X.
043430     05  FILLER                   PIC X.
043440     05  WS-877-P4TA3-TIER-INFO.
043450       07  WS-877-P4TA3-MIN-ANNL  PIC Z(9).99.
043460       07  FILLER                 PIC X.
043470       07  WS-877-P4TA3-BASIS-CD  PIC X.
043480       07  FILLER                 PIC X.
043490       07  WS-877-P4TA3-DLRS      PIC $$$$.99.
043500       07  FILLER REDEFINES WS-877-P4TA3-DLRS.
043510         09  WS-877-P4TA3-PCT     PIC ZZ.999.
043520         09  WS-877-P4TA3-PCT-SGN PIC X.
043530   03  WS-877-P4TB.
043540     05  FILLER            PIC X(20) VALUE '         (CONTINUED)'.
043550     05  FILLER                   PIC X(62)      VALUE SPACES.
043560     05  WS-877-P4TB1-TIER-INFO                  VALUE SPACES.
043570       07  WS-877-P4TB1-MIN-ANNL  PIC Z(9).99.
043580       07  FILLER                 PIC X.
043590       07  WS-877-P4TB1-BASIS-CD  PIC X.
043600       07  FILLER                 PIC X.
043610       07  WS-877-P4TB1-DLRS      PIC $$$$.99.
043620       07  FILLER REDEFINES WS-877-P4TB1-DLRS.
043630         09  WS-877-P4TB1-PCT     PIC ZZ.999.
043640         09  WS-877-P4TB1-PCT-SGN PIC X.
043650     05  FILLER                   PIC X          VALUE SPACE.
043660     05  WS-877-P4TB2-TIER-INFO                  VALUE SPACES.
043670       07  WS-877-P4TB2-MIN-ANNL  PIC Z(9).99.
043680       07  FILLER                 PIC X.
043690       07  WS-877-P4TB2-BASIS-CD  PIC X.
043700       07  FILLER                 PIC X.
043710       07  WS-877-P4TB2-DLRS      PIC $$$$.99.
043720       07  FILLER REDEFINES WS-877-P4TB2-DLRS.
043730         09  WS-877-P4TB2-PCT     PIC ZZ.999.
043740         09  WS-877-P4TB2-PCT-SGN PIC X.
043750     05  FILLER                   PIC X          VALUE SPACE.
043760     05  WS-877-P4TB3-TIER-INFO                  VALUE SPACES.
043770       07  WS-877-P4TB3-MIN-ANNL  PIC Z(9).99.
043780       07  FILLER                 PIC X.
043790       07  WS-877-P4TB3-BASIS-CD  PIC X.
043800       07  FILLER                 PIC X.
043810       07  WS-877-P4TB3-DLRS      PIC $$$$.99.
043820       07  FILLER REDEFINES WS-877-P4TB3-DLRS.
043830         09  WS-877-P4TB3-PCT     PIC ZZ.999.
043840         09  WS-877-P4TB3-PCT-SGN PIC X.
043850   03  WS-877-C5A.
043860     05  FILLER                   PIC X(50)      VALUE
043870             '  CONSID  REC UPDATE   - - - - - - - - - - MATCH F'.
043880     05  FILLER                   PIC X(50)      VALUE
043890             'IELDS  - - - - - - - -    GRP01  GRP02  GRP03  GRP'.
043900     05  FILLER                   PIC X(51)      VALUE
043910            '04  GRP05  GRP06  GRP07  GRP08  GRP09  GRP10 CR    '.
043920   03  WS-877-C5B.
043930     05  FILLER                   PIC X(50)      VALUE
043940             '   NBR  T NBR  DATE    PROD CODE    DQ    UNITS  A'.
043950     05  FILLER                   PIC X(50)      VALUE
043960             'OE MED RE    BC     BR1   CD IN  CD IN  CD IN  CD '.
043970     05  FILLER                   PIC X(51)      VALUE
043980            'IN  CD IN  CD IN  CD IN  CD IN  CD IN  CD IN HD OC '.
043990   03  WS-877-D5.
044000     05  FILLER                   PIC X(50)      VALUE
044010             '  ----- - --- ------ ------------- ----- -------  '.
044020     05  FILLER                   PIC X(50)      VALUE
044030             '-   -  -  -------- -----  --  -  --  -  --  -  -- '.
044040     05  FILLER                   PIC X(51)      VALUE
044050            ' -  --  -  --  -  --  -  --  -  --  -  --  - -- -  '.
044060   03  WS-877-P5                                 VALUE SPACES.
044070     05  FILLER                   PIC X(2).
044080     05  WS-877-P5-CONSID-NBR     PIC X(5).
044090     05  FILLER                   PIC X.
044100     05  WS-877-P5-REC-TYPE       PIC X.
044110     05  FILLER                   PIC X.
044120     05  WS-877-P5-RECORD-NBR     PIC X(3).
044130     05  FILLER                   PIC X.
044140     05  WS-877-P5-UPDATE-DATE    PIC X(6).
044150     05  FILLER                   PIC X.
044160     05  WS-877-P5-MATCH-PROD-CD  PIC X(13).
044170     05  FILLER                   PIC X.
044180     05  WS-877-P5-MATCH-D-Q      PIC X(5).
044190     05  FILLER                   PIC X.
044200     05  WS-877-P5-MATCH-UNITS    PIC X(7).
044210     05  FILLER                   PIC X(2).
044220     05  WS-877-P5-MATCH-AOE      PIC X.
044230     05  FILLER                   PIC X(3).
044240     05  WS-877-P5-MATCH-BIL-MED  PIC X.
044250     05  FILLER                   PIC X(2).
044260     05  WS-877-P5-MATCH-REORDER  PIC X.
044270     05  FILLER                   PIC X(2).
044280     05  WS-877-P5-MATCH-BC       PIC X(8).
044290     05  FILLER                   PIC X.
044300     05  WS-877-P5-MATCH-PRI-BR   PIC X(5).
044310     05  FILLER                   PIC X(2).
044320     05  WS-877-P5-GROUP-1-CODE   PIC X(2).
044330     05  FILLER                   PIC X(2).
044340     05  WS-877-P5-GROUP-1-INCL   PIC X.
044350     05  FILLER                   PIC X(2).
044360     05  WS-877-P5-GROUP-2-CODE   PIC X(2).
044370     05  FILLER                   PIC X(2).
044380     05  WS-877-P5-GROUP-2-INCL   PIC X.
044390     05  FILLER                   PIC X(2).
044400     05  WS-877-P5-GROUP-3-CODE   PIC X(2).
044410     05  FILLER                   PIC X(2).
044420     05  WS-877-P5-GROUP-3-INCL   PIC X.
044430     05  FILLER                   PIC X(2).
044440     05  WS-877-P5-GROUP-4-CODE   PIC X(2).
044450     05  FILLER                   PIC X(2).
044460     05  WS-877-P5-GROUP-4-INCL   PIC X.
044470     05  FILLER                   PIC X(2).
044480     05  WS-877-P5-GROUP-5-CODE   PIC X(2).
044490     05  FILLER                   PIC X(2).
044500     05  WS-877-P5-GROUP-5-INCL   PIC X.
044510     05  FILLER                   PIC X(2).
044520     05  WS-877-P5-GROUP-6-CODE   PIC X(2).
044530     05  FILLER                   PIC X(2).
044540     05  WS-877-P5-GROUP-6-INCL   PIC X.
044550     05  FILLER                   PIC X(2).
044560     05  WS-877-P5-GROUP-7-CODE   PIC X(2).
044570     05  FILLER                   PIC X(2).
044580     05  WS-877-P5-GROUP-7-INCL   PIC X.
044590     05  FILLER                   PIC X(2).
044600     05  WS-877-P5-GROUP-8-CODE   PIC X(2).
044610     05  FILLER                   PIC X(2).
044620     05  WS-877-P5-GROUP-8-INCL   PIC X.
044630     05  FILLER                   PIC X(2).
044640     05  WS-877-P5-GROUP-9-CODE   PIC X(2).
044650     05  FILLER                   PIC X(2).
044660     05  WS-877-P5-GROUP-9-INCL   PIC X.
044670     05  FILLER                   PIC X(2).
044680     05  WS-877-P5-GROUP-10-CODE  PIC X(2).
044690     05  FILLER                   PIC X(2).
044700     05  WS-877-P5-GROUP-10-INCL  PIC X.
044710     05  FILLER                   PIC X.
044720     05  WS-877-P5-CR-HOLD-DAYS   PIC 9(2).
044730     05  FILLER                   PIC X.
044740     05  WS-877-P5-ORD-CHANNEL    PIC X.
044750   03  WS-589P-C1.
044760     05  FILLER                   PIC X(50)      VALUE
044770             '     BC      CHECK   QUARTERLY   CREDIT TAPE   CRE'.
044780     05  FILLER                   PIC X(50)      VALUE
044790             'DIT CUST   RET ORIG EXP CD                        '.
044800     05  FILLER                   PIC X(51)      VALUE SPACES.
044810   03  WS-589P-D1.
044820     05  FILLER                   PIC X(50)      VALUE
044830             '  --------     -         -            -           '.
044840     05  FILLER                   PIC X(50)      VALUE
044850             '  -               -                               '.
044860     05  FILLER                   PIC X(51)      VALUE SPACES.
044870   03  WS-589P-P1                                VALUE SPACES.
044880     05  FILLER                   PIC X(2).
044890     05  WS-589P-P1-BC            PIC X(8).
044900     05  FILLER                   PIC X(5).
044910     05  WS-589P-P1-CK-FLAG       PIC X.
044920     05  FILLER                   PIC X(9).
044930     05  WS-589P-P1-QTRLY-FLAG    PIC X.
044940     05  FILLER                   PIC X(12).
044950     05  WS-589P-P1-CR-TO-TAPE    PIC X.
044960     05  FILLER                   PIC X(13).
044970     05  WS-589P-P1-CR-TO-CUST    PIC X.
044980     05  FILLER                   PIC X(15).
044990     05  WS-589P-P1-RET-ORIG-XC   PIC X.
045000     05  FILLER                   PIC X(81).
045010   03  WS-1475-C1A.
045020     05  FILLER                   PIC X(50)      VALUE SPACE.
045030     05  FILLER                   PIC X(50)      VALUE
045040             '                 PRICE         UNIT     UNIT     A'.
045050     05  FILLER                   PIC X(51)      VALUE
045060            'DDL     ADDL     ADDL                              '.
045070   03  WS-1475-C1B.
045080     05  FILLER                   PIC X(50)      VALUE
045090             '     BC         PRODUCT & DQ      STYLE    DESCRIP'.
045100     05  FILLER                   PIC X(50)      VALUE
045110             'TION             DESIG         BASE    DELIV      '.
045120     05  FILLER                   PIC X(51)      VALUE
045130            'QTY     BASE    DELIV                              '.
045140   03  WS-1475-D1.
045150     05  FILLER                   PIC X(50)      VALUE
045160             '  --------   ---- ------- -----   ------   -------'.
045170     05  FILLER                   PIC X(50)      VALUE
045180             '--------------   -----   ----------  -------  ----'.
045190     05  FILLER                   PIC X(51)      VALUE
045200            '---  -------  -------                              '.
045210   03  WS-1475-P1.
045220     05  FILLER                                  VALUE SPACES.
045230       07  FILLER                 PIC X(2).
045240       07  WS-1475-P1-BC          PIC X(8).
045250       07  FILLER                 PIC X(3).
045260       07  WS-1475-P1-PRD-MAJ     PIC X(2).
045270       07  WS-1475-P1-PRD-MIN     PIC X(2).
045280       07  FILLER                 PIC X.
045290       07  WS-1475-P1-PRD-NBR     PIC X(6).
045300       07  WS-1475-P1-PRD-SUF     PIC X.
045310       07  FILLER                 PIC X.
045320       07  WS-1475-P1-PRD-DQ      PIC X(5).
045330       07  FILLER                 PIC X(3).
045340       07  WS-1475-P1-STYLE       PIC X(6).
045350       07  FILLER                 PIC X(3).
045360       07  WS-1475-P1-DESCR       PIC X(21).
045370       07  FILLER                 PIC X(3).
045380       07  WS-1475-P1-GEN-PD      PIC X(2).
045390     05  FILLER                   PIC X          VALUE '/'.
045400     05  FILLER                                  VALUE SPACES.
045410       07  WS-1475-P1-SPC-PD      PIC X(2).
045420       07  FILLER                 PIC X(3).
045430       07  WS-1475-P1-U-BASE      PIC ---,---.99.
045440       07  FILLER                 PIC X(2).
045450       07  WS-1475-P1-U-DELIV     PIC ----.99.
045460       07  FILLER                 PIC X(2).
045470       07  WS-1475-P1-ADDLS.
045480         09  WS-1475-P1-A-QTY     PIC ---,--9.
045490         09  FILLER               PIC X(2).
045500         09  WS-1475-P1-A-BASE    PIC ----.99.
045510         09  FILLER               PIC X(2).
045520         09  WS-1475-P1-A-DELIV   PIC ----.99.
045530     05  FILLER                   PIC X(30)      VALUE SPACES.
045540   03  WS-1967P-C1.
045550     05  FILLER                   PIC X(50)      VALUE
045560             '     BC     BR1   BR2  TC      PRODUCT       DQ   '.
045570     05  FILLER                   PIC X(50)      VALUE
045580             '    COMMENT                                       '.
045590     05  FILLER                   PIC X(51)      VALUE SPACES.
045600   03  WS-1967P-D1.
045610     05  FILLER                   PIC X(50)      VALUE
045620             '  -------- ----- ----- --   ---- ------ -   ----- '.
045630     05  FILLER                   PIC X(50)      VALUE
045640             '    ------------------------------------          '.
045650     05  FILLER                   PIC X(51)      VALUE SPACES.
045660   03  WS-1967P-P1                               VALUE SPACES.
045670     05  FILLER                   PIC X(2).
045680     05  WS-1967P-P1-FI           PIC X(8)BX(5)BX(5)BX(2).
045690     05  FILLER                   PIC X(3).
045700     05  WS-1967P-P1-PROD         PIC X(4)BX(6)BX.
045710     05  FILLER                   PIC X(3).
045720     05  WS-1967P-P1-DQ           PIC X(5).
045730     05  FILLER                   PIC X(5).
045740     05  WS-1967P-P1-COMMENT      PIC X(36).
045750     05  FILLER                   PIC X(61).
045760   03  WS-662P-C1.
045770     05  FILLER                   PIC X(50)      VALUE
045780             '     BC       BR1     BR2   TYPE   EXP CD   EXPENS'.
045790     05  FILLER                   PIC X(50)      VALUE
045800             'E CODE DESCRIPTION                                '.
045810     05  FILLER                   PIC X(51)      VALUE SPACES.
045820   03  WS-662P-D1.
045830     05  FILLER                   PIC X(50)      VALUE
045840             '  --------   -----   -----   --      --     ------'.
045850     05  FILLER                   PIC X(19)      VALUE ALL '-'.
045860     05  FILLER                   PIC X(82)      VALUE SPACES.
045870   03  WS-662P-P1                                VALUE SPACES.
045880     05  FILLER                   PIC X(2).
045890     05  WS-662P-P1-BC            PIC X(8).
045900     05  FILLER                   PIC X(3).
045910     05  WS-662P-P1-PRI-BR        PIC X(5).
045920     05  FILLER                   PIC X(3).
045930     05  WS-662P-P1-SEC-BR        PIC X(5).
045940     05  FILLER                   PIC X(3).
045950     05  WS-662P-P1-BILL-TYPE     PIC X(2).
045960     05  FILLER                   PIC X(6).
045970     05  WS-662P-P1-EXP-CODE      PIC X(2).
045980     05  FILLER                   PIC X(5).
045990     05  WS-662P-P1-EXP-CD-DESCR  PIC X(25).
046000     05  FILLER                   PIC X(82).
046010   03  WS-554-C1A.
046020     05  FILLER                   PIC X(50)      VALUE SPACES.
046030     05  FILLER                   PIC X(50)      VALUE
046040             '                    YYMMDD  INCL    COMPONENT     '.
046050     05  FILLER                   PIC X(51)      VALUE
046060            'ORDER    ACCT/WK   DNCHG  551  CATLG  INTER  ENTRY '.
046070   03  WS-554-C1B.
046080     05  FILLER                   PIC X(50)      VALUE
046090             '  T  HLDCO L1 L2 L3    MBC    L1 L2 L3     BC     '.
046100     05  FILLER                   PIC X(50)      VALUE
046110             'BR1   BR2 TYP  REG   DATE   MEDIA   UPCHARGE    UP'.
046120     05  FILLER                   PIC X(51)      VALUE
046130            'CH LIM   UPCH LIM   LIM   RND   VERS  CATLG  COUNT '.
046140   03  WS-554-D1.
046150     05  FILLER                   PIC X(50)      VALUE
046160             '  -  ----- -- -- --  -------- -- -- --  -------- -'.
046170     05  FILLER                   PIC X(50)      VALUE
046180             '---- ----- --   --  ------  - - -       -      ---'.
046190     05  FILLER                   PIC X(51)      VALUE
046200            '------  ---------    -     -     --     --   ----  '.
046210   03  WS-554-P1                                 VALUE SPACES.
046220     05  FILLER                   PIC X(2).
046230     05  WS-554-P1-REC-TYPE       PIC X.
046240     05  FILLER                   PIC X(2).
046250     05  WS-554-P1-HOLDCO         PIC X(5).
046260     05  FILLER                   PIC X.
046270     05  WS-554-P1-HC-DIV-LVL1    PIC X(2).
046280     05  FILLER                   PIC X.
046290     05  WS-554-P1-HC-DIV-LVL2    PIC X(2).
046300     05  FILLER                   PIC X.
046310     05  WS-554-P1-HC-DIV-LVL3    PIC X(2).
046320     05  FILLER                   PIC X(2).
046330     05  WS-554-P1-MASTER-BC      PIC X(8).
046340     05  FILLER                   PIC X.
046350     05  WS-554-P1-MBC-DIV-LVL1   PIC X(2).
046360     05  FILLER                   PIC X.
046370     05  WS-554-P1-MBC-DIV-LVL2   PIC X(2).
046380     05  FILLER                   PIC X.
046390     05  WS-554-P1-MBC-DIV-LVL3   PIC X(2).
046400     05  FILLER                   PIC X(2).
046410     05  WS-554-P1-BC             PIC X(8).
046420     05  FILLER                   PIC X.
046430     05  WS-554-P1-PRI-BR         PIC X(5).
046440     05  FILLER                   PIC X.
046450     05  WS-554-P1-SEC-BR         PIC X(5).
046460     05  FILLER                   PIC X.
046470     05  WS-554-P1-TYPE           PIC X(2).
046480     05  FILLER                   PIC X(3).
046490     05  WS-554-P1-REGION         PIC X(2).
046500     05  FILLER                   PIC X(2).
046510     05  WS-554-P1-UPDATED        PIC X(6).
046520     05  FILLER                   PIC X(2).
046530     05  WS-554-P1-INCL-MED-1     PIC X.
046540     05  FILLER                   PIC X.
046550     05  WS-554-P1-INCL-MED-2     PIC X.
046560     05  FILLER                   PIC X.
046570     05  WS-554-P1-INCL-MED-3     PIC X.
046580     05  FILLER                   PIC X(7).
046590     05  WS-554-P1-COMPT-UPCH-FLG PIC X.
046600     05  FILLER                   PIC X(6).
046610     05  WS-554-P1-ORD-UP-LIM-X.
046620       07  WS-554-P1-ORD-UP-LIM   PIC ZZ,ZZZ.99.
046630     05  FILLER                   PIC X(2).
046640     05  WS-554-P1-A-WK-UP-LIM-X.
046650       07  WS-554-P1-A-WK-UP-LIM  PIC ZZ,ZZZ.99.
046660     05  FILLER                   PIC X(4).
046670     05  WS-554-P1-ORD-DN-LIM-FLG PIC X.
046680     05  FILLER                   PIC X(5).
046690     05  WS-554-P1-RND-551-UP-OPT PIC X.
046700     05  FILLER                   PIC X(5).
046710     05  WS-554-P1-MSRP-CAT-VERS  PIC X(2).
046720     05  FILLER                   PIC X(5).
046730     05  WS-554-P1-INTERNET-CAT-V PIC X(2).
046740     05  FILLER                   PIC X(3).
046750     05  WS-554-P1-ENTRY-COUNT    PIC ZZZ9.
046760     05  FILLER                   PIC X(2).
046770   03  WS-554-C2A.
046780     05  FILLER                   PIC X(50)      VALUE
046790             '     000000000000000000000000000000000001111111111'.
046800     05  FILLER                   PIC X(50)      VALUE
046810             '11111111111111111111111111244444444444444444444444'.
046820     05  FILLER                   PIC X(50)      VALUE
046830             '4444444444444555555555555555555555555555555555555 '.
046840   03  WS-554-C2AX.
046850     05  FILLER                   PIC X(50)      VALUE
046860             '     666666666666666666666666666666666666777777777'.
046870     05  FILLER                   PIC X(50)      VALUE
046880             '77777777777777777777777777788888888888888888888888'.
046890     05  FILLER                   PIC X(50)      VALUE
046900             '8888888888888999999999999999999999999999999999999 '.
046910   03  WS-554-C2B.
046920     05  FILLER                   PIC X(50)      VALUE
046930             '     ABCDEFGHIJKLMNOPQRSTUVWXYZ123456789ABCDEFGHIJ'.
046940     05  FILLER                   PIC X(50)      VALUE
046950             'KLMNOPQRSTUVWXYZ01234567890ABCDEFGHIJKLMNOPQRSTUVW'.
046960     05  FILLER                   PIC X(50)      VALUE
046970             'XYZ0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789 '.
046980   03  WS-554-C2BX.
046990     05  FILLER                   PIC X(50)      VALUE
047000             '     ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789ABCDEFGHI'.
047010     05  FILLER                   PIC X(50)      VALUE
047020             '0KLMNOPQRSTUVWXYZ0123456789ABCDEFGHIJKLMNOPQRSTUVW'.
047030     05  FILLER                   PIC X(50)      VALUE
047040             'XYZ0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789 '.
047050   03  WS-554-D2.
047060     05  FILLER                   PIC X(5)       VALUE SPACES.
047070     05  FILLER                   PIC X(144)     VALUE ALL '-'.
047080     05  FILLER                   PIC X(2)       VALUE SPACE.
047090   03  WS-554-P2                                 VALUE SPACES.
047100     05  FILLER                   PIC X(5).
047110     05  WS-554-P2-ORD-TYP-INCL   PIC X(144).
047120     05  FILLER                   PIC X(2).
047130   03  WS-554-P2X                                VALUE SPACES.
047140     05  FILLER                   PIC X(5).
047150     05  WS-554-P2X-ORD-TYP-INCL  PIC X(144).
047160     05  FILLER                   PIC X(2).
047170   03  WS-554-C3.
047180     05  FILLER                   PIC X(50)      VALUE
047190             '       PROD CODE   DESC QTY  UNITS  REORDER  AOE  '.
047200     05  FILLER                   PIC X(50)      VALUE
047210             ' BEFORE   ROUND       STEP 1           STEP 2     '.
047220     05  FILLER                   PIC X(51)      VALUE
047230            '      STEP 3          CEILING           FLOOR      '.
047240   03  WS-554-D3.
047250     05  FILLER                   PIC X(50)      VALUE
047260             '     -------------   -----    --       -      -   '.
047270     05  FILLER                   PIC X(50)      VALUE
047280             '   -        -     --------------   -------------- '.
047290     05  FILLER                   PIC X(51)      VALUE
047300            '  --------------   --------------   -------------- '.
047310   03  WS-554-P3A                                VALUE SPACES.
047320     05  FILLER                   PIC X(5).
047330     05  WS-554-P3A-PROD-CODE     PIC X(13).
047340     05  FILLER                   PIC X(3).
047350     05  WS-554-P3A-DESCR-QTY     PIC X(5).
047360     05  FILLER                   PIC X(4).
047370     05  WS-554-P3A-KEY-UNITS     PIC X(2).
047380     05  FILLER                   PIC X(7).
047390     05  WS-554-P3A-REORD-FLAG    PIC X.
047400     05  FILLER                   PIC X(6).
047410     05  WS-554-P3A-AOE-FLAG      PIC X.
047420     05  FILLER                   PIC X(6).
047430     05  WS-554-P3A-RSL-B4-UPCH   PIC X.
047440     05  FILLER                   PIC X(8).
047450     05  WS-554-P3A-ROUNDING      PIC X.
047460     05  FILLER                   PIC X(5).
047470     05  WS-554-P3A-N1-BASIS      PIC X.
047480     05  FILLER                   PIC X.
047490     05  WS-554-P3A-N1-RATE-X.
047500       07  WS-554-P3A-N1-RATE-D   PIC $$$,$$$.99-.
047510       07  WS-554-P3A-N1-RATE-P   REDEFINES
047520           WS-554-P3A-N1-RATE-D   PIC ZZZ,ZZZ.99-.
047530       07  WS-554-P3A-N1-PCT-SGN  PIC X.
047540     05  FILLER                   PIC X(3).
047550     05  WS-554-P3A-N2-BASIS      PIC X.
047560     05  FILLER                   PIC X.
047570     05  WS-554-P3A-N2-RATE-X.
047580       07  WS-554-P3A-N2-RATE-D   PIC $$$,$$$.99-.
047590       07  WS-554-P3A-N2-RATE-P   REDEFINES
047600           WS-554-P3A-N2-RATE-D   PIC ZZZ,ZZZ.99-.
047610       07  WS-554-P3A-N2-PCT-SGN  PIC X.
047620     05  FILLER                   PIC X(3).
047630     05  WS-554-P3A-N3-BASIS      PIC X.
047640     05  FILLER                   PIC X.
047650     05  WS-554-P3A-N3-RATE-X.
047660       07  WS-554-P3A-N3-RATE-D   PIC $$$,$$$.99-.
047670       07  WS-554-P3A-N3-RATE-P   REDEFINES
047680           WS-554-P3A-N3-RATE-D   PIC ZZZ,ZZZ.99-.
047690       07  WS-554-P3A-N3-PCT-SGN  PIC X.
047700     05  FILLER                   PIC X(3).
047710     05  WS-554-P3A-C-BASIS       PIC X.
047720     05  FILLER                   PIC X.
047730     05  WS-554-P3A-C-RATE-X.
047740       07  WS-554-P3A-C-RATE-D    PIC $$$,$$$.99-.
047750       07  WS-554-P3A-C-RATE-P    REDEFINES
047760           WS-554-P3A-C-RATE-D    PIC ZZZ,ZZZ.99-.
047770       07  WS-554-P3A-C-PCT-SGN   PIC X.
047780     05  FILLER                   PIC X(3).
047790     05  WS-554-P3A-F-BASIS       PIC X.
047800     05  FILLER                   PIC X.
047810     05  WS-554-P3A-F-RATE-X.
047820       07  WS-554-P3A-F-RATE-D    PIC $$$,$$$.99-.
047830       07  WS-554-P3A-F-RATE-P    REDEFINES
047840           WS-554-P3A-F-RATE-D    PIC ZZZ,ZZZ.99-.
047850       07  WS-554-P3A-F-PCT-SGN   PIC X.
047860   03  WS-554-P3B                                VALUE SPACES.
047870     05  FILLER                   PIC X(11).
047880     05  WS-554-P3B-TABLE.
047890       07  WS-554-P3B-ENTRY       OCCURS 9 TIMES
047900                                  INDEXED BY IX-WS-554-P3B.
047910         09  WS-554-P3B-DESCR     PIC X(11).
047920         09  FILLER               PIC X(4).
047930     05  FILLER                   PIC X(5).
047940   03  WS-8935-C1A.
047950     05  FILLER                   PIC X(50)      VALUE
047960             '  ---- 8934 RECORD KEY -----    LAST   ENTRY  ----'.
047970     05  FILLER                   PIC X(50)      VALUE
047980             '--- MATCH FIELDS -------  PROD    ENH            -'.
047990     05  FILLER                   PIC X(51)      VALUE
048000            '----- DISCOUNT BY PRICE OF ANOTHER PRODUCT ------- '.
048010   03  WS-8935-C1B.
048020     05  FILLER                   PIC X(50)      VALUE
048030             '   HC     MBC       BC   EXP   UPDATE  COUNT   PRO'.
048040     05  FILLER                   PIC X(50)      VALUE
048050             'DUCT    IMP QTY  REO O/C  INSTR  INSTR    RATE    '.
048060     05  FILLER                   PIC X(51)      VALUE
048070            'PROD CODE   D Q   CI/S1  DESCRIPTION               '.
048080   03  WS-8935-D1.
048090     05  FILLER                   PIC X(50)      VALUE
048100             '  ----- -------- -------- --  --------  ---   ----'.
048110     05  FILLER                   PIC X(50)      VALUE
048120             '------  -------   -   -     -      -   --------  -'.
048130     05  FILLER                   PIC X(51)      VALUE
048140            '---------- ----- ------- ------------------------- '.
048150   03  WS-8935-P1                                VALUE SPACES.
048160     05  FILLER                   PIC X(2).
048170     05  WS-8935-P1-003-043.
048180       07  WS-8935-P1-8934-KEY-HC PIC X(5).
048190       07  FILLER                 PIC X.
048200       07  WS-8935-P1-8934-KEY-MBC PIC X(8).
048210       07  FILLER                 PIC X.
048220       07  WS-8935-P1-8934-KEY-BC PIC X(8).
048230       07  FILLER                 PIC X.
048240       07  WS-8935-P1-8934-KEY-EXP PIC X(2).
048250       07  FILLER                 PIC X(2).
048260       07  WS-8935-P1-LAST-UPDATE PIC X(8).
048270       07  FILLER                 PIC X(2).
048280       07  WS-8935-P1-ENTRY-COUNT PIC ZZ9.
048290     05  FILLER  REDEFINES  WS-8935-P1-003-043.
048300       07  FILLER                 PIC X(16).
048310       07  WS-8935-P1-EXP-DESCR   PIC X(25).
048320     05  FILLER                   PIC X(3).
048330     05  WS-8935-P1-MATCH-PROD    PIC X(10).
048340     05  FILLER                   PIC X(2).
048350     05  WS-8935-P1-MATCH-IMP-QTY PIC Z(6)9.
048360     05  FILLER                   PIC X(3).
048370     05  WS-8935-P1-MATCH-REORD   PIC X.
048380     05  FILLER                   PIC X(3).
048390     05  WS-8935-P1-MATCH-ORD-CH  PIC X.
048400     05  FILLER                   PIC X(5).
048410     05  WS-8935-P1-PROD-INSTR    PIC X.
048420     05  FILLER                   PIC X(6).
048430     05  WS-8935-P1-ENH-INSTR     PIC X.
048440     05  FILLER                   PIC X(3).
048450     05  WS-8935-P1-RATE          PIC ----.99.
048460     05  WS-8935-P1-PERCENT-SIGN  PIC X.
048470     05  FILLER                   PIC X(2).
048480     05  WS-8935-P1-DISCT-FEB     PIC X(11).
048490     05  FILLER                   PIC X.
048500     05  WS-8935-P1-DISCT-DQ      PIC X(5).
048510     05  FILLER                   PIC X.
048520     05  WS-8935-P1-DISCT-CI-S1   PIC X(7).
048530     05  FILLER                   PIC X.
048540     05  WS-8935-P1-DISCT-DESCR   PIC X(25).
048550   03  WS-225P-C1.
048560     05  FILLER                   PIC X(50)      VALUE
048570             '   HC      BC     ORDER SCREEN UNITIZATION  ORDER '.
048580     05  FILLER                   PIC X(50)      VALUE
048590             'SCREEN BUNDLING  BILLING SERVICE BUNDLING         '.
048600     05  FILLER                   PIC X(51)      VALUE SPACE.
048610   03  WS-225P-D1.
048620     05  FILLER                   PIC X(50)      VALUE
048630             '  ----- --------  ------------------------  ------'.
048640     05  FILLER                   PIC X(50)      VALUE
048650             '---------------  ------------------------         '.
048660     05  FILLER                   PIC X(51)      VALUE SPACE.
048670   03  WS-225P-P1                                VALUE SPACE.
048680     05  FILLER                   PIC X(2).
048690     05  WS-225P-P1-HC            PIC X(5).
048700     05  FILLER                   PIC X.
048710     05  WS-225P-P1-BC            PIC X(8).
048720     05  FILLER                   PIC X(2).
048730     05  WS-225P-P1-OS-U-TXT      PIC X(15).
048740     05  FILLER                   PIC X(11).
048750     05  WS-225P-P1-OS-B-TXT      PIC X(15).
048760     05  FILLER                   PIC X(8).
048770     05  WS-225P-P1-BS-B-TXT      PIC X(15).
048780     05  FILLER                   PIC X(69).
048790   03  WS-1921P-C1.
048800     05  FILLER                   PIC X(50)      VALUE
048810             '   INST TYPE     NUMBER                           '.
048820     05  FILLER                   PIC X(101)     VALUE SPACE.
048830   03  WS-1921P-D1.
048840     05  FILLER                   PIC X(50)      VALUE
048850             '       -        --------                          '.
048860     05  FILLER                   PIC X(101)     VALUE SPACE.
048870   03  WS-1921P-P1                               VALUE SPACE.
048880     05  FILLER                   PIC X(7).
048890     05  WS-1921P-P1-INST-TYPE    PIC X.
048900     05  FILLER                   PIC X(8).
048910     05  WS-1921P-P1-INST-NBR     PIC X(8).
048920     05  FILLER                   PIC X(127).
048930   03  WS-506P-C1.
048940     05  FILLER                   PIC X(50)      VALUE
048950             '   HC    DIVS    MBC     DIVS     BC    BRCH    ST'.
048960     05  FILLER                   PIC X(50)      VALUE
048970             'ART DATE    END DATE    LIMIT                     '.
048980     05  FILLER                   PIC X(51)      VALUE SPACE.
048990   03  WS-506P-D1.
049000     05  FILLER                   PIC X(50)      VALUE
049010             '  ----- ------ -------- ------ -------- -----   --'.
049020     05  FILLER                   PIC X(50)      VALUE
049030             '--------   ----------   -----                     '.
049040     05  FILLER                   PIC X(51)      VALUE SPACE.
049050   03  WS-506P-P1                                VALUE SPACE.
049060     05  FILLER                   PIC X(2).
049070     05  WS-506P-P1-HC            PIC X(5).
049080     05  FILLER                   PIC X.
049090     05  WS-506P-P1-HC-DIVS       PIC X(6).
049100     05  FILLER                   PIC X.
049110     05  WS-506P-P1-MBC           PIC X(8).
049120     05  FILLER                   PIC X.
049130     05  WS-506P-P1-MBC-DIVS      PIC X(6).
049140     05  FILLER                   PIC X.
049150     05  WS-506P-P1-BC            PIC X(8).
049160     05  FILLER                   PIC X.
049170     05  WS-506P-P1-PRI-BR        PIC X(5).
049180     05  FILLER                   PIC X(3).
049190     05  WS-506P-P1-START-DATE    PIC X(10).
049200     05  FILLER                   PIC X(3).
049210     05  WS-506P-P1-END-DATE      PIC X(10).
049220     05  FILLER                   PIC X(3).
049230     05  WS-506P-P1-LIMIT         PIC X(5).
049240     05  FILLER                   PIC X(72).
049250   03  WS-552-C1.
049260     05  FILLER                   PIC X(50)      VALUE
049270             '  T  HLDCO L1 L2 L3    MBC    L1 L2 L3     BC     '.
049280     05  FILLER                   PIC X(50)      VALUE
049290             'BR1   BR2 TYPE    REGION     DATE    STD DISCT KEY'.
049300     05  FILLER                   PIC X(51)      VALUE
049310            '   SCI TRADE-OFF KEY   ENTRY COUNT                '.
049320   03  WS-552-D1.
049330     05  FILLER                   PIC X(50)      VALUE
049340             '  -  ----- -- -- --  -------- -- -- --  -------- -'.
049350     05  FILLER                   PIC X(50)      VALUE
049360             '---- ----- --       --      ------       ----     '.
049370     05  FILLER                   PIC X(51)      VALUE
049380            '         ----             ----                     '.
049390   03  WS-552-P1                                 VALUE SPACE.
049400     05  FILLER                   PIC X(2).
049410     05  WS-552-P1-REC-TYPE       PIC X.
049420     05  FILLER                   PIC X(2).
049430     05  WS-552-P1-HOLDCO         PIC X(5).
049440     05  FILLER                   PIC X.
049450     05  WS-552-P1-HC-DIV-L1      PIC X(2).
049460     05  FILLER                   PIC X.
049470     05  WS-552-P1-HC-DIV-L2      PIC X(2).
049480     05  FILLER                   PIC X.
049490     05  WS-552-P1-HC-DIV-L3      PIC X(2).
049500     05  FILLER                   PIC X(2).
049510     05  WS-552-P1-MASTER-BC      PIC X(8).
049520     05  FILLER                   PIC X.
049530     05  WS-552-P1-MBC-DIV-L1     PIC X(2).
049540     05  FILLER                   PIC X.
049550     05  WS-552-P1-MBC-DIV-L2     PIC X(2).
049560     05  FILLER                   PIC X.
049570     05  WS-552-P1-MBC-DIV-L3     PIC X(2).
049580     05  FILLER                   PIC X(2).
049590     05  WS-552-P1-BC             PIC X(8).
049600     05  FILLER                   PIC X.
049610     05  WS-552-P1-PRI-BR         PIC X(5).
049620     05  FILLER                   PIC X.
049630     05  WS-552-P1-SEC-BR         PIC X(5).
049640     05  FILLER                   PIC X.
049650     05  WS-552-P1-BILL-TYPE      PIC X(2).
049660     05  FILLER                   PIC X(7).
049670     05  WS-552-P1-REGION         PIC X(2).
049680     05  FILLER                   PIC X(6).
049690     05  WS-552-P1-UPDATE-DT      PIC X(6).
049700     05  FILLER                   PIC X(7).
049710     05  WS-552-P1-STD-DISCT-KEY  PIC X(4).
049720     05  FILLER                   PIC X(14).
049730     05  WS-552-P1-SCI-TRADE-KEY  PIC X(4).
049740     05  FILLER                   PIC X(13).
049750     05  WS-552-P1-ENTRY-CT       PIC ZZZ9.
049760     05  FILLER                   PIC X(21).
049770   03  WS-552-C2.
049780     05  FILLER                   PIC X(50)      VALUE
049790             '     ENT TYP     PROD CODE    DESC QTY   MAIL METH'.
049800     05  FILLER                   PIC X(50)      VALUE
049810             '   PRICE SRC   C1128 OVR   ADJ OPT   PR DESIG     '.
049820     05  FILLER                   PIC X(51)      VALUE ' RATE   '.
049830   03  WS-552-D2.
049840     05  FILLER                   PIC X(50)      VALUE
049850             '        -      -------------   -----         -    '.
049860     05  FILLER                   PIC X(50)      VALUE
049870             '       -           -          -         --      --'.
049880     05  FILLER                   PIC X(51)      VALUE '------- '.
049890   03  WS-552-P2                                 VALUE SPACES.
049900     05  FILLER                   PIC X(8).
049910     05  WS-552-P2-ENT-TYP        PIC X.
049920     05  FILLER                   PIC X(6).
049930     05  WS-552-P2-PROD-CODE      PIC X(13).
049940     05  FILLER                   PIC X(3).
049950     05  WS-552-P2-DESCR-QTY      PIC X(5).
049960     05  FILLER                   PIC X(9).
049970     05  WS-552-P2-MAIL-METH      PIC X.
049980     05  FILLER                   PIC X(11).
049990     05  WS-552-P2-PRICE-SRCE     PIC X.
050000     05  FILLER                   PIC X(11).
050010     05  WS-552-P2-C1128-OVERRIDE PIC X.
050020     05  FILLER                   PIC X(10).
050030     05  WS-552-P2-ADJ-OPT        PIC X.
050040     05  FILLER                   PIC X(9).
050050     05  WS-552-P2-PR-DESIG       PIC X(2).
050060     05  FILLER                   PIC X(6).
050070     05  WS-552-P2-RATE-X.
050080       07  WS-552-P2-RATE-D       PIC $$$$.99-.
050090       07  WS-552-P2-RATE-P REDEFINES WS-552-P2-RATE-D
050100                                  PIC ZZZZ.99-.
050110       07  WS-552-P2-PCT-SGN      PIC X.
050120     05  FILLER                   PIC X(44).
050130   03  WS-552-C3.
050140     05  FILLER                   PIC X(50)      VALUE
050150             '       PROD CODE   DESC QTY   REORDER   UNITS   OR'.
050160     05  FILLER                   PIC X(50)      VALUE
050170             'D CHNL    C1128 OVERRIDE      STEP 1        STEP 2'.
050180     05  FILLER                   PIC X(51)      VALUE
050190            '        STEP 3                                     '.
050200   03  WS-552-D3.
050210     05  FILLER                   PIC X(50)      VALUE
050220             '     -------------   -----       -       --       '.
050230     05  FILLER                   PIC X(50)      VALUE
050240             ' -              -           -----------   --------'.
050250     05  FILLER                   PIC X(51)      VALUE
050260            '---   -----------                                  '.
050270   03  WS-552-P3                                 VALUE SPACES.
050280     05  FILLER                   PIC X(5).
050290     05  WS-552-P3-PROD-CODE      PIC X(13).
050300     05  FILLER                   PIC X(3).
050310     05  WS-552-P3-DESCR-QTY      PIC X(5).
050320     05  FILLER                   PIC X(7).
050330     05  WS-552-P3-REORD-FLG      PIC X.
050340     05  FILLER                   PIC X(7).
050350     05  WS-552-P3-UNITS          PIC X(2).
050360     05  FILLER                   PIC X(8).
050370     05  WS-552-P3-ORD-CHNL       PIC X.
050380     05  FILLER                   PIC X(14).
050390     05  WS-552-P3-C1128-OVERRIDE PIC X.
050400     05  FILLER                   PIC X(11).
050410     05  WS-552-P3-S1-BASIS       PIC X.
050420     05  FILLER                   PIC X.
050430     05  WS-552-P3-S1-RATE-X.
050440       07  WS-552-P3-S1-RATE-D    PIC $$$$.99-.
050450       07  WS-552-P3-S1-RATE-P REDEFINES WS-552-P3-S1-RATE-D
050460                                  PIC ZZZZ.99-.
050470       07  WS-552-P3-S1-PCT-SGN   PIC X.
050480     05  FILLER                   PIC X(3).
050490     05  WS-552-P3-S2-BASIS       PIC X.
050500     05  FILLER                   PIC X.
050510     05  WS-552-P3-S2-RATE-X.
050520       07  WS-552-P3-S2-RATE-D    PIC $$$$.99-.
050530       07  WS-552-P3-S2-RATE-P REDEFINES WS-552-P3-S2-RATE-D
050540                                  PIC ZZZZ.99-.
050550       07  WS-552-P3-S2-PCT-SGN   PIC X.
050560     05  FILLER                   PIC X(3).
050570     05  WS-552-P3-S3-BASIS       PIC X.
050580     05  FILLER                   PIC X.
050590     05  WS-552-P3-S3-RATE-X.
050600       07  WS-552-P3-S3-RATE-D    PIC $$$$.99-.
050610       07  WS-552-P3-S3-RATE-P REDEFINES WS-552-P3-S3-RATE-D
050620                                  PIC ZZZZ.99-.
050630       07  WS-552-P3-S3-PCT-SGN   PIC X.
050640     05  FILLER                   PIC X(34).
050650   03  WS-979-C1.
050660     05  FILLER                   PIC X(50)      VALUE
050670             '  HLDCO L1 L2 L3   MBC    L1 L2 L3    BC     BR1  '.
050680     05  FILLER                   PIC X(50)      VALUE
050690             ' BR2  TC P    SLSREP#   SALES REP NAME            '.
050700     05  FILLER                   PIC X(51)      VALUE
050710            '            PROMO PR FLAG    ENTRY COUNT           '.
050720   03  WS-979-D1.
050730     05  FILLER                   PIC X(50)      VALUE
050740             '  ----- -- -- -- -------- -- -- -- -------- ----- '.
050750     05  FILLER                   PIC X(50)      VALUE
050760             '----- -- -    -------   --------------------------'.
050770     05  FILLER                   PIC X(51)      VALUE
050780            '--------          -              ---               '.
050790   03  WS-979-P1                                 VALUE SPACES.
050800     05  FILLER                   PIC X(2).
050810     05  WS-979-P1-HOLDCO         PIC X(5).
050820     05  FILLER                   PIC X.
050830     05  WS-979-P1-HC-L1          PIC X(2).
050840     05  FILLER                   PIC X.
050850     05  WS-979-P1-HC-L2          PIC X(2).
050860     05  FILLER                   PIC X.
050870     05  WS-979-P1-HC-L3          PIC X(2).
050880     05  FILLER                   PIC X.
050890     05  WS-979-P1-MASTER-BC      PIC X(8).
050900     05  FILLER                   PIC X.
050910     05  WS-979-P1-MBC-L1         PIC X(2).
050920     05  FILLER                   PIC X.
050930     05  WS-979-P1-MBC-L2         PIC X(2).
050940     05  FILLER                   PIC X.
050950     05  WS-979-P1-MBC-L3         PIC X(2).
050960     05  FILLER                   PIC X.
050970     05  WS-979-P1-BC             PIC X(8).
050980     05  FILLER                   PIC X.
050990     05  WS-979-P1-PRI-BR         PIC X(5).
051000     05  FILLER                   PIC X.
051010     05  WS-979-P1-SEC-BR         PIC X(5).
051020     05  FILLER                   PIC X.
051030     05  WS-979-P1-BILL-TYPE      PIC X(2).
051040     05  FILLER                   PIC X.
051050     05  WS-979-P1-PROG-CD        PIC X.
051060     05  FILLER                   PIC X(4).
051070     05  WS-979-P1-SLS-REP-NBR    PIC X(7).
051080     05  FILLER                   PIC X(3).
051090     05  WS-979-P1-SLS-REP-NAME   PIC X(34).
051100     05  FILLER                   PIC X(10).
051110     05  WS-979-P1-PROMO-PR-FLG   PIC X.
051120     05  FILLER                   PIC X(14).
051130     05  WS-979-P1-ENTRY-CT       PIC ZZ9.
051140     05  FILLER                   PIC X(15).
051150   03  WS-979-C2A.
051160     05  FILLER                   PIC X(50)      VALUE
051170             '     ENTRY      - - - - - - - - - - - - - - - - - '.
051180     05  FILLER                   PIC X(50)      VALUE
051190             '- - - - MATCH FIELDS - - - - - - - - - - - - - - -'.
051200     05  FILLER                   PIC X(51)      VALUE
051210            ' - - - - - -         - - ASSIGNMENTS - -           '.
051220   03  WS-979-C2B.
051230     05  FILLER                   PIC X(50)      VALUE
051240             '      NBR      BR1   BR2  TYPE  PROD CODE    D Q '.
051250     05  FILLER                   PIC X(50)      VALUE
051260             ' REORDER  AOE  PR UNITS  PURCHASE ORDER  SEP INV  '.
051270     05  FILLER                   PIC X(51)      VALUE
051280            'MEDIUM  EXP CR     PROGRAM CODE  CALC CODE         '.
051290   03  WS-979-D2.
051300     05  FILLER                   PIC X(50)      VALUE
051310             '      ---     ----- -----  --  ------------- -----'.
051320     05  FILLER                   PIC X(50)      VALUE
051330             '    -      -      --     ---------------    --    '.
051340     05  FILLER                   PIC X(51)      VALUE
051350            '   -       -             -           --            '.
051360   03  WS-979-P2                                 VALUE SPACES.
051370     05  FILLER                   PIC X(6).
051380     05  WS-979-P2-ENTRY-NBR      PIC ZZ9.
051390     05  FILLER                   PIC X(5).
051400     05  WS-979-P2-M-PRI-BR       PIC X(5).
051410     05  FILLER                   PIC X.
051420     05  WS-979-P2-M-SEC-BR       PIC X(5).
051430     05  FILLER                   PIC X(2).
051440     05  WS-979-P2-M-BILL-TYPE    PIC X(2).
051450     05  FILLER                   PIC X(2).
051460     05  WS-979-P2-M-PROD-CODE    PIC X(13).
051470     05  FILLER                   PIC X.
051480     05  WS-979-P2-M-DESCR-QTY    PIC X(5).
051490     05  FILLER                   PIC X(4).
051500     05  WS-979-P2-M-REORD-FLG    PIC X.
051510     05  FILLER                   PIC X(6).
051520     05  WS-979-P2-M-AOE-FLG      PIC X.
051530     05  FILLER                   PIC X(6).
051540     05  WS-979-P2-M-PR-UNITS     PIC X(2).
051550     05  FILLER                   PIC X(5).
051560     05  WS-979-P2-M-PURCH-ORD    PIC X(15).
051570     05  FILLER                   PIC X(4).
051580     05  WS-979-P2-M-SEP-INV      PIC X(2).
051590     05  FILLER                   PIC X(7).
051600     05  WS-979-P2-M-BIL-MED      PIC X.
051610     05  FILLER                   PIC X(7).
051620     05  WS-979-P2-APP-EXP-CR-FLG PIC X.
051630     05  FILLER                   PIC X(13).
051640     05  WS-979-P2-ASSGN-PROG-CD  PIC X.
051650     05  FILLER                   PIC X(11).
051660     05  WS-979-P2-ASSGN-CALC-CD  PIC X(2).
051670     05  FILLER                   PIC X(12).
051680   03  WS-979-C3A.
051690     05  FILLER                   PIC X(50)      VALUE
051700             '                                                  '.
051710     05  FILLER                   PIC X(50)      VALUE
051720             '            START   END                           '.
051730     05  FILLER                   PIC X(51)      VALUE
051740            '         LIMIT    LIMIT    MET     RPT-F  RPT-LVLS '.
051750   03  WS-979-C3B.
051760     05  FILLER                   PIC X(50)      VALUE
051770             '  HLDCO L1 L2 L3   MBC    L1 L2 L3    BC     BR1  '.
051780     05  FILLER                   PIC X(50)      VALUE
051790             ' BR2  TC P  YYMMDD YYMMDD   PROGRAM NAME          '.
051800     05  FILLER                   PIC X(51)      VALUE
051810            '  METHD  TYPE     $ OR #  YYMMDD  FI  PRT INST PRD '.
051820   03  WS-979-D3.
051830     05  FILLER                   PIC X(50)      VALUE
051840             '  ----- -- -- -- -------- -- -- -- -------- ----- '.
051850     05  FILLER                   PIC X(50)      VALUE
051860             '----- -- -  ------ ------ ------------------------'.
051870     05  FILLER                   PIC X(51)      VALUE
051880            '-   -   ------- --------- ------   -   -   --  --  '.
051890   03  WS-979-P3                                 VALUE SPACES.
051900     05  FILLER                   PIC X(2).
051910     05  WS-979-P3-HOLDCO         PIC X(5).
051920     05  FILLER                   PIC X.
051930     05  WS-979-P3-HC-L1          PIC X(2).
051940     05  FILLER                   PIC X.
051950     05  WS-979-P3-HC-L2          PIC X(2).
051960     05  FILLER                   PIC X.
051970     05  WS-979-P3-HC-L3          PIC X(2).
051980     05  FILLER                   PIC X.
051990     05  WS-979-P3-MASTER-BC      PIC X(8).
052000     05  FILLER                   PIC X.
052010     05  WS-979-P3-MBC-L1         PIC X(2).
052020     05  FILLER                   PIC X.
052030     05  WS-979-P3-MBC-L2         PIC X(2).
052040     05  FILLER                   PIC X.
052050     05  WS-979-P3-MBC-L3         PIC X(2).
052060     05  FILLER                   PIC X.
052070     05  WS-979-P3-BC             PIC X(8).
052080     05  FILLER                   PIC X.
052090     05  WS-979-P3-PRI-BR         PIC X(5).
052100     05  FILLER                   PIC X.
052110     05  WS-979-P3-SEC-BR         PIC X(5).
052120     05  FILLER                   PIC X.
052130     05  WS-979-P3-BILL-TYPE      PIC X(2).
052140     05  FILLER                   PIC X.
052150     05  WS-979-P3-PROG-CD        PIC X.
052160     05  FILLER                   PIC X(2).
052170     05  WS-979-P3-START-DATE     PIC X(6).
052180     05  FILLER                   PIC X.
052190     05  WS-979-P3-END-DATE       PIC X(6).
052200     05  FILLER                   PIC X.
052210     05  WS-979-P3-PROG-NAME      PIC X(25).
052220     05  FILLER                   PIC X(3).
052230     05  WS-979-P3-METHOD         PIC X.
052240     05  FILLER                   PIC X(3).
052250     05  WS-979-P3-LIM-TYPE       PIC X(7).
052260     05  FILLER                   PIC X.
052270     05  WS-979-P3-LIMIT          PIC Z,ZZZ,ZZ9.
052280     05  FILLER                   PIC X.
052290     05  WS-979-P3-LIM-MET-DATE   PIC X(6).
052300     05  FILLER                   PIC X(3).
052310     05  WS-979-P3-FI-RPT-FLG     PIC X.
052320     05  FILLER                   PIC X(3).
052330     05  WS-979-P3-PRT-RPT-FLG    PIC X.
052340     05  FILLER                   PIC X(3).
052350     05  WS-979-P3-INST-RPT-LVL   PIC X(2).
052360     05  FILLER                   PIC X(2).
052370     05  WS-979-P3-PROD-RPT-LVL   PIC X(2).
052380     05  FILLER                   PIC X(2).
052390   03  WS-979-C4.
052400     05  FILLER                   PIC X(50)      VALUE
052410             '                        CR PROD NBR+SFX    CREDIT '.
052420     05  FILLER                   PIC X(50)      VALUE
052430             'ACCOUNT NBR          TOTALS AS OF: YYMMDD        D'.
052440     05  FILLER                   PIC X(51)      VALUE
052450            'OLLARS      UNITS     ORDERS           ENTRY COUNT '.
052460   03  WS-979-D4.
052470     05  FILLER                   PIC X(50)      VALUE
052480             '                            -------       --------'.
052490     05  FILLER                   PIC X(50)      VALUE
052500             '------------                       ------ --------'.
052510     05  FILLER                   PIC X(51)      VALUE
052520            '------ ---------- ----------               ---     '.
052530   03  WS-979-P4                                 VALUE SPACES.
052540     05  FILLER                   PIC X(28).
052550     05  WS-979-P4-CR-PROD-7-13   PIC X(7).
052560     05  FILLER                   PIC X(7).
052570     05  WS-979-P4-CR-ACCT-NBR    PIC X(20).
052580     05  FILLER                   PIC X(23).
052590     05  WS-979-P4-DATE-OF-TTLS   PIC X(6).
052600     05  FILLER                   PIC X.
052610     05  WS-979-P4-DLRS-TTL       PIC $$,$$$,$$$.99-.
052620     05  FILLER                   PIC X.
052630     05  WS-979-P4-UNITS-TTL      PIC Z,ZZZ,ZZ9-.
052640     05  FILLER                   PIC X.
052650     05  WS-979-P4-ORDS-TTL       PIC Z,ZZZ,ZZ9-.
052660     05  FILLER                   PIC X(15).
052670     05  WS-979-P4-ENTRY-CT       PIC ZZ9.
052680     05  FILLER                   PIC X(5).
052690   03  WS-979-C5.
052700     05  FILLER                   PIC X(50)      VALUE
052710             '     ENTRY NBR   CALC CODE   BASIS CODE      RATE '.
052720     05  FILLER                   PIC X(50)      VALUE
052730             '    RESALE PASS-THRU                              '.
052740     05  FILLER                   PIC X(51)      VALUE SPACES.
052750   03  WS-979-D5.
052760     05  FILLER                   PIC X(50)      VALUE
052770             '        ---          --           -       --------'.
052780     05  FILLER                   PIC X(50)      VALUE
052790             '-          -                                      '.
052800     05  FILLER                   PIC X(51)      VALUE SPACES.
052810   03  WS-979-P5                                 VALUE SPACES.
052820     05  FILLER                   PIC X(8).
052830     05  WS-979-P5-ENTRY-NBR      PIC ZZ9.
052840     05  FILLER                   PIC X(10).
052850     05  WS-979-P5-CALC-CD        PIC X(2).
052860     05  FILLER                   PIC X(11).
052870     05  WS-979-P5-BASIS-CD       PIC X.
052880     05  FILLER                   PIC X(7).
052890     05  WS-979-P5-RATE-X.
052900       07  WS-979-P5-RATE-D       PIC $$$$.99-.
052910       07  WS-979-P5-RATE-P REDEFINES WS-979-P5-RATE-D
052920                                  PIC ZZZZ.99-.
052930       07  WS-979-P5-PCT-SGN      PIC X.
052940     05  FILLER                   PIC X(10).
052950     05  WS-979-P5-RSL-PASS-FLG   PIC X.
052960     05  FILLER                   PIC X(89).
052970   03  WS-1840-C1.
052980     05  FILLER                   PIC X(50)      VALUE
052990             'BANKCODE EXPCD PROGRAMID PROGRAM NAME             '.
053000   03  WS-1840-D1.
053010     05  FILLER                   PIC X(50)      VALUE
053020             '-------- --    --------- -------------------------'.
053030   03  WS-1840-P1.
053040     05  WS-1840-PI-BANK-CODE     PIC X(8).
053050     05  FILLER                   PIC X.
053060     05  WS-1840-PI-EXPENSE-CODE  PIC X(2).
053070     05  FILLER                   PIC X(4).
053080     05  WS-1840-PI-PROGRAM-ID    PIC X(9).
053090     05  FILLER                   PIC X.
053100     05  WS-1840-PI-PROGRAM-NAME  PIC X(25).
053110   03  WS-1907P-C1.
053120     05  FILLER                   PIC X(50)      VALUE
053130             '  HLDCO L1 L2 L3    MBC    L1 L2 L3     BC     BR1'.
053140     05  FILLER                   PIC X(50)      VALUE
053150             '   BR2 TYPE    PRODUCT CODE     EXPLANATION       '.
053160     05  FILLER                   PIC X(51)      VALUE SPACES.
053170   03  WS-1907P-D1.
053180     05  FILLER                   PIC X(50)      VALUE
053190             '  ----- -- -- --  -------- -- -- --  -------- ----'.
053200     05  FILLER                   PIC X(50)      VALUE
053210             '- ----- --   -- ---- ------ -   ------------------'.
053220     05  FILLER                   PIC X(51)      VALUE
053230            '--                                                 '.
053240   03  WS-1907P-P1                               VALUE SPACES.
053250     05  FILLER                   PIC X(2).
053260     05  WS-1907P-P1-HOLDCO       PIC X(5).
053270     05  FILLER                   PIC X.
053280     05  WS-1907P-P1-HC-DIV-1     PIC X(2).
053290     05  FILLER                   PIC X.
053300     05  WS-1907P-P1-HC-DIV-2     PIC X(2).
053310     05  FILLER                   PIC X.
053320     05  WS-1907P-P1-HC-DIV-3     PIC X(2).
053330     05  FILLER                   PIC X(2).
053340     05  WS-1907P-P1-MASTER-BC    PIC X(8).
053350     05  FILLER                   PIC X.
053360     05  WS-1907P-P1-MBC-DIV-1    PIC X(2).
053370     05  FILLER                   PIC X.
053380     05  WS-1907P-P1-MBC-DIV-2    PIC X(2).
053390     05  FILLER                   PIC X.
053400     05  WS-1907P-P1-MBC-DIV-3    PIC X(2).
053410     05  FILLER                   PIC X(2).
053420     05  WS-1907P-P1-BC           PIC X(8).
053430     05  FILLER                   PIC X.
053440     05  WS-1907P-P1-PRI-BR       PIC X(5).
053450     05  FILLER                   PIC X.
053460     05  WS-1907P-P1-SEC-BR       PIC X(5).
053470     05  FILLER                   PIC X.
053480     05  WS-1907P-P1-TYPE-CODE    PIC X(2).
053490     05  FILLER                   PIC X(3).
053500     05  WS-1907P-P1-PROD-CODE    PIC X(2)BX(4)BX(6)BX.
053510     05  FILLER                   PIC X(3).
053520     05  WS-1907P-P1-EXPLANATION  PIC X(20).
053530     05  FILLER                   PIC X(49).
053540   03  WS-1979P-C1.
053550     05  FILLER                   PIC X(50)      VALUE
053560             '  HLDCO L1 L2 L3    MBC    L1 L2 L3     BC     PBR'.
053570     05  FILLER                   PIC X(50)      VALUE
053580             '     FI PRINT   ACCT MGR PRINT   COMMENT          '.
053590     05  FILLER                   PIC X(51)      VALUE SPACES.
053600   03  WS-1979P-D1.
053610     05  FILLER                   PIC X(50)      VALUE
053620             '  ----- -- -- --  -------- -- -- --  -------- ----'.
053630     05  FILLER                   PIC X(50)      VALUE
053640             '-       -             -          -----------------'.
053650     05  FILLER                   PIC X(51)      VALUE
053660            '-----                                              '.
053670   03  WS-1979P-P1                               VALUE SPACES.
053680     05  FILLER                   PIC X(2).
053690     05  WS-1979P-P1-HOLDCO       PIC X(5).
053700     05  FILLER                   PIC X.
053710     05  WS-1979P-P1-HC-DIV-1     PIC X(2).
053720     05  FILLER                   PIC X.
053730     05  WS-1979P-P1-HC-DIV-2     PIC X(2).
053740     05  FILLER                   PIC X.
053750     05  WS-1979P-P1-HC-DIV-3     PIC X(2).
053760     05  FILLER                   PIC X(2).
053770     05  WS-1979P-P1-MASTER-BC    PIC X(8).
053780     05  FILLER                   PIC X.
053790     05  WS-1979P-P1-MBC-DIV-1    PIC X(2).
053800     05  FILLER                   PIC X.
053810     05  WS-1979P-P1-MBC-DIV-2    PIC X(2).
053820     05  FILLER                   PIC X.
053830     05  WS-1979P-P1-MBC-DIV-3    PIC X(2).
053840     05  FILLER                   PIC X(2).
053850     05  WS-1979P-P1-BC           PIC X(8).
053860     05  FILLER                   PIC X.
053870     05  WS-1979P-P1-PRI-BR       PIC X(5).
053880     05  FILLER                   PIC X(7).
053890     05  WS-1979P-P1-FI-FLAG      PIC X.
053900     05  FILLER                   PIC X(13).
053910     05  WS-1979P-P1-AM-FLAG      PIC X.
053920     05  FILLER                   PIC X(10).
053930     05  WS-1979P-P1-COMMENT      PIC X(22).
053940     05  FILLER                   PIC X(46).
053950   03  WS-566-C1.
053960     05  FILLER                   PIC X(50)      VALUE
053970             '     BC        PROG-ID     REC-TYP     # OF 566 RE'.
053980     05  FILLER                   PIC X(50)      VALUE
053990             'CORDS                                             '.
054000     05  FILLER                   PIC X(51)      VALUE SPACE.
054010   03  WS-566-D1.
054020     05  FILLER                   PIC X(50)      VALUE
054030             '  --------        -           -             ------'.
054040     05  FILLER                   PIC X(50)      VALUE   SPACE.
054050     05  FILLER                   PIC X(51)      VALUE   SPACE.
054060   03  WS-566-P1                                VALUE SPACES.
054070     05  FILLER                   PIC X(2).
054080     05  WS-566-P1-BC             PIC X(8).
054090     05  FILLER                   PIC X(8).
054100     05  WS-566-P1-PROG-ID        PIC X(1).
054110     05  FILLER                   PIC X(11).
054120     05  WS-566-P1-RECORD-TYPE    PIC X(1).
054130     05  FILLER                   PIC X(13).
054140     05  WS-566-P1-REC-CNT        PIC ZZZZZ9.
054150     05  FILLER                   PIC X(101).
054160   03  WS-120P-C1.
054170     05  FILLER                   PIC X(50)      VALUE
054180             '     BC     EXP CD   OPTION & DESCRIPTION         '.
054190     05  FILLER                   PIC X(50)      VALUE
054200             'SERVICE TYPE & DESCRIPTION                        '.
054210     05  FILLER                   PIC X(51)      VALUE
054220            '                                                   '.
054230   03  WS-120P-D1.
054240     05  FILLER                   PIC X(50)      VALUE
054250             '  --------    --     -   -------------------------'.
054260     05  FILLER                   PIC X(50)      VALUE
054270             '   -   --------------------------------           '.
054280     05  FILLER                   PIC X(51)      VALUE
054290            '                                                   '.
054300   03  WS-120P-P1                                VALUE SPACES.
054310     05  FILLER                   PIC X(2).
054320     05  WS-120P-P1-BC            PIC X(8).
054330     05  FILLER                   PIC X(4).
054340     05  WS-120P-P1-EXP-CD        PIC X(2).
054350     05  FILLER                   PIC X(5).
054360     05  WS-120P-P1-OPT           PIC X.
054370     05  FILLER                   PIC X(3).
054380     05  WS-120P-P1-DESC-OPT      PIC X(25).
054390     05  FILLER                   PIC X(3).
054400     05  WS-120P-P1-SERV-TYPE     PIC X.
054410     05  FILLER                   PIC X(3).
054420     05  WS-120P-P1-DESC-S        PIC X(25).
054430     05  FILLER                   PIC X(4).
054440     05  WS-120P-P1-CONS-TEXT-P   PIC X(23).
054450     05  FILLER                   PIC X(4).
054460     05  WS-120P-P1-CONS-TEXT-B   PIC X(23).
054470     05  FILLER                   PIC X(14).
054480*
054490 01  WS-C120-OPT-DESC.
054500   03  WS-C120-OPT-0              PIC X(25) VALUE
054510                    'OPTED OUT                '.
054520   03  WS-C120-OPT-1              PIC X(25) VALUE
054530                    'OPTED OUT - CONSUM CHOICE'.
054540   03  WS-C120-OPT-2              PIC X(25) VALUE
054550                    'OPTED IN - RETAIL ONLY   '.
054560   03  WS-C120-OPT-3              PIC X(25) VALUE
054570                    'OPTED IN - RETAIL/WV/EXP '.
054580*
054590 01  WS-C120-TYP-DESC.
054600   03  WS-C120-TYP-D              PIC X(25) VALUE
054610                    'DELUXE TRACK             '.
054620   03  WS-C120-TYP-F              PIC X(25) VALUE
054630                    'FIRST CLASS TRACKABLE    '.
054640   03  WS-C120-TYP-N              PIC X(25) VALUE
054650                    'N / A                    '.
054660*
054670 01  WS-C120-CONS-TEXTS.
054680   03  WS-C120-CONS-TXT-OPT       PIC X(23) VALUE
054690                                  'OPTION MUST BE 0 - 3   '.
054700   03  WS-C120-CONS-TXT-TYP       PIC X(23) VALUE
054710                                  'SERV TYPE: F, D, SPACE '.
054720*
054730   03  WS-149P-C1.
054740     05  FILLER                   PIC X(50)      VALUE
054750             '     BC     EXP CD   PERSONAL OPTION & DESCRIPTION'.
054760     05  FILLER                   PIC X(50)      VALUE
054770             '    BUSINESS OPTION & DESCRIPTION    PERS CONSUMER'.
054780     05  FILLER                   PIC X(51)      VALUE
054790            ' OPT OUT      BUSN CONSUMER OPT OUT                '.
054800   03  WS-149P-D1.
054810     05  FILLER                   PIC X(50)      VALUE
054820             '  --------    --     -   -------------------------'.
054830     05  FILLER                   PIC X(50)      VALUE
054840             '    -----------------------------    -------------'.
054850     05  FILLER                   PIC X(51)      VALUE
054860            '----------    -----------------------              '.
054870   03  WS-149P-P1                                VALUE SPACES.
054880     05  FILLER                   PIC X(2).
054890     05  WS-149P-P1-BC            PIC X(8).
054900     05  FILLER                   PIC X(4).
054910     05  WS-149P-P1-EXP-CD        PIC X(2).
054920     05  FILLER                   PIC X(5).
054930     05  WS-149P-P1-PROV-OPT-P    PIC X.
054940     05  FILLER                   PIC X(3).
054950     05  WS-149P-P1-DESCR-P       PIC X(25).
054960     05  FILLER                   PIC X(4).
054970     05  WS-149P-P1-PROV-OPT-B    PIC X.
054980     05  FILLER                   PIC X(3).
054990     05  WS-149P-P1-DESCR-B       PIC X(25).
055000     05  FILLER                   PIC X(4).
055010     05  WS-149P-P1-CONS-TEXT-P   PIC X(23).
055020     05  FILLER                   PIC X(4).
055030     05  WS-149P-P1-CONS-TEXT-B   PIC X(23).
055040     05  FILLER                   PIC X(14).
055050*
055060 01  WS-C149-DESCR-TBL.
055070   03  FILLER       PIC X(26)  VALUE ' (NONE)                   '.
055080   03  FILLER       PIC X(26)  VALUE 'APROVENT CFP RETAIL       '.
055090   03  FILLER       PIC X(26)  VALUE 'BPROVENT CFP RETAIL/WAIVE '.
055100   03  FILLER       PIC X(26)  VALUE 'CPROVENT CFP FI PD        '.
055110   03  FILLER       PIC X(26)  VALUE 'DPROVENT CFP CUST PD      '.
055120   03  FILLER       PIC X(26)  VALUE 'EPROVENT PLUS RETAIL      '.
055130   03  FILLER       PIC X(26)  VALUE 'FPROVENT PLUS RETAIL/WAIVE'.
055140   03  FILLER       PIC X(26)  VALUE 'GPROVENT PLUS FI PD       '.
055150   03  FILLER       PIC X(26)  VALUE 'HPROVENT PLUS CUST PD     '.
055160   03  FILLER       PIC X(26)  VALUE 'ICK ACCT PROTECT RETAIL   '.
055170   03  FILLER       PIC X(26)  VALUE 'JCK ACCT PROTECT RTL/WVE  '.
055180   03  FILLER       PIC X(26)  VALUE 'KCK ACCT PROTECT FI PD    '.
055190   03  FILLER       PIC X(26)  VALUE 'LCK ACCT PROTECT CUST PD  '.
055200   03  FILLER       PIC X(26)  VALUE 'MID RESTORATION RETAIL    '.
055210   03  FILLER       PIC X(26)  VALUE 'NID RESTORATION RTL/WVE   '.
055220   03  FILLER       PIC X(26)  VALUE 'OID RESTORATION FI PD     '.
055230   03  FILLER       PIC X(26)  VALUE 'PID RESTORATION CUST PD   '.
055240   03  FILLER       PIC X(26)  VALUE 'ZEXCLUDED EXPENSE CODE    '.
055250 01  FILLER REDEFINES WS-C149-DESCR-TBL.
055260   03  WS-C149-D-T-ENTRY          OCCURS 18 TIMES
055270                                  ASCENDING KEY IS WS-C149-D-T-OPT
055280                                  INDEXED BY IX-WS-C149-D-T.
055290     05  WS-C149-D-T-OPT          PIC X.
055300     05  WS-C149-D-T-DESCR        PIC X(25).
055310*
055320 01  WS-C149-CONS-TEXTS.
055330   03  WS-C149-CONS-TXT-SP        PIC X(23)
055340                                  VALUE '(SPACE) = NOT PERMITTED'.
055350   03  WS-C149-CONS-TXT-X         PIC X(23)
055360                                  VALUE 'X = PERMITTED          '.
055370   03  WS-C149-CONS-TXT-NA        PIC X(23)
055380                                  VALUE '(NOT APPLICABLE)       '.
055390   03  WS-C149-CONS-TXT-UND       PIC X(22)
055400                                   VALUE ' (UNDEFINED)          '.
055410*
055420 01  WS-NON-TABLE-BC-INFO.
055430   03  WS-FI-MASTER-BC            PIC X(8).
055440   03  WS-HOLDING-COMPANY         PIC X(5).
055450*
055460 01  WS-8950-WORK-VARIABLES.
055470   03  WS-INSTRUCTIONS-FLAG        PIC X VALUE 'N'.
055480     88  END-INSTRUCTIONS         VALUE 'Y'.
055490   03  WS-BRANCH-PRODUCT-E-FLAG     PIC X VALUE 'N'.
055500     88  END-BRANCH-PRODUCT       VALUE 'Y'.
055510   03  WS-BRANCH-PRODUCT-A-FLAG     PIC X VALUE 'N'.
055520     88  BRANCH-PRODUCT-ASSIGNED  VALUE 'Y'.
055530   03  WS-INSTRUCTIONS-A-FLAG       PIC X VALUE 'N'.
055540     88  INSTRUCTIONS-ASSIGNED    VALUE 'Y'.
055550   03  WS-INSTRUCTIONS-CTR        PIC 9(2) VALUE ZEROES.
055560   03  WS-BRANCH-PRODUCT-CTR      PIC 9(2) VALUE ZEROES.
055570   03  WS-BRANCH-LINES-COUNT      PIC 9(2) VALUE ZEROES.
055580   03  WS-PRODUCT-LINES-COUNT     PIC 9(2) VALUE ZEROES.
055590   03  WS-INSTRUCTIONS-LINES-COUNT PIC 9(2) VALUE ZEROES.
055600*
055610 COPY T0550W.
055620*
055630 01  WS-KEY-WORK.
055640   03  WS-KW-ACCESS-CODE.
055650     05  WS-KW-ACCESS-1           PIC X.
055660     05  WS-KW-ACCESS-2           PIC X.
055670     05  WS-KW-ACCESS-3           PIC X.
055680     05  WS-KW-ACCESS-4           PIC X.
055690   03  WS-KW-KEY.
055700     05  WS-KW-KEY-REC-TYPE       PIC X.
055710     05  WS-KW-KEY-REST.
055720       07  WS-KW-KEY-HC-GROUP     PIC X(11).
055730       07  WS-KW-KEY-MBC-GROUP    PIC X(14).
055740       07  WS-KW-KEY-BC-BR-BR     PIC X(18).
055750       07  WS-KW-KEY-BILL-TYPE    PIC X(2).
055760*
055770 01  WS-INV-BC                    PIC X(8).
055780*
055790 01  WS-INV-BC-TBL.
055800   03  WS-TBL-INV-BC              OCCURS 100 TIMES
055810                                  INDEXED BY
055820                                        IX-WS-INV-BC-CURR
055830                                        IX-WS-INV-BC-EMPTY
055840                                        IX-WS-INV-BC-FROM
055850                                        IX-WS-INV-BC-TO
055860                                  PIC X(8).
055870*
055880 01  WS-C1041-REC.
055890   03  W1041P-979-INST-SEQ        PIC X(45).
055900   03  W1041P-979-PGM-CODE        PIC X.
055910   03  W1041P-BILLING-DATE        PIC X(6).
055920   03  W1041P-NEW-START-DATE      PIC X(6).
055930   03  W1041P-NEW-END-DATE        PIC X(6).
055940   03  W1041P-NEW-LIMIT           PIC X(7).
055950   03  W1041P-NEW-LIMIT-TYPE      PIC X.
055960*
055970 01  WS-C1041-TABLE.
055980   03  WS-C1041-TBL-ENT-CT        PIC 9(4)       COMP.
055990   03  WS-C1041-TBL-REC           OCCURS 0 TO 5000 TIMES
056000                                  DEPENDING ON WS-C1041-TBL-ENT-CT
056010                                  INDEXED BY
056020                                      IX-WS-C1041-TBL-CURR
056030                                      IX-WS-C1041-TBL-EMPTY
056040                                      IX-WS-C1041-TBL-M1
056050                                      IX-WS-C1041-TBL-H1.
056060     05  WS-C1041-TBL-HC          PIC X(5).
056070     05  FILLER                   PIC X(6).
056080     05  WS-C1041-TBL-MBC         PIC X(8).
056090     05  FILLER                   PIC X(6).
056100     05  WS-C1041-TBL-BC          PIC X(8).
056110     05  FILLER                   PIC X(39).
056120*
056130 01  WS-C285-REC.
056140   03  WS-C285-INV-SEQ.
056150     05  WS-C285-BC               PIC X(8).
056160     05  WS-C285-PRI-BR           PIC X(5).
056170     05  WS-C285-SEC-BR           PIC X(5).
056180     05  WS-C285-TYP-CD           PIC X(2).
056190     05  WS-C285-SEP-INV          PIC X(2).
056200   03  WS-C285-PYMT-DAYS          PIC X(2).
056210*
056220 01  WS-C285-TBL.
056230   03  WS-C285-TBL-REC            OCCURS 800 TIMES
056240                                  INDEXED BY
056250                                      IX-WS-C285-TBL-CURR
056260                                      IX-WS-C285-TBL-EMPTY.
056270     05  WS-C285-TBL-BC           PIC X(8).
056280     05  FILLER                   PIC X(16).
056290*
056300 01  WS-C225-RPT-STUFF.
056310   03  WS-C225-RPT-FLAG           PIC X          VALUE SPACE.
056320     88  REPORT-C225                VALUES 'B', 'H', '2'.
056330     88  REPORT-C225-BC             VALUES 'B', '2'.
056340     88  REPORT-C225-HC             VALUES 'H', '2'.
056350     88  REPORT-C225-BOTH           VALUE '2'.
056360   03  WS-C225-TXT-SP          PIC X(15)  VALUE 'SPACE = ALLOWED'.
056370   03  WS-C225-TXT-Y           PIC X(15)  VALUE 'Y = OVERRIDDEN '.
056380   03  WS-C225-TXT-UND                    VALUE '"?" (UNDEFINED)'.
056390     05  FILLER                   PIC X.
056400     05  WS-C225-TXT-UND-VAL      PIC X.
056410     05  FILLER                   PIC X(13).
056420*
056430 01  WS-C225-INFO.
056440   03  WS-C225-HC                 PIC X(5).
056450   03  WS-C225-BC                 PIC X(8).
056460   03  FILLER                     PIC X.
056470   03  WS-C225-OS-UNIT-OVR        PIC X.
056480   03  FILLER                     PIC X.
056490   03  WS-C225-OS-BNDL-OVR        PIC X.
056500   03  FILLER                     PIC X.
056510   03  WS-C225-BS-BNDL-OVR        PIC X.
056520*
056530 01  WS-C225-TABLE.
056540   03  WS-C225-TBL-ENT-CT         PIC 9(4)       COMP.
056550   03  WS-C225-TBL-INFO           OCCURS 0 TO 800 TIMES
056560                                  DEPENDING ON WS-C225-TBL-ENT-CT
056570                                  ASCENDING KEY IS WS-C225-TBL-HC
056580                                  INDEXED BY IX-WS-C225-TBL.
056590     05  WS-C225-TBL-HC           PIC X(5).
056600     05  FILLER                   PIC X(14).
056610*
056620 01  WS-C506-REC.
056630   03  WS-C506-GAS-KEY.
056640     05  WS-C506-CONST-G          PIC X.
056650     05  WS-C506-HC-THRU-PBR.
056660       07  WS-C506-HC             PIC X(5).
056670       07  WS-C506-HC-DIVS        PIC X(6).
056680       07  WS-C506-MBC            PIC X(8).
056690       07  WS-C506-MBC-DIVS       PIC X(6).
056700       07  WS-C506-BC             PIC X(8).
056710       07  WS-C506-PRI-BR         PIC X(5).
056720     05  WS-C506-CONST-SP         PIC X(7).
056730   03  WS-C506-START-DATE         PIC X(10).
056740   03  WS-C506-END-DATE           PIC X(10).
056750   03  WS-C506-LIMIT              PIC X(5).
056760*
056770 01  WS-C506-TBL.
056780   03  WS-C506-TBL-REC            OCCURS 3200 TIMES
056790                                  INDEXED BY
056800                                      IX-WS-C506-TBL-CURR
056810                                      IX-WS-C506-TBL-EMPTY.
056820     05  WS-C506-TBL-GAS-KEY      PIC X(46).
056830     05  FILLER                   PIC X(25).
056840*
056850 01  WS-UPCH-KEY-TABLE.
056860   03  WS-TBL-UPCH-KEY            OCCURS 200 TIMES
056870                                  INDEXED BY
056880                                        IX-WS-UPCH-KEY-CURR
056890                                        IX-WS-UPCH-KEY-EMPTY
056900                                        IX-WS-UPCH-KEY-FROM
056910                                        IX-WS-UPCH-KEY-TO
056920                                  PIC X(46).
056930*
056940 01  WS-1637-TABLE.
056950   03  WS-1637-ENTRY-COUNT        PIC S9(5)      COMP.
056960   03  WS-1637-TBL-ENTRY          OCCURS 1 TO 26 TIMES
056970                                  DEPENDING ON WS-1637-ENTRY-COUNT
056980                                  ASCENDING KEY IS WS-1637-KEY
056990                                  INDEXED BY IX-WS-1637-TBL.
057000     05  WS-1637-KEY              PIC X.
057010     05  WS-1637-DESCRIPTION      PIC X(11).
057020*
057030 COPY T0554W.
057040*
057050 01  WS-UPCH-ATTR-WORK.
057060   03  WS-UPCH-ATTR-BYTE          OCCURS 5 TIMES
057070                                  INDEXED BY IX-WS-UPCH-ATTR
057080                                  PIC X.
057090*
057100 01  WS-RATE-WORK-4X.
057110   03  WS-RATE-WORK-4N            PIC S9(5)V9(2) COMP-3.
057120   03  FILLER REDEFINES WS-RATE-WORK-4N.
057130     05  WS-RATE-WORK-3X.
057140       07  WS-RATE-WORK-3N        PIC S9(3)V9(2) COMP-3.
057150     05  FILLER                   PIC X.
057160*
057170 01  WS-552-FIXED-INFO.
057180   03  WS-552-KEY.
057190     05  WS-552-SHORT-KEY.
057200       07  WS-552-REC-TYPE        PIC X.
057210       07  WS-552-HOLDCO          PIC X(5).
057220       07  WS-552-HC-DIV-L1       PIC X(2).
057230       07  WS-552-HC-DIV-L2       PIC X(2).
057240       07  WS-552-HC-DIV-L3       PIC X(2).
057250       07  WS-552-MASTER-BC       PIC X(8).
057260       07  WS-552-MBC-DIV-L1      PIC X(2).
057270       07  WS-552-MBC-DIV-L2      PIC X(2).
057280       07  WS-552-MBC-DIV-L3      PIC X(2).
057290       07  WS-552-BC              PIC X(8).
057300       07  WS-552-PRI-BR          PIC X(5).
057310       07  WS-552-SEC-BR          PIC X(5).
057320       07  WS-552-BILL-TYPE       PIC X(2).
057330     05  WS-552-REC-PART          PIC X.
057340     05  WS-552-REGION            PIC X(2).
057350     05  WS-552-STD-DISCT-KEY     PIC X(4).
057360     05  WS-552-SCI-TRADE-KEY     PIC X(4).
057370     05  WS-552-UPDATE-DT         PIC X(6).
057380     05  WS-552-ENTRY-CT          PIC S9(3)      COMP-3.
057390*
057400 01  WS-552-G-ENTRY.
057410   03  WS-552-G-ENT-TYP           PIC X.
057420   03  WS-552-G-PROD-CODE         PIC X(13).
057430   03  WS-552-G-DESCR-QTY         PIC X(5).
057440   03  WS-552-G-MAIL-METH         PIC X.
057450   03  WS-552-G-PRICE-SRCE        PIC X.
057460   03  WS-552-G-C1128-OVERRIDE    PIC X.
057470   03  WS-552-G-ADJ-OPT           PIC X.
057480   03  WS-552-G-PR-DESIG          PIC X(2).
057490   03  WS-552-G-RATE-X            PIC X(3).
057500*
057510 01  WS-552-AS-ENTRY.
057520   03  WS-552-AS-PROD-CODE        PIC X(13).
057530   03  WS-552-AS-DESCR-QTY        PIC X(5).
057540   03  WS-552-AS-REORD-FLG        PIC X.
057550   03  WS-552-AS-UNITS            PIC X(2).
057560   03  WS-552-AS-ORD-CHNL         PIC X.
057570   03  WS-552-AS-C1128-OVERRIDE   PIC X.
057580   03  WS-552-AS-S1-BASIS         PIC X.
057590   03  WS-552-AS-S1-RATE-X        PIC X(3).
057600   03  WS-552-AS-S2-BASIS         PIC X.
057610   03  WS-552-AS-S2-RATE-X        PIC X(3).
057620   03  WS-552-AS-S3-BASIS         PIC X.
057630   03  WS-552-AS-S3-RATE-X        PIC X(3).
057640*
057650 01  WS-GAS-KEY-TABLE.
057660   03  WS-TBL-GAS-KEY             OCCURS 200 TIMES
057670                                  INDEXED BY
057680                                        IX-WS-GAS-KEY-CURR
057690                                        IX-WS-GAS-KEY-EMPTY
057700                                        IX-WS-GAS-KEY-FROM
057710                                        IX-WS-GAS-KEY-TO.
057720     05  WS-TBL-GAS-KEY-REC-TYP   PIC X.
057730     05  FILLER                   PIC X(45).
057740*
057750 01  WS-PRT-554-552-ENTRY-CT      PIC S9(5)      COMP-3.
057760*
057770 01  WS-PRT-554-552-LINES.
057780   03  WS-PRT-554-552-LINE        OCCURS 8000 TIMES
057790                                  INDEXED BY IX-WS-PRT-554-552-OUT
057800                                             IX-WS-PRT-554-552-IN
057810                                  PIC X(150).
057820*
057830 01  WS-PROFIT-RPT-NBR            PIC X(6).
057840*
057850 01  WS-PROFIT-RPT-TABLE.
057860   03  WS-TBL-PROFIT-RPT-NBR      OCCURS 200 TIMES
057870                                  INDEXED BY
057880                                        IX-WS-PROFIT-RPT-CURR
057890                                        IX-WS-PROFIT-RPT-EMPTY
057900                                        IX-WS-PROFIT-RPT-FROM
057910                                        IX-WS-PROFIT-RPT-TO
057920                                  PIC X(6).
057930*
057940 01  WS-CONSID-NBR                PIC X(5).
057950*
057960 01  WS-CONSID-NBR-TABLE.
057970   03  WS-TBL-CONSID-NBR          OCCURS 40 TIMES
057980                                  INDEXED BY
057990                                        IX-WS-CONSID-NBR-CURR
058000                                        IX-WS-CONSID-NBR-EMPTY
058010                                        IX-WS-CONSID-NBR-FROM
058020                                        IX-WS-CONSID-NBR-TO
058030                                  PIC X(5).
058040*
058050 01  WS-NACHA-CODE.
058060   03  WS-NACHA-TAPE              PIC X(3).
058070   03  WS-NACHA-BATCH             PIC X(4).
058080*
058090 01  WS-NACHA-CODE-TABLE.
058100   03  WS-TBL-NACHA-CODE          OCCURS 6000 TIMES
058110                                  INDEXED BY
058120                                        IX-WS-NACHA-CODE-CURR
058130                                        IX-WS-NACHA-CODE-EMPTY
058140                                        IX-WS-NACHA-CODE-FROM
058150                                        IX-WS-NACHA-CODE-TO.
058160     05  WS-TBL-NACHA-TAPE        PIC X(3).
058170     05  WS-TBL-NACHA-BATCH       PIC X(4).
058180*
058190 01  WS-550-TABLE.
058200   03  WS-550-TBL-ENTRY           OCCURS 25000 TIMES
058210                                  INDEXED BY IX-WS-550-TBL-OUT
058220                                             IX-WS-550-TBL-IN
058230                                  PIC X(525).
058240*
058250 01  WS-MAIL-CODE-TABLE.
058260   03  WS-MAIL-CODE-COUNT         PIC S9(2)      COMP.
058270   03  WS-MAIL-CODE               OCCURS 0 TO 99 TIMES
058280                                  DEPENDING ON WS-MAIL-CODE-COUNT
058290                                  ASCENDING KEY IS WS-MAIL-CODE
058300                                  INDEXED BY IX-WS-MAIL-CD-CURR
058310                                             IX-WS-MAIL-CD-EMPTY
058320                                             IX-WS-MAIL-CD-FROM
058330                                             IX-WS-MAIL-CD-TO
058340                                  PIC X(5).
058350*
058360 01  WS-STRING-WORK.
058370   03  WS-SW-POINTER              PIC S9(2)      COMP.
058380   03  WS-SW-FIELD                PIC X(34).
058390   03  FILLER REDEFINES WS-SW-FIELD.
058400     05  WS-SW-BYTE               OCCURS 34 TIMES
058410                                  PIC X.
058420*
058430 01  WS-C348-TABLE.
058440   03  WS-C348-ENTRY-COUNT        PIC S9(3)      COMP.
058450   03  WS-C348-TBL-ENTRY          OCCURS 0 TO 1500 TIMES
058460                                  DEPENDING ON WS-C348-ENTRY-COUNT
058470                                  ASCENDING KEY IS
058480                                        WS-C348-TBL-EMP-NBR
058490                                  INDEXED BY IX-WS-C348-TBL.
058500     05  WS-C348-TBL-EMP-NBR      PIC X(7).
058510     05  WS-C348-TBL-EMP-NAME     PIC X(34).
058520*
058530 01  WS-C761-TABLE.
058540   03  WS-C761-ENTRY-COUNT        PIC S9(4)      COMP.
058550   03  WS-C761-TBL-ENTRY          OCCURS 8000 TIMES
058560                                  INDEXED BY IX-WS-C761-TBL.
058570     05  WS-C761-HOLDCO           PIC X(5).
058580     05  WS-C761-HC-DIV-1         PIC X(2).
058590     05  WS-C761-HC-DIV-2         PIC X(2).
058600     05  WS-C761-HC-DIV-3         PIC X(2).
058610     05  WS-C761-MASTER-BC        PIC X(8).
058620     05  WS-C761-FI-DIV-1         PIC X(2).
058630     05  WS-C761-FI-DIV-2         PIC X(2).
058640     05  WS-C761-FI-DIV-3         PIC X(2).
058650     05  WS-C761-BC               PIC X(8).
058660     05  WS-C761-PRI-BR           PIC X(5).
058670     05  WS-C761-SEC-BR           PIC X(5).
058680     05  WS-C761-BILL-TYPE        PIC X(2).
058690     05  WS-C761-CONSID-NBR-1     PIC X(5).
058700     05  WS-C761-CONSID-NBR-2     PIC X(5).
058710     05  WS-C761-CONSID-NBR-3     PIC X(5).
058720     05  WS-C761-CONSID-NBR-4     PIC X(5).
058730     05  WS-C761-CONSID-NBR-5     PIC X(5).
058740     05  WS-C761-CONSID-NBR-6     PIC X(5).
058750     05  WS-C761-CONSID-NBR-7     PIC X(5).
058760*
058770 01  WS-C761A-TABLE.
058780   03  WS-C761A-ENTRY-COUNT       PIC S9(4)      COMP.
058790   03  WS-C761A-TBL-ENTRY         OCCURS 8000 TIMES
058800                                  INDEXED BY IX-WS-C761A-TBL.
058810     05  WS-C761A-HOLDCO          PIC X(5).
058820     05  WS-C761A-HC-DIV-1        PIC X(2).
058830     05  WS-C761A-HC-DIV-2        PIC X(2).
058840     05  WS-C761A-HC-DIV-3        PIC X(2).
058850     05  WS-C761A-MASTER-BC       PIC X(8).
058860     05  WS-C761A-FI-DIV-1        PIC X(2).
058870     05  WS-C761A-FI-DIV-2        PIC X(2).
058880     05  WS-C761A-FI-DIV-3        PIC X(2).
058890     05  WS-C761A-BC              PIC X(8).
058900     05  WS-C761A-PRI-BR          PIC X(5).
058910     05  WS-C761A-SEC-BR          PIC X(5).
058920     05  WS-C761A-BILL-TYPE       PIC X(2).
058930     05  WS-C761A-CONSID-NBR-1    PIC X(5).
058940     05  WS-C761A-CONSID-NBR-2    PIC X(5).
058950     05  WS-C761A-CONSID-NBR-3    PIC X(5).
058960     05  WS-C761A-CONSID-NBR-4    PIC X(5).
058970     05  WS-C761A-CONSID-NBR-5    PIC X(5).
058980     05  WS-C761A-CONSID-NBR-6    PIC X(5).
058990     05  WS-C761A-CONSID-NBR-7    PIC X(5).
059000*
059010 01  WS-C769-TABLE.
059020   03  WS-C769-ENTRY-COUNT        PIC S9(4)      COMP.
059030   03  WS-C769-TBL-ENTRY          OCCURS 16000 TIMES
059040                                  INDEXED BY IX-WS-C769-TBL.
059050     05  WS-C769-MAIL-CODE        PIC X(5).
059060     05  WS-C769-BC               PIC X(8).
059070     05  WS-C769-PRI-BR           PIC X(5).
059080     05  WS-C769-SEC-BR           PIC X(5).
059090     05  WS-C769-BILL-TYPE        PIC X(2).
059100     05  WS-C769-SEP-INV-CD       PIC X(2).
059110     05  FILLER                   PIC X.
059120     05  WS-C769-CARD-CODE        PIC X.
059130     05  WS-C769-1-INFO.
059140       07  WS-C769-1-ADDR-LINE-1  PIC X(30).
059150       07  WS-C769-1-ADDR-LINE-2  PIC X(30).
059160       07  WS-C769-1-ADDR-LINE-3  PIC X(30).
059170     05  WS-C769-2-INFO REDEFINES WS-C769-1-INFO.
059180       07  WS-C769-2-ADDR-CITY    PIC X(30).
059190       07  WS-C769-2-ADDR-STATE   PIC X(2).
059200       07  WS-C769-2-ADDR-ZIP-01-09  PIC X(9).
059210       07  WS-C769-2-ADDR-ZIP-10-11  PIC X(2).
059220       07  WS-C769-2-BRANCH-NAME  PIC X(35).
059230       07  FILLER                 PIC X(12).
059240*
059250 01  WS-C781-TABLE.
059260   03  WS-C781-ENTRY-COUNT        PIC S9(4)      COMP.
059270   03  WS-C781-TBL-ENTRY          OCCURS 8000 TIMES
059280                                  INDEXED BY IX-WS-C781-TBL.
059290     05  WS-C781-MATCH-FIELDS.
059300       07  WS-C781-HOLDCO         PIC X(5).
059310       07  WS-C781-HC-DIV-1       PIC X(2).
059320       07  WS-C781-HC-DIV-2       PIC X(2).
059330       07  WS-C781-HC-DIV-3       PIC X(2).
059340       07  WS-C781-MASTER-BC      PIC X(8).
059350       07  WS-C781-FI-DIV-1       PIC X(2).
059360       07  WS-C781-FI-DIV-2       PIC X(2).
059370       07  WS-C781-FI-DIV-3       PIC X(2).
059380       07  WS-C781-BC             PIC X(8).
059390       07  WS-C781-PRI-BR         PIC X(5).
059400       07  WS-C781-SEC-BR         PIC X(5).
059410       07  WS-C781-BILL-TYPE      PIC X(2).
059420     05  WS-C781-ASSIGNMENT-FIELDS.
059430       07  WS-C781-RPT-NBR-1      PIC X(6).
059440       07  WS-C781-NC-INCL-1      PIC X.
059450       07  WS-C781-REB-FLAG-1     PIC X.
059460       07  WS-C781-RPT-NBR-2      PIC X(6).
059470       07  WS-C781-NC-INCL-2      PIC X.
059480       07  WS-C781-REB-FLAG-2     PIC X.
059490       07  WS-C781-RPT-NBR-3      PIC X(6).
059500       07  WS-C781-NC-INCL-3      PIC X.
059510       07  WS-C781-REB-FLAG-3     PIC X.
059520       07  WS-C781-RPT-NBR-4      PIC X(6).
059530       07  WS-C781-NC-INCL-4      PIC X.
059540       07  WS-C781-REB-FLAG-4     PIC X.
059550     05  WS-C781-COMMENT          PIC X(6).
059560     05  WS-C781-CARD-CODE        PIC X.
059570*
059580 01  WS-C782-TABLE.
059590   03  WS-C782-ENTRY-COUNT        PIC S9(4)      COMP.
059600   03  WS-C782-TBL-ENTRY          OCCURS 8000 TIMES
059610                                  INDEXED BY IX-WS-C782-TBL.
059620     05 WS-I782P-SEQUENCE.
059630       07  WS-I782P-MATCH-SEQ.
059640         09  WS-I782P-FI-SEQ.
059650           11  WS-I782-CONSID-NBR                PIC X(5).
059660           11  WS-I782-BC                        PIC X(8).
059670           11  WS-I782-PRI-BR                    PIC X(5).
059680           11  WS-I782-SEC-BR                    PIC X(5).
059690           11  WS-I782-BILL-TYPE                 PIC X(2).
059700         09  WS-I782-PRODUCT-GROUP.
059710           11  WS-I782-PROD-GRP-BYTE-1           PIC X.
059720           11  WS-I782-PROD-GRP-BYTE-2           PIC X.
059730       07  WS-I782-CARD-CODE                     PIC X.
059740     05  WS-I782-ASSIGNMENTS.
059750       07  WS-I782-ASSIGNMENT                    OCCURS 3 TIMES
059760                                               INDEXED BY
059770                                                 I782P-IX-ASSIGN
059780                                                 PIC X(29).
059790*
059800  01  WS-C850-ENTRY.
059810    03  WS-C850-INST-TYP          PIC X.
059820    03  FILLER                    PIC X.
059830    03  WS-C850-INST-BC.
059840      05  WS-C850-INST-HC         PIC X(5).
059850      05  WS-C850-HC-SPACES       PIC X(3).
059860    03  FILLER                    PIC X.
059870    03  WS-C850-CONSID-NBR        PIC X(5).
059880*
059890  01  WS-C851-ENTRY.
059900    03  WS-C851-CONSID-NBR        PIC X(5).
059910    03  FILLER                    PIC X.
059920    03  WS-C851-CLIENT-SHR-PCT    PIC X(6).
059930    03  FILLER                    PIC X.
059940    03  WS-C851-SETTLEMENT-FREQ   PIC X.
059950    03  FILLER                    PIC X.
059960    03  WS-C851-HOLD-DAYS         PIC X(2).
059970*
059980 01  WS-C850-BC-TABLE.
059990   03  WS-C850-BC-ENTRY-COUNT     PIC S9(4)      COMP.
060000   03  WS-C850-BC-TBL-ENTRY       OCCURS 0 TO 2000 TIMES
060010                                  DEPENDING ON
060020                                    WS-C850-BC-ENTRY-COUNT
060030                                  ASCENDING KEY WS-C850-BC-TBL-BC
060040                                  INDEXED BY IX-WS-C850-BC-TBL.
060050     05  FILLER                   PIC X(2).
060060     05  WS-C850-BC-TBL-BC        PIC X(8).
060070     05  FILLER                   PIC X(6).
060080*
060090 01  WS-C850-HC-TABLE.
060100   03  WS-C850-HC-ENTRY-COUNT     PIC S9(4)      COMP.
060110   03  WS-C850-HC-TBL-ENTRY       OCCURS 0 TO 2000 TIMES
060120                                  DEPENDING ON
060130                                    WS-C850-HC-ENTRY-COUNT
060140                                  ASCENDING KEY WS-C850-HC-TBL-HC
060150                                  INDEXED BY IX-WS-C850-HC-TBL.
060160     05  FILLER                   PIC X(2).
060170     05  WS-C850-HC-TBL-HC        PIC X(5).
060180     05  FILLER                   PIC X(9).
060190*
060200 01  WS-C851-TABLE.
060210   03  WS-C851-ENTRY-COUNT        PIC S9(4)      COMP.
060220   03  WS-C851-TBL-ENTRY          OCCURS 0 TO 2000 TIMES
060230                                  DEPENDING ON
060240                                    WS-C851-ENTRY-COUNT
060250                                  ASCENDING KEY
060260                                    WS-C851-TBL-CONSID-NBR
060270                                  INDEXED BY IX-WS-C851-TBL.
060280     05  WS-C851-TBL-CONSID-NBR   PIC X(5).
060290     05  FILLER                   PIC X(12).
060300*
060310 01  WS-C1712-TABLE.
060320   03  WS-C1712-ENTRY-COUNT       PIC S9(4)      COMP.
060330   03  WS-C1712-TBL-ENTRY         OCCURS 8000 TIMES
060340                                  INDEXED BY IX-WS-C1712-TBL.
060350     05  WS-C1712-MATCH-FIELDS.
060360       07  WS-C1712-BC            PIC X(8).
060370       07  WS-C1712-PRI-BR        PIC X(5).
060380     05  WS-C1712-REPORT-NUMBER   PIC X(6).
060390     05  WS-C1712-DATE-FIRST-BILL PIC X(8).
060400     05  WS-C1712-DATE-FINAL-BILL PIC X(8).
060410     05  WS-C1712-FREQUENCY       PIC X(1).
060420     05  WS-C1712-DISK            PIC X(1).
060430     05  WS-C1712-SHIPPING        PIC X(2).
060440     05  WS-C1712-HOURS           PIC X(3).
060450     05  WS-C1712-SET-UP-TIME     PIC X(3).
060460     05  WS-C1712-RUSH-DEVELOPE   PIC X(1).
060470     05  WS-C1712-PAGE-COUNT      PIC X(3).
060480*
060490 01  WS-C1921-TABLE-COUNTS.
060500   03  WS-C1921-ENTRY-HC-COUNT    PIC S9(5)    COMP VALUE +0.
060510   03  WS-C1921-ENTRY-BC-COUNT    PIC S9(5)    COMP VALUE +0.
060520*
060530 01  WS-C1921-HC-TABLE.
060540   03  WS-C1921-TABLE-HC          OCCURS 0 TO 10000 TIMES
060550                                  DEPENDING ON
060560                                        WS-C1921-ENTRY-HC-COUNT
060570                                  ASCENDING KEY IS
060580                                        WS-C1921-TABLE-HC
060590                                  INDEXED BY IX-WS-C1921-TBL-HC
060600                                  PIC X(5).
060610*
060620 01  WS-C1921-BC-TABLE.
060630   03  WS-C1921-TABLE-BC          OCCURS 0 TO 10000 TIMES
060640                                  DEPENDING ON
060650                                        WS-C1921-ENTRY-BC-COUNT
060660                                  ASCENDING KEY IS
060670                                        WS-C1921-TABLE-BC
060680                                  INDEXED BY IX-WS-C1921-TBL-BC
060690                                  PIC X(8).
060700*
060710 01  WS-C1907-REC.
060720   03  WS-C1907-HOLDCO            PIC X(5).
060730   03  WS-C1907-HC-DIV-1          PIC X(2).
060740   03  WS-C1907-HC-DIV-2          PIC X(2).
060750   03  WS-C1907-HC-DIV-3          PIC X(2).
060760   03  WS-C1907-MASTER-BC         PIC X(8).
060770   03  WS-C1907-MBC-DIV-1         PIC X(2).
060780   03  WS-C1907-MBC-DIV-2         PIC X(2).
060790   03  WS-C1907-MBC-DIV-3         PIC X(2).
060800   03  WS-C1907-BC                PIC X(8).
060810   03  WS-C1907-PRI-BR            PIC X(5).
060820   03  WS-C1907-SEC-BR            PIC X(5).
060830   03  WS-C1907-TYPE-CODE         PIC X(2).
060840   03  FILLER                     PIC X.
060850   03  WS-C1907-PROD-CODE         PIC X(13).
060860   03  FILLER                     PIC X.
060870   03  WS-C1907-EXPLANATION       PIC X(20).
060880*
060890 01  WS-C1907-TABLE.
060900   03  WS-C1907-ENTRY-COUNT       PIC S9(4)      COMP.
060910   03  WS-C1907-TBL-REC           OCCURS 9000 TIMES
060920                                  INDEXED BY IX-WS-C1907-TBL
060930                                  PIC X(80).
060940*
060950 01  WS-C1979-REC.
060960   03  WS-C1979-HOLDCO            PIC X(5).
060970   03  WS-C1979-HC-DIV-1          PIC X(2).
060980   03  WS-C1979-HC-DIV-2          PIC X(2).
060990   03  WS-C1979-HC-DIV-3          PIC X(2).
061000   03  WS-C1979-MASTER-BC         PIC X(8).
061010   03  WS-C1979-MBC-DIV-1         PIC X(2).
061020   03  WS-C1979-MBC-DIV-2         PIC X(2).
061030   03  WS-C1979-MBC-DIV-3         PIC X(2).
061040   03  WS-C1979-BC                PIC X(8).
061050   03  WS-C1979-PRI-BR            PIC X(5).
061060   03  FILLER                     PIC X(2).
061070   03  WS-C1979-FI-FLAG           PIC X.
061080   03  FILLER                     PIC X(3).
061090   03  WS-C1979-AM-FLAG           PIC X.
061100   03  FILLER                     PIC X(4).
061110   03  WS-C1979-COMMENT           PIC X(22).
061120   03  WS-C1979-IGNORE-FLAG       PIC X.
061130   03  FILLER                     PIC X(8).
061140*
061150 01  WS-C1979-TABLE.
061160   03  WS-C1979-ENTRY-COUNT       PIC 9(4)       COMP.
061170   03  WS-C1979-TBL-REC           OCCURS 3000 TIMES
061180                                  INDEXED BY IX-WS-C1979-TBL
061190                                  PIC X(80).
061200*
061210 01  WS-556-TABLE.
061220   03  WS-556-ENTRY-COUNT         PIC S9(5)      COMP.
061230   03  WS-556-REC.
061240     05  WS-556-KEY.
061250       07  WS-556-KEY-BC          PIC X(8).
061260       07  WS-556-KEY-SEQ         PIC X(4).
061270     05  WS-556-UPDATE            PIC X(6).
061280     05  WS-556-SUM-FLDS.
061290       07  WS-556-SUM-BC          PIC X(8).
061300       07  WS-556-SUM-BR          PIC X(5).
061310       07  WS-556-SUM-SI          PIC X(2).
061320     05  WS-556-MATCH-FLDS.
061330       07  WS-556-LOW-BR          PIC X(5).
061340       07  WS-556-HIGH-BR         PIC X(5).
061350       07  WS-556-MEDIUM          PIC X.
061360       07  WS-556-NACHA           PIC X(7).
061370       07  WS-556-PO-FLG          PIC X.
061380       07  WS-556-PRODUCT         PIC X(13).
061390   03  WS-556-TBL-ENTRY           OCCURS 16000 TIMES
061400                                  INDEXED BY IX-WS-556-TBL
061410                                  PIC X(65).
061420*
061430 01  WS-561-TABLE.
061440   03  WS-561-ENTRY-COUNT         PIC S9(9)      COMP.
061450   03  WS-561-TBL-ENTRY           OCCURS 60000 TIMES
061460                                  INDEXED BY IX-WS-561-TBL.
061470     05  WS-561-BILLING-BC        PIC X(8).
061480     05  WS-561-RECORD-KEY        PIC X(12).
061490*
061500 01  WS-563-TABLE.
061510   03  WS-563-ENTRY-COUNT         PIC S9(4)      COMP.
061520   03  WS-563-TBL-ENTRY           OCCURS 3500 TIMES
061530                                  INDEXED BY IX-WS-563-TBL.
061540     05  WS-563-CHANGE-BC         PIC X(8).
061550     05  WS-563-RECORD-KEY        PIC X(12).
061560*
061570 01  WS-567-TABLE.
061580   03  WS-567-ENTRY-COUNT         PIC S9(3)      COMP.
061590   03  WS-567-TBL-ENTRY           OCCURS 200 TIMES
061600                                  INDEXED BY IX-WS-567-TBL.
061610     05  WS-567-CHANGE-BC         PIC X(8).
061620     05  WS-567-RECORD-KEY        PIC X(9).
061630*
061640 01  WS-575-REC.
061650   03  WS-575-NACHA-CODE.
061660     05  WS-575-TAPE-CODE         PIC X(3).
061670     05  WS-575-BATCH-CODE        PIC X(4).
061680   03  WS-575-PRI-BR              PIC X(5).
061690   03  WS-575-SEC-BR              PIC X(5).
061700   03  WS-575-BILLING-TYPE        PIC X(2).
061710   03  WS-575-RECORD-TYPE         PIC X.
061720     88  WS-575-GENERAL-INFO        VALUE 'A'.
061730     88  WS-575-COMMENT-INFO        VALUE 'B'.
061740     88  WS-575-MAILING-INFO        VALUE 'C'.
061750     88  WS-575-DETAIL-INFO        VALUES 'D', 'K', 'P', 'T', 'X'.
061760     88  WS-575-BATCH-INFO          VALUES 'E', 'J'.
061770     88  WS-575-SPL-DETAIL-INFO    VALUES 'F', 'L', 'Q', 'U', 'Y'.
061780   03  WS-575-RECORD-NUMBER       PIC X.
061790*
061800   03  WS-575-A-INFO.
061810     05  WS-575-A-RUN-CODE        PIC X.
061820     05  WS-575-A-TAPE-TYPE       PIC X(2).
061830     05  WS-575-A-MERGE-REGION    PIC X(2).
061840     05  WS-575-A-MERGE-NUMBER    PIC X(8).
061850     05  WS-575-A-RPT-DETAIL-OPT  PIC X.
061860     05  WS-575-A-RPT-SUBTOT-OPT  PIC X.
061870     05  WS-575-A-DUP-RPT-OPT     PIC X.
061880     05  WS-575-A-ZERO-AMT-OPT    PIC X.
061890     05  WS-575-A-PRIORITY-CD     PIC X(2).
061900     05  WS-575-A-DEST-ID         PIC X(10).
061910     05  WS-575-A-ORIGIN-ID       PIC X(10).
061920     05  WS-575-A-TRANS-DATE-OPT  PIC X.
061930     05  WS-575-A-TRANS-TIME-OPT  PIC X.
061940     05  WS-575-A-FILE-ID-MOD     PIC X.
061950     05  WS-575-A-FORMAT-CODE     PIC X.
061960     05  WS-575-A-DEST-NAME       PIC X(23).
061970     05  WS-575-A-ORIGIN-NAME     PIC X(23).
061980     05  WS-575-A-REF-CODE        PIC X(8).
061990     05  WS-575-A-SPL-EFF-DATE-OPT PIC X.
062000     05  WS-575-A-PADDING-FALG    PIC X.
062010     05  FILLER                   PIC X(15).
062020*
062030   03  WS-575-B-INFO REDEFINES WS-575-A-INFO.
062040     05  WS-575-B-COMMENT         PIC X(114).
062050*
062060   03  WS-575-C-INFO REDEFINES WS-575-A-INFO.
062070     05  WS-575-C-MAIL-LN-1-4     PIC X(34).
062080     05  WS-575-C-MAIL-LN-2-5     PIC X(34).
062090     05  WS-575-C-MAIL-LN-3-6     PIC X(34).
062100     05  FILLER                   PIC X(12).
062110*
062120   03  WS-575-D-INFO REDEFINES WS-575-A-INFO.
062130     05  WS-575-D-PROD-CD-OPT     PIC X.
062140     05  WS-575-D-PROC-AMT-OPT    PIC X.
062150     05  WS-575-D-BILL-DR-TC      PIC X(2).
062160     05  WS-575-D-BILL-CR-TC      PIC X(2).
062170     05  WS-575-D-BILL-0-TC       PIC X(2).
062180     05  WS-575-D-PRE-N-DR-TC     PIC X(2).
062190     05  WS-575-D-PRE-N-CR-TC     PIC X(2).
062200     05  WS-575-D-PRE-N-0-TC      PIC X(2).
062210     05  WS-575-D-FORCED-BC       PIC X(9).
062220     05  WS-575-D-ACCT-OPT        PIC X.
062230     05  WS-575-D-SPL-REC-DEF     PIC X.
062240     05  WS-575-D-IND-ID-OPT      PIC X.
062250     05  FILLER                   PIC X.
062260     05  WS-575-D-IND-ID-DATA     PIC X(15).
062270     05  WS-575-D-IND-NAME-OPT    PIC X.
062280     05  FILLER                   PIC X.
062290     05  WS-575-D-IND-NAME-DATA   PIC X(22).
062300     05  WS-575-D-DSCR-DATA-OPT   PIC X.
062310     05  WS-575-D-DSCR-DATA       PIC X(2).
062320     05  WS-575-D-ACCT-CONSTANT   PIC X(2).
062330     05  WS-575-D-ADDENDA-OPT     PIC X.
062340     05  WS-575-D-ZERO-DTL-OPT    PIC X.
062350     05  WS-575-D-SAV-TC-OPT      PIC X.
062360     05  WS-575-D-RSL-SUM-OPT     PIC X.
062370     05  WS-575-D-EXP-SUM-OPT     PIC X.
062380     05  WS-575-D-TC-OVR-SCOPE    PIC X.
062390     05  WS-575-D-BC-OVR-SCOPE    PIC X.
062400     05  FILLER                   PIC X(36).
062410*
062420   03  WS-575-E-INFO REDEFINES WS-575-A-INFO.
062430     05  WS-575-E-BATCH-PRT-OPT   PIC X.
062440     05  WS-575-E-BATCH-NAME      PIC X(15).
062450     05  WS-575-E-SERVICE-CLASS   PIC X(3).
062460     05  WS-575-E-COMPANY-NAME    PIC X(16).
062470     05  WS-575-E-CO-DSCR-DATA    PIC X(20).
062480     05  WS-575-E-COMPANY-ID      PIC X(10).
062490     05  WS-575-E-STD-ENT-CLASS   PIC X(3).
062500     05  WS-575-E-ENTRY-DESCR     PIC X(10).
062510     05  WS-575-E-DESCR-DT-OPT    PIC X.
062520     05  WS-575-E-EFF-DT-OPT      PIC X.
062530     05  WS-575-E-ORIG-ST-CD      PIC X.
062540     05  WS-575-E-ORIG-DFI-ID     PIC X(8).
062550     05  WS-575-E-BATCH-NBR-CNS   PIC X(7).
062560     05  WS-575-E-GL-BTCH-OPT     PIC X.
062570     05  WS-575-E-SPL-TRLR-OPT    PIC X.
062580     05  WS-575-E-OVERFLOW.
062590       07  WS-575-E-TRACE-BC-OVER PIC X(8).
062600       07  WS-575-E-TRACE-SEQ-OPT PIC X.
062610       07  WS-575-E-TRACE-SEQ-CNS PIC X(7).
062620*
062630   03  WS-575-F-INFO REDEFINES WS-575-A-INFO.
062640     05  WS-575-F-NORM-DR-TC      PIC X(2).
062650     05  WS-575-F-NORM-CR-TC      PIC X(2).
062660     05  WS-575-F-NORM-0-TC       PIC X(2).
062670     05  WS-575-F-PRE-N-DR-TC     PIC X(2).
062680     05  WS-575-F-PRE-N-CR-TC     PIC X(2).
062690     05  WS-575-F-PRE-N-0-TC      PIC X(2).
062700     05  WS-575-F-BC              PIC X(9).
062710     05  WS-575-F-ACCT-NBR        PIC X(17).
062720     05  WS-575-F-AMT-OPT         PIC X.
062730     05  WS-575-F-IND-ID-DATA     PIC X(15).
062740     05  WS-575-F-IND-NAME-DATA   PIC X(22).
062750     05  WS-575-F-DSCR-DATA       PIC X(2).
062760     05  WS-575-F-DEFER-FLG       PIC X.
062770     05  WS-575-F-DIR-DEP-FLG     PIC X.
062780     05  WS-575-F-EACH-BR-FLG     PIC X.
062790     05  WS-575-F-ACCT-FMT-WTS    PIC X(17).
062800     05  WS-575-F-ACCT-CALC-FMLA  PIC X(4).
062810     05  FILLER                   PIC X(12).
062820*
062830 01  WS-575-TABLE.
062840   03  WS-575-ENTRY-COUNT         PIC S9(5)      COMP.
062850   03  WS-575-TBL-ENTRY           OCCURS 50000 TIMES
062860                                  INDEXED BY IX-WS-575-TBL.
062870     05  WS-575-TBL-NACHA-CODE.
062880       07  WS-575-TBL-TAPE-CODE   PIC X(3).
062890       07  WS-575-TBL-BATCH-CODE  PIC X(4).
062900     05  FILLER                   PIC X(128).
062910*
062920 01  WS-877-REC.
062930   03  WS-877-COMMON-FIELDS.
062940     05  WS-877-CONSID-NBR        PIC X(5).
062950     05  WS-877-REC-TYPE          PIC X.
062960     05  WS-877-RECORD-NBR        PIC X(3).
062970     05  WS-877-UPDATE-DATE       PIC X(6).
062980*
062990   03  WS-877-1-GENERAL-INFO.
063000     05  WS-877-1-CONSID-METH     PIC X.
063010     05  WS-877-1-CONSID-PERIOD   PIC X.
063020     05  WS-877-1-YEAR-END-WK     PIC X(2).
063030     05  WS-877-1-CHECK-LEVEL     PIC X.
063040     05  WS-877-1-CR-BC           PIC X(8).
063050     05  WS-877-1-CR-PRI-BR       PIC X(5).
063060     05  WS-877-1-CR-SEC-BR       PIC X(5).
063070     05  WS-877-1-CR-BILL-TYPE    PIC X(2).
063080     05  WS-877-1-CR-BILL-ACCT    PIC X(20).
063090     05  WS-877-1-ORG-NAME        PIC X(35).
063100     05  WS-877-1-PROG-START-DT   PIC X(6).
063110     05  WS-877-1-PROG-END-DATE   PIC X(6).
063120     05  WS-877-1-PR-BKDWN-OPT    PIC X.
063130     05  WS-877-1-PRICE-DESIG     PIC X(2).
063140     05  WS-877-1-LDGR-ACCT-2     PIC X(4).
063150     05  WS-877-1-RPT-SEL         PIC X.
063160     05  WS-877-1-HC-GRP-OVER     PIC X.
063170     05  WS-877-1-MBC-GRP-OVER    PIC X.
063180     05  WS-877-1-USE-PR-UNITS    PIC X.
063190     05  WS-877-1-CREDIT-HOLD-DAYS PIC 9(2).
063200     05  FILLER                   PIC X(62).
063210*
063220   03  WS-877-2-NRML-RPT-FMT-INFO
063230           REDEFINES WS-877-1-GENERAL-INFO.
063240     05  WS-877-2-CAT-SEL         PIC X.
063250     05  WS-877-2-ORDS-SEL        PIC X.
063260     05  WS-877-2-UNITS-SEL       PIC X.
063270     05  WS-877-2-NET-SLS-SEL     PIC X.
063280     05  WS-877-2-DELIV-SEL       PIC X.
063290     05  WS-877-2-BASE-SEL        PIC X.
063300     05  WS-877-2-PR-ADJ-SEL      PIC X.
063310     05  WS-877-2-OTH-ADJ-SEL     PIC X.
063320     05  WS-877-2-ADJ-BASE-SEL    PIC X.
063330     05  WS-877-2-ANNUAL-SEL      PIC X.
063340     05  WS-877-2-RATE-SEL        PIC X.
063350     05  WS-877-2-CN-CD-LVL-SEL   PIC X.
063360     05  WS-877-2-HLDCO-LVL-SEL   PIC X.
063370     05  WS-877-2-HC-D1-LVL-SEL   PIC X.
063380     05  WS-877-2-HC-D2-LVL-SEL   PIC X.
063390     05  WS-877-2-HC-D3-LVL-SEL   PIC X.
063400     05  WS-877-2-MBC-LVL-SEL     PIC X.
063410     05  WS-877-2-MBC-1-LVL-SEL   PIC X.
063420     05  WS-877-2-MBC-2-LVL-SEL   PIC X.
063430     05  WS-877-2-MBC-3-LVL-SEL   PIC X.
063440     05  WS-877-2-BC-LVL-SEL      PIC X.
063450     05  WS-877-2-PRI-B-LVL-SEL   PIC X.
063460     05  WS-877-2-SEC-B-LVL-SEL   PIC X.
063470     05  WS-877-2-B-TYP-LVL-SEL   PIC X.
063480     05  WS-877-2-PG-BK-FLG       PIC X.
063490     05  FILLER                   PIC X(68).
063500     05  WS-877-2-R7-RP-LVL-SEL   PIC X.
063510     05  WS-877-2-R7-BC-LVL-SEL   PIC X.
063520     05  WS-877-2-R7-PB-LVL-SEL   PIC X.
063530     05  WS-877-2-R7-TY-LVL-SEL   PIC X.
063540     05  WS-877-2-R7-BC-PG-OPT    PIC X.
063550     05  WS-877-2-R7-CAT-31-36    PIC X.
063560     05  WS-877-2-R7-CTY-ST-OPT   PIC X.
063570     05  FILLER                   PIC X(67).
063580*
063590   03  WS-877-3-RPT-HDG-INFO
063600           REDEFINES WS-877-1-GENERAL-INFO.
063610     05  WS-877-3-CATG-HEADING    PIC X(20).
063620     05  WS-877-3-ORDS-HEADING    PIC X(10).
063630     05  WS-877-3-UNITS-HEADING   PIC X(10).
063640     05  WS-877-3-B-AND-D-HEAD    PIC X(15).
063650     05  WS-877-3-DELIV-HEAD      PIC X(13).
063660     05  WS-877-3-BASE-HEADING    PIC X(15).
063670     05  WS-877-3-PR-ADJ-HEAD     PIC X(13).
063680     05  WS-877-3-OTH-ADJ-HEAD    PIC X(13).
063690     05  WS-877-3-ADJ-BASE-HEAD   PIC X(15).
063700     05  WS-877-3-ANNUAL-HEAD     PIC X(15).
063710     05  WS-877-3-RATE-HEADING    PIC X(15).
063720     05  WS-877-3-CONSID-HEAD     PIC X(13).
063730*
063740   03  WS-877-4-PROD-GROUP-INFO
063750           REDEFINES WS-877-1-GENERAL-INFO.
063760     05  WS-877-4-CONSID-TYPE     PIC X.
063770       88  WS-877-4-FLAT            VALUE 'F'.
063780       88  WS-877-4-GENERIC         VALUE 'G'.
063790       88  WS-877-4-TIERED          VALUE 'T'.
063800     05  WS-877-4-CAT-TITLE       PIC X(20).
063810     05  WS-877-4F-FLAT-INFO.
063820       07  WS-877-4F-YRLY-AMT     PIC 9(7)V9(2)  COMP-3.
063830       07  WS-877-4F-INST-ID      PIC X(20).
063840       07  WS-877-4F-PLT-NBR-1    PIC X(4).
063850       07  WS-877-4F-PLT-PCT-1    PIC S9(3)V9(2) COMP-3.
063860       07  WS-877-4F-PLT-NBR-2    PIC X(4).
063870       07  WS-877-4F-PLT-PCT-2    PIC S9(3)V9(2) COMP-3.
063880       07  WS-877-4F-PLT-NBR-3    PIC X(4).
063890       07  WS-877-4F-PLT-PCT-3    PIC S9(3)V9(2) COMP-3.
063900       07  WS-877-4F-PLT-NBR-4    PIC X(4).
063910       07  WS-877-4F-PLT-PCT-4    PIC S9(3)V9(2) COMP-3.
063920       07  WS-877-4F-PLT-NBR-5    PIC X(4).
063930       07  WS-877-4F-PLT-PCT-5    PIC S9(3)V9(2) COMP-3.
063940       07  FILLER                 PIC X(86).
063950     05  WS-877-4G-GENERIC-INFO
063960             REDEFINES WS-877-4F-FLAT-INFO.
063970       07  WS-877-4G-BASIS-CD     PIC X.
063980       07  WS-877-4G-RATE.
063990         09  WS-877-4G-PCT        PIC S9(2)V9(3) COMP-3.
064000         09  WS-877-4G-DLRS REDEFINES WS-877-4G-PCT
064010                                  PIC S9(2)V9(2) COMP-3.
064020       07  WS-877-4G-RED-BASIS    PIC X.
064030       07  WS-877-4G-RED-RATE.
064040         09  WS-877-4G-RED-PCT    PIC S9(2)V9(3) COMP-3.
064050         09  WS-877-4G-RED-DLRS REDEFINES WS-877-4G-RED-PCT
064060                                  PIC S9(2)V9(2) COMP-3.
064070       07  FILLER                 PIC X(138).
064080     05  WS-877-4T-TIERED-INFO
064090             REDEFINES WS-877-4F-FLAT-INFO.
064100       07  WS-877-4T-ANNL-MTHD    PIC X.
064110       07  WS-877-4T-OTH-ADJ      PIC S9(9)V9(2) COMP-3.
064120       07  WS-877-4T-RED-BASIS    PIC X.
064130       07  WS-877-4T-RED-RATE.
064140         09  WS-877-4T-RED-PCT    PIC S9(2)V9(3) COMP-3.
064150         09  WS-877-4T-RED-DLRS REDEFINES WS-877-4T-RED-PCT
064160                                  PIC S9(2)V9(2) COMP-3.
064170       07  WS-877-4T-TIER-COUNT   PIC S9(3)        COMP-3.
064180       07  WS-877-4T-TIER-INFO    OCCURS 10 TIMES
064190                                  INDEXED BY WS-877-4T-IX.
064200         09  WS-877-4T-MIN-ANNL   PIC S9(9)V9(2) COMP-3.
064210         09  WS-877-4T-BASIS-CD   PIC X.
064220         09  WS-877-4T-RATE.
064230           11  WS-877-4T-PCT      PIC S9(2)V9(3) COMP-3.
064240           11  WS-877-4T-DLRS REDEFINES WS-877-4T-PCT
064250                                  PIC S9(2)V9(2) COMP-3.
064260       07  FILLER                 PIC X(33).
064270*
064280   03  WS-877-5-PRODUCT-INFO
064290           REDEFINES WS-877-1-GENERAL-INFO.
064300     05  WS-877-5-MATCH-PROD-CD   PIC X(13).
064310     05  WS-877-5-MATCH-D-Q       PIC X(5).
064320     05  WS-877-5-MATCH-UNITS     PIC X(7).
064330     05  WS-877-5-MATCH-AOE       PIC X.
064340     05  WS-877-5-MATCH-BIL-MED   PIC X.
064350     05  WS-877-5-MATCH-REORDER   PIC X.
064360     05  WS-877-5-GROUP-1-CODE    PIC X(2).
064370     05  WS-877-5-GROUP-1-INCL    PIC X.
064380     05  WS-877-5-GROUP-2-CODE    PIC X(2).
064390     05  WS-877-5-GROUP-2-INCL    PIC X.
064400     05  WS-877-5-GROUP-3-CODE    PIC X(2).
064410     05  WS-877-5-GROUP-3-INCL    PIC X.
064420     05  WS-877-5-GROUP-4-CODE    PIC X(2).
064430     05  WS-877-5-GROUP-4-INCL    PIC X.
064440     05  WS-877-5-GROUP-5-CODE    PIC X(2).
064450     05  WS-877-5-GROUP-5-INCL    PIC X.
064460     05  WS-877-5-GROUP-6-CODE    PIC X(2).
064470     05  WS-877-5-GROUP-6-INCL    PIC X.
064480     05  WS-877-5-GROUP-7-CODE    PIC X(2).
064490     05  WS-877-5-GROUP-7-INCL    PIC X.
064500     05  WS-877-5-GROUP-8-CODE    PIC X(2).
064510     05  WS-877-5-GROUP-8-INCL    PIC X.
064520     05  WS-877-5-GROUP-9-CODE    PIC X(2).
064530     05  WS-877-5-GROUP-9-INCL    PIC X.
064540     05  WS-877-5-GROUP-10-CODE   PIC X(2).
064550     05  WS-877-5-GROUP-10-INCL   PIC X.
064560     05  WS-877-5-MATCH-BC        PIC X(8).
064570     05  WS-877-5-MATCH-PRI-BR    PIC X(5).
064580     05  WS-877-5-MATCH-ORDER-CHANNEL PIC X.
064590     05  FILLER                   PIC X(95).
064600*
064610 01  WS-877-TABLE.
064620   03  WS-877-ENTRY-COUNT         PIC S9(5)      COMP.
064630   03  WS-877-TBL-ENTRY           OCCURS 70000 TIMES
064640                                  INDEXED BY IX-WS-877-TBL.
064650     05  WS-877-TBL-CONSID-NBR    PIC X(5).
064660     05  FILLER                   PIC X(177).
064670*
064680 01  WS-896-REC.
064690   03  WS-896-COMMON-FIELDS.
064700     05  WS-896-REPORT-NBR        PIC X(6).
064710     05  WS-896-RECORD-TYPE       PIC X.
064720     05  WS-896-C-J-REC-NBR.
064730       07  WS-896-F-COL-CD.
064740         09  WS-896-H-CAT-CD.
064750           11  WS-896-B-D-REC-NBR.
064760             13  WS-896-I-RP-LV   PIC X.
064770           11  FILLER             PIC X.
064780       07  FILLER                 PIC X(2).
064790     05  WS-896-C-ALT-ADDR-FLG    PIC X.
064800     05  WS-896-UPDATE-DATE       PIC X(6).
064810*
064820   03  WS-896-A-INFO.
064830     05  WS-896-A-REPORT-NAME     PIC X(35).
064840     05  WS-896-A-RPT-PERIOD      PIC X.
064850     05  WS-896-A-LST-WK-FI-YR    PIC X(2).
064860     05  WS-896-A-PROD-TRNC-FLG   PIC X.
064870     05  WS-896-A-NAME-LENGTH     PIC X(2).
064880     05  WS-896-A-ACCT-LENGTH     PIC X(2).
064890     05  WS-896-A-PO-NBR-LENGTH   PIC X(2).
064900     05  WS-896-A-RPT-MEDIUM      PIC X.
064910     05  WS-896-A-RPT-COPIES      PIC X.
064920     05  WS-896-A-HC-GRP-SUPRS    PIC X.
064930     05  WS-896-A-MBC-GRP-SUPRS   PIC X.
064940     05  WS-896-A-NP-CUT-TYPE-F   PIC X.
064950     05  WS-896-A-NP-CVR-ETC-FL   PIC X.
064960     05  WS-896-A-NP-BUS-DEP-FL   PIC X.
064970     05  WS-896-A-NP-OTHER-FLAG   PIC X.
064980     05  WS-896-A-PC-OUTPUT-FLG   PIC X.
064990     05  WS-896-A-MAIL-TO-RPT     PIC X(6).
065000     05  WS-896-A-MANUAL-RPT      PIC X(1).
065010     05  WS-896-A-MAIL-BY-BR      PIC X(1).
065020     05  WS-896-A-CHARGEABLE-FLAG PIC X(1).
065030     05  WS-896-A-BILL-TO-BC      PIC X(8).
065040     05  WS-896-A-MANUAL-HOURS    PIC X(2).
065050     05  WS-896-A-SHIPPING-CD     PIC X(2).
065060     05  FILLER                   PIC X(44).
065070*
065080   03  WS-896-B-INFO REDEFINES WS-896-A-INFO.
065090     05  WS-896-B-COMMENT-LINE    PIC X(109).
065100     05  FILLER                   PIC X(10).
065110*
065120   03  WS-896-C-INFO REDEFINES WS-896-A-INFO.
065130     05  WS-896-C-BRANCH-NBR      PIC X(5).
065140     05  WS-896-C-LBL-LN-1-OR-4   PIC X(34).
065150     05  WS-896-C-LBL-LN-2-OR-5   PIC X(34).
065160     05  WS-896-C-LBL-LN-3-OR-6   PIC X(34).
065170     05  WS-896-C-BARCODE-ZIP     PIC X(12).
065180*
065190   03  WS-896-D-INFO REDEFINES WS-896-A-INFO.
065200     05  WS-896-D-HEADING-TEXT    PIC X(80).
065210     05  FILLER                   PIC X(39).
065220*
065230   03  WS-896-E-INFO REDEFINES WS-896-A-INFO.
065240     05  WS-896-E-DTL-COL-01      PIC X(2).
065250     05  WS-896-E-DTL-COL-02      PIC X(2).
065260     05  WS-896-E-DTL-COL-03      PIC X(2).
065270     05  WS-896-E-DTL-COL-04      PIC X(2).
065280     05  WS-896-E-DTL-COL-05      PIC X(2).
065290     05  WS-896-E-DTL-COL-06      PIC X(2).
065300     05  WS-896-E-DTL-COL-07      PIC X(2).
065310     05  WS-896-E-DTL-COL-08      PIC X(2).
065320     05  WS-896-E-DTL-COL-09      PIC X(2).
065330     05  WS-896-E-DTL-COL-10      PIC X(2).
065340     05  WS-896-E-DTL-COL-11      PIC X(2).
065350     05  WS-896-E-DTL-COL-12      PIC X(2).
065360     05  WS-896-E-DTL-COL-13      PIC X(2).
065370     05  WS-896-E-SUM-COL-01      PIC X(2).
065380     05  WS-896-E-SUM-COL-02      PIC X(2).
065390     05  WS-896-E-SUM-COL-03      PIC X(2).
065400     05  WS-896-E-SUM-COL-04      PIC X(2).
065410     05  WS-896-E-SUM-COL-05      PIC X(2).
065420     05  WS-896-E-SUM-COL-06      PIC X(2).
065430     05  WS-896-E-SUM-COL-07      PIC X(2).
065440     05  WS-896-E-SUM-COL-08      PIC X(2).
065450     05  WS-896-E-SUM-COL-09      PIC X(2).
065460     05  WS-896-E-SUM-COL-10      PIC X(2).
065470     05  WS-896-E-SUM-COL-11      PIC X(2).
065480     05  WS-896-E-SUM-COL-12      PIC X(2).
065490     05  WS-896-E-SUM-COL-13      PIC X(2).
065500     05  FILLER                   PIC X(67).
065510*
065520   03  WS-896-F-INFO REDEFINES WS-896-A-INFO.
065530     05  WS-896-F-HD-1-OVERRIDE   PIC X(36).
065540     05  WS-896-F-HD-2-OVERRIDE   PIC X(36).
065550     05  WS-896-F-HD-3-OVERRIDE   PIC X(36).
065560     05  FILLER                   PIC X(11).
065570*
065580   03  WS-896-G-INFO REDEFINES WS-896-A-INFO.
065590     05  WS-896-G-SUM-FTNOTE      PIC X(109).
065600     05  FILLER                   PIC X(10).
065610*
065620   03  WS-896-H-INFO REDEFINES WS-896-A-INFO.
065630     05  WS-896-H-CAT-TITLE       PIC X(20).
065640     05  FILLER                   PIC X(99).
065650*
065660   03  WS-896-I-INFO REDEFINES WS-896-A-INFO.
065670     05  WS-896-I-RPT-SEL         PIC X.
065680     05  WS-896-I-DTL-PROD-TOT    PIC X.
065690     05  WS-896-I-DTL-CAT-TOT     PIC X.
065700     05  WS-896-I-DTL-FI-TOT      PIC X.
065710     05  WS-896-I-SUM-TOT-OPT     PIC X.
065720     05  WS-896-I-SUM-RECAP-LVL   PIC X.
065730     05  WS-896-I-RECAP-TOT-OPT   PIC X.
065740     05  WS-896-I-RECAP-PG-BRK    PIC X.
065750     05  WS-896-I-OMIT-INSTR      PIC X.
065760     05  WS-896-I-OMIT-CATS.
065770       07  WS-896-I-OMIT-CAT      OCCURS 50 TIMES
065780                                  INDEXED BY WS-896-I-IX-OMIT
065790                                  PIC X(2).
065800     05  FILLER                   PIC X(10).
065810*
065820   03  WS-896-J-INFO REDEFINES WS-896-A-INFO.
065830     05  WS-896-J-ASSIGN-CAT      PIC X(2).
065840     05  WS-896-J-MATCH-BC        PIC X(8).
065850     05  WS-896-J-MATCH-PRI-BR    PIC X(5).
065860     05  WS-896-J-MATCH-SEC-BR    PIC X(5).
065870     05  WS-896-J-MATCH-BIL-TYP   PIC X(2).
065880     05  WS-896-J-MATCH-PROD-CD   PIC X(13).
065890     05  WS-896-J-MATCH-BL-ACCT   PIC X(20).
065900     05  WS-896-J-MATCH-PR-ACCT   PIC X(20).
065910     05  WS-896-J-MATCH-PUR-ORD   PIC X(15).
065920     05  WS-896-J-MATCH-BIL-MED   PIC X.
065930     05  WS-896-J-MATCH-AOE-FLG   PIC X.
065940     05  WS-896-J-MATCH-REORDER   PIC X.
065950     05  WS-896-J-MATCH-NACHA     PIC X(7).
065960     05  WS-896-J-MATCH-CR-FLAG   PIC X.
065970     05  WS-896-J-MATCH-SEP-INV   PIC X(2).
065980     05  WS-896-J-MATCH-DW-FLAG   PIC X.
065990     05  FILLER                   PIC X(15).
066000*
066010 01  WS-896-TABLE.
066020   03  WS-896-ENTRY-COUNT         PIC S9(5)      COMP.
066030   03  WS-896-TBL-ENTRY           OCCURS 122000 TIMES
066040                                  INDEXED BY IX-WS-896-TBL.
066050     05  WS-896-TBL-REPORT-NBR    PIC X(6).
066060     05  FILLER                   PIC X(131).
066070*
066080 COPY T8920W.
066090*
066100 01  WS-8920-TABLE.
066110   03  WS-8920-ENTRY-COUNT        PIC 9(4)       COMP.
066120   03  WS-8920-TBL-REC            OCCURS 3000 TIMES
066130                                  INDEXED BY IX-WS-8920-TBL.
066140     05  WS-8920-TBL-CONSID-NBR   PIC X(5).
066150     05  FILLER                   PIC X.
066160     05  WS-8920-TBL-BC           PIC X(8).
066170     05  FILLER                   PIC X(202).
066180*
066190 01  WS-662P-INFO-FOR-8935.
066200   03  WS-662P-EXP-CD-FOR-8935    PIC X(2).
066210   03  WS-662P-DESCR-FOR-8935     PIC X(25).
066220   03  WS-662P-FOR-8935-FLAG      PIC X.
066230     88  FOUND-662P-FOR-8935        VALUE 'Y'.
066240*
066250 01  WS-662P-BC-TABLE.
066260   03  WS-662P-BC-ENT-CT          PIC 9(3)       COMP.
066270   03  WS-662P-BC-ENTRY           OCCURS 0 TO 300 TIMES
066280*                * NO 80% MESSAGE PROVIDED.  TABLE CANNOT
066290*                 OVERFLOW.  THERE ARE ONLY 288 EXPENSE CODES.  *
066300                                  DEPENDING ON WS-662P-BC-ENT-CT
066310                                  INDEXED BY IX-WS-662P-BC-TBL.
066320     05  WS-662P-BC-TBL-EXP-CD    PIC X(2).
066330     05  WS-662P-BC-TBL-DESCR     PIC X(25).
066340*
066350 01  WS-662P-NON-BC-TABLE.
066360   03  WS-662P-NBC-ENT-CT         PIC 9(3)       COMP.
066370   03  WS-662P-NBC-ENTRY          OCCURS 0 TO 300 TIMES
066380*                * NO 80% MESSAGE PROVIDED.  TABLE CANNOT
066390*                 OVERFLOW.  THERE ARE ONLY 288 EXPENSE CODES.  *
066400                                  DEPENDING ON WS-662P-NBC-ENT-CT
066410                                  INDEXED BY IX-WS-662P-NBC-TBL.
066420     05  WS-662P-NBC-TBL-EXP-CD   PIC X(2).
066430     05  WS-662P-NBC-TBL-DESCR    PIC X(25).
066440*
066450 01  WS-1130P-REC.
066460   03  WS-1130P-CONSID-NBR        PIC X(5).
066470   03  FILLER                     PIC X.
066480   03  WS-1130P-PRODUCT-CODE      PIC X(13).
066490   03  WS-1130P-NAME              PIC X(27).
066500   03  WS-1130P-PRODUCT-DESC      PIC X(17).
066510   03  FILLER                     PIC X(17).
066520*
066530 01  WS-1130P-HOLD.
066540   03  WS-1130P-HOLD-CONSID-NBR     PIC X(5).
066550   03  WS-1130P-HOLD-PROD-CODE      PIC X(13).
066560*
066570 01  WS-1130P-TABLE.
066580   03  WS-1130P-ENTRY-COUNT         PIC S9(5)      COMP.
066590   03  WS-1130P-TBL-ENTRY           OCCURS 70000 TIMES
066600                                    ASCENDING KEY IS
066610                                    WS-1130P-TBL-CONSID-NBR
066620                                    INDEXED BY IX-WS-1130P-TBL.
066630     05  WS-1130P-TBL-CONSID-NBR    PIC X(5).
066640     05  WS-1130P-TBL-PRODUCT-CODE  PIC X(13).
066650     05  WS-1130P-TBL-NAME          PIC X(27).
066660     05  WS-1130P-TBL-PRODUCT-DESC  PIC X(17).
066670*
066680 01  WS-RETURN-CODE-LINE.
066690   03  FILLER                    PIC X(14) VALUE 'RETURN CODE = '.
066700   03  WS-RETURN-CODE             PIC 9(2)       DISPLAY VALUE 00.
066710   03  FILLER                     PIC X          VALUE '.'.
066720*
066730 COPY CPY108.
066740*
066750 COPY CPY099.
066760*
066770 COPY T0864W.
066780*
066790 01  WS-MIS104-REQUIRED-FIELDS.
066800   03  WS-MIS104                     PIC X(8) VALUE 'mis10400'.
066810   03  WS-MIS104-FLAGS.
066820     05  WS-CALL-TYPE-FLAG             PIC X  VALUE 'C'.
066830     05  WS-FUNCTION-FLAG              PIC X.
066840       88  WS-STRING-COMPRESS             VALUE 'C'.
066850       88  WS-UNSTRING-EXPAND             VALUE 'E'.
066860       88  WS-FUNCTION-UNSUCCESSFUL       VALUE 'U'.
066870   03  WS-W864-TOTAL-LENGTH          PIC S9(4)  COMP.
066880   03  WS-W864-VARIABLE-INFO.
066890     05  WS-W864-VARIABLE-DATA-BYTE OCCURS 0 TO 2118 TIMES
066900                                    DEPENDING ON
066910                                    WS-W864-TOTAL-LENGTH
066920                                    PIC X.
066930*
066940 01  LS-PARM-INFO.
066950   03  LS-PARM-LENGTH             PIC S9(4)      COMP.
066960   03  LS-PARM-DATA               PIC X(100).
066970*
066980 01  WS-DISPLAY-PARM.
066990   03  WS-DP-CAPTION             PIC X(14) VALUE 'PARM OPTIONS: '.
067000   03  FILLER                     PIC X          VALUE '"'.
067010   03  WS-DP-STATEMENT            PIC X(20)      VALUE SPACE.
067020   03  FILLER                     PIC X          VALUE '"'.
067030*
067040 COPY CPY004.
067050*
067060 01  WS-PROGRAM-NUMBER            PIC X(8)       VALUE 'BIL02162'.
067070 01  WS-REVISION-DATE             PIC X(8)       VALUE '05-05-14'.
067080*
067090*
067100 LINKAGE SECTION.
067110*
067120 COPY AIXLNCPY.
067130*
067140*
067150 PROCEDURE DIVISION USING BY VALUE PARMCNT
067160           BY REFERENCE OS-PARM.
067170*
067180 0000-SQL-DB-CONNECT.
067190     MOVE 'DLXVSAM' TO DBNAME.
067200 COPY CPYMIGUD.
067210*
067220*
067230   0000-MAIN-LINE.
067240     PERFORM 8000-INITIALIZE.
067250     PERFORM
067260           WITH TEST AFTER
067270           UNTIL END-IPARM-FILE
067280       MOVE IPARM-INFO TO I550-RECORD-KEY
067290       PERFORM 1510-START-READ-I550-FILE
067300       IF WS-I550-SUCCESSFUL
067310           AND (IPARM-BC EQUAL I550-BC)
067320           AND (IPARM-PRI-BR EQUAL SPACE OR I550-PRIMARY-BRANCH)
067330         MOVE 'Y' TO WS-IPARM-I550-MATCH-FLAG
067340       ELSE
067350         MOVE 'N' TO WS-IPARM-I550-MATCH-FLAG
067360         MOVE 'Y' TO WS-RETURN-04-FLAG
067370         DISPLAY 'NO I550 MATCH FOUND FOR IPARM CARD "'
067380               IPARM-INFO '".' UPON SYSOUT
067390         DISPLAY '   550 INFO, AND THAT FROM FILES USING KEYS FROM
067400-              ' 550 INFO (HC, MBC, ETC) WILL BE INCOMPLETE.'
067410               UPON SYSOUT
067420       END-IF
067430       PERFORM 1000-PROCESS-IPARM-CARD
067440       PERFORM 0100-READ-IPARM-FILE
067450     END-PERFORM.
067460     PERFORM 9000-CLOSE.
067470     STOP RUN.
067480*
067490   0100-READ-IPARM-FILE.
067500     READ IPARM-FILE
067510       AT END
067520         MOVE 'E' TO WS-IPARM-FILE-FLAG
067530       NOT AT END
067540         IF IPARM-INFO GREATER WS-IPARM-INFO
067550           MOVE IPARM-INFO TO WS-IPARM-INFO
067560         ELSE
067570           DISPLAY '* IPARM SEQUENCE ERROR "' WS-IPARM-INFO '" "'
067580                 IPARM-INFO '" *' UPON SYSOUT
067590           GO TO 9900-DISPLAY-ABORT
067600         END-IF
067610       END-READ.
067620*
067630   0400-HEAD-EMPTY-SECTION.
067640     IF WS-LINE-COUNT GREATER +85
067650       PERFORM 0700-PRINT-HEADING-1.
067660     MOVE +2 TO WS-LINE-SPACER.
067670     MOVE WS-SECTION-HEADING TO PRINTER1-RECORD.
067680     PERFORM 0600-WRITE-PRINTER1-RECORD.
067690*
067700   0500-CHECK-FOR-HEADINGS.
067710     ADD WS-LINE-COUNT TO WS-LINES-NEEDED.
067720     IF PRINT-FILE-HEAD
067730       IF PRINT-SECTION-HEAD
067740         ADD 4 TO WS-LINES-NEEDED
067750       ELSE
067760         ADD 2 TO WS-LINES-NEEDED.
067770     IF WS-LINES-NEEDED GREATER +87
067780       PERFORM 0700-PRINT-HEADING-1.
067790     IF PRINT-FILE-HEAD
067800       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
067810       MOVE +2 TO WS-LINE-SPACER
067820       IF PRINT-SECTION-HEAD
067830         MOVE SPACE TO WS-SECTION-HEAD-FLAG
067840         MOVE WS-SECTION-HEADING TO PRINTER1-RECORD
067850         PERFORM 0600-WRITE-PRINTER1-RECORD
067860       END-IF
067870       MOVE SPACE TO WS-FILE-HEAD-FLAG
067880       MOVE WS-FILE-HEADING TO PRINTER1-RECORD
067890       PERFORM 0600-WRITE-PRINTER1-RECORD.
067900     MOVE +1 TO WS-LINE-SPACER.
067910*
067920   0600-WRITE-PRINTER1-RECORD.
067930     WRITE PRINTER1-RECORD AFTER WS-LINE-SPACER.
067940     ADD WS-LINE-SPACER TO WS-LINE-COUNT.
067950*
067960   0700-PRINT-HEADING-1.
067970     ADD 1 TO WS-PAGE-NBR.
067980     MOVE WS-PAGE-NBR TO WS-HD1-PAGE-NBR.
067990     MOVE WS-HEADING-1 TO PRINTER1-RECORD.
068000     PERFORM 0800-WRITE-PRINTER1-TOP.
068010     MOVE +1 TO WS-LINE-COUNT.
068020     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
068030*
068040   0800-WRITE-PRINTER1-TOP.
068050     WRITE PRINTER1-RECORD AFTER PAGE.
068060*
068070   1000-PROCESS-IPARM-CARD.
068080     PERFORM 1100-BEGIN-BC.
068090*
068100     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068110     MOVE '  SPECIAL SITUATIONS  ' TO WS-SECT-HD-TITLE.
068120     IF NOT END-IMAIL-FILE
068130       PERFORM 1200-CHECK-IMAIL-FILE.
068140     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
068150       PERFORM 0400-HEAD-EMPTY-SECTION.
068160*
068170     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068180     MOVE '***  PRE-PRICING  ****' TO WS-SECT-HD-TITLE.
068190     IF MATCHED-IPARM-I550
068200       PERFORM 1500-PROCESS-I550-FILE.
068210     IF NOT EMPTY-I550T-FILE
068220       PERFORM 1600-CHECK-I550T-FILE.
068230     IF NOT EMPTY-I864-FILE
068240       PERFORM 1905-CHECK-I864-FILE.
068250     IF NOT EMPTY-I561-FILE
068260       PERFORM 2000-CHECK-I561-FILE.
068270     IF NOT EMPTY-I562-FILE
068280       PERFORM 2100-CHECK-I562-FILE.
068290     IF NOT EMPTY-I563-FILE
068300       PERFORM 2200-CHECK-I563-FILE.
068310     IF NOT EMPTY-I565-FILE
068320       PERFORM 2400-CHECK-I565-FILE.
068330     IF NOT END-I566SUM-FILE
068340       PERFORM 2440-CHECK-I566SUM-FILE.
068350     IF NOT EMPTY-I567-FILE
068360       PERFORM 2500-CHECK-I567-FILE.
068370     IF NOT END-I996P-FILE
068380       PERFORM 2600-CHECK-I996P-FILE.
068390     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
068400       PERFORM 0400-HEAD-EMPTY-SECTION.
068410*
068420     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068430     MOVE '****  INVOICING  *****' TO WS-SECT-HD-TITLE.
068440     IF NOT END-I233P-FILE
068450       PERFORM 2900-CHECK-I233P-FILE.
068460     IF WS-556-ENTRY-COUNT NOT EQUAL +0
068470       PERFORM 3000-CHECK-556-TABLE.
068480     IF IX-WS-C285-TBL-EMPTY GREATER +1
068490       PERFORM 3050-CHECK-C285-TABLE.
068500     IF NOT END-I262P-FILE
068510       PERFORM 3100-CHECK-I262P-FILE.
068520     IF WS-C769-ENTRY-COUNT NOT EQUAL +0
068530       PERFORM 3200-CHECK-C769-TABLE.
068540     IF NOT END-I663P-FILE
068550       PERFORM 3300-CHECK-I663P-FILE.
068560     IF NOT END-I660P-FILE
068570       PERFORM 3400-CHECK-I660P-FILE.
068580     IF NOT END-I1961P-FILE
068590       PERFORM 5830-CHECK-I1961P-FILE.
068600     IF NOT END-I1122P-FILE
068610       PERFORM 3600-CHECK-I1122P-FILE.
068620     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
068630       PERFORM 0400-HEAD-EMPTY-SECTION.
068640*
068650     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068660     MOVE '******  NACHA  *******' TO WS-SECT-HD-TITLE.
068670     IF NOT EMPTY-I8950-FILE
068680       PERFORM 3900-CHECK-I8950-FILE.
068690     IF (WS-575-ENTRY-COUNT NOT EQUAL +0)
068700         AND (IX-WS-NACHA-CODE-EMPTY GREATER +1)
068710       PERFORM 3800-CHECK-575-TABLE.
068720     IF NOT END-I751P-FILE
068730       PERFORM 4100-CHECK-I751P-FILE.
068740     IF NOT END-I871-FILE
068750       PERFORM 4200-CHECK-I871-FILE.
068760     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
068770       PERFORM 0400-HEAD-EMPTY-SECTION.
068780*
068790     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068800     MOVE '**  CUSTOM REPORTS  **' TO WS-SECT-HD-TITLE.
068810     IF WS-C1712-ENTRY-COUNT NOT EQUAL +0
068820       PERFORM 4730-CHECK-C1712-TABLE.
068830     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
068840       PERFORM 0400-HEAD-EMPTY-SECTION.
068850*
068860     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068870     MOVE '** STANDARD REPORTS **' TO WS-SECT-HD-TITLE.
068880     IF WS-C781-ENTRY-COUNT NOT EQUAL +0
068890       PERFORM 4700-CHECK-C781-TABLE.
068900     IF WS-C782-ENTRY-COUNT NOT EQUAL +0
068910       PERFORM 4705-CHECK-C782-TABLE.
068920       IF (IX-WS-PROFIT-RPT-EMPTY GREATER +1)
068930             AND (WS-896-ENTRY-COUNT GREATER +0)
068940         PERFORM 4800-CHECK-896-TABLE.
068950     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
068960       PERFORM 0400-HEAD-EMPTY-SECTION.
068970*
068980     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
068990     MOVE '**  REFUNDABLE 50  ***' TO WS-SECT-HD-TITLE.
069000     IF NOT END-I589P-FILE
069010       PERFORM 5100-CHECK-I589P-FILE.
069020     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
069030       PERFORM 0400-HEAD-EMPTY-SECTION.
069040*
069050     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
069060     MOVE '**  MISCELLANEOUS  ***' TO WS-SECT-HD-TITLE.
069070     IF NOT END-I1475-FILE
069080       PERFORM 5500-CHECK-I1475-FILE.
069090     IF NOT END-I1967P-FILE
069100       PERFORM 5600-CHECK-I1967P-FILE.
069110     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
069120       PERFORM 0400-HEAD-EMPTY-SECTION.
069130*
069140     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
069150     MOVE '*****  PRICING  ******' TO WS-SECT-HD-TITLE.
069160     IF IX-WS-UPCH-KEY-EMPTY GREATER +1
069170       IF NOT EMPTY-I554-FILE
069180         PERFORM 6000-CHECK-I554-FILE
069190       END-IF
069200       IF NOT EMPTY-I554T-FILE
069210         PERFORM 6100-CHECK-I554T-FILE.
069220     MOVE 0 TO WS-662P-BC-ENT-CT.
069230     IF NOT END-I662P-FILE
069240       PERFORM 3500-CHECK-I662P-FILE.
069250     IF NOT EMPTY-I8935-FILE
069260       PERFORM 6120-CHECK-I8935-FILE.
069270     IF NOT EMPTY-I8935T-FILE
069280       PERFORM 6130-CHECK-I8935T-FILE.
069290     PERFORM 6135-CHECK-FOR-C225.
069300     IF (WS-C1921-ENTRY-BC-COUNT NOT EQUAL +0)
069310         OR (WS-C1921-ENTRY-HC-COUNT NOT EQUAL +0)
069320       PERFORM 6140-CHECK-C1921-TABLES.
069330     IF IX-WS-GAS-KEY-EMPTY GREATER +1
069340       IF IX-WS-C506-TBL-EMPTY GREATER +1
069350         PERFORM 6170-CHECK-C506-TABLE
069360       END-IF
069370       IF NOT EMPTY-I552-FILE
069380         PERFORM 6200-CHECK-I552-FILE
069390       END-IF
069400       IF NOT EMPTY-I552T-FILE
069410         PERFORM 6300-CHECK-I552T-FILE.
069420     IF NOT EMPTY-I979-FILE
069430       MOVE 'N' TO WS-I979-BC-HC-FOUND-FLAG
069440       PERFORM 6500-CHECK-I979-FILE.
069450     IF WS-C1907-ENTRY-COUNT NOT EQUAL +0
069460       PERFORM 6600-CHECK-C1907-TABLE.
069470     IF WS-C1041-TBL-ENT-CT GREATER 0
069480       PERFORM 6650-CHECK-C1041-TABLE.
069490     IF WS-C1979-ENTRY-COUNT NOT EQUAL +0
069500       PERFORM 6620-CHECK-C1979-TABLE.
069510     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
069520       PERFORM 0400-HEAD-EMPTY-SECTION.
069530*
069540     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
069550     MOVE '*****  CONSIDS  ******' TO WS-SECT-HD-TITLE.
069560     IF (WS-C850-BC-ENTRY-COUNT NOT EQUAL +0)
069570         OR (WS-C850-HC-ENTRY-COUNT NOT EQUAL +0)
069580       PERFORM 4860-CHECK-CPO-C850-TABLES.
069590     IF (WS-C761-ENTRY-COUNT NOT EQUAL +0)
069600         OR (WS-C761A-ENTRY-COUNT NOT EQUAL +0)
069610       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
069620       MOVE '761C FILE: ' TO WS-FILE-HD-FILE-NBR
069630       MOVE 'CONSID NUMBER ASSIGNMENT' TO WS-FILE-HD-FILE-NAME
069640       IF WS-C761-ENTRY-COUNT NOT EQUAL +0
069650         PERFORM 4900-CHECK-C761-TABLE
069660       END-IF
069670       IF WS-C761A-ENTRY-COUNT NOT EQUAL +0
069680         PERFORM 4950-CHECK-C761A-TABLE
069690       END-IF
069700       IF IX-WS-CONSID-NBR-EMPTY GREATER +1
069710         IF WS-877-ENTRY-COUNT GREATER +0
069720           PERFORM 5000-CHECK-877-TABLE
069730         END-IF
069740         IF WS-1130P-ENTRY-COUNT GREATER +0
069750           PERFORM 6700-CHECK-1130P-TABLE
069760         END-IF.
069770     IF WS-8920-ENTRY-COUNT GREATER +0
069780       PERFORM 6750-CHECK-8920-TABLE
069790     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
069800       PERFORM 0400-HEAD-EMPTY-SECTION.
069810*
069820     MOVE 'Y' TO WS-SECTION-HEAD-FLAG.
069830     MOVE WS-SECTION-HEADING-CI TO WS-SECTION-HEADING.
069840     IF NOT END-I149P-FILE
069850       PERFORM 7000-CHECK-I149P-FILE.
069860     IF NOT END-I120P-FILE
069870       PERFORM 7100-CHECK-I120P-FILE.
069880     IF NOT WS-I442-END-OF-FILE
069890       PERFORM 6800-CHECK-I442-FILE.
069900     IF NOT END-I906SEQ-FILE
069910       PERFORM 6850-CHECK-I906SEQ-FILE.
069920     IF NOT WS-I1840-END-OF-FILE
069930       PERFORM 6900-CHECK-I1840-FILE.
069940     IF HEAD-EMPTY-SECTIONS AND PRINT-SECTION-HEAD
069950       PERFORM 0400-HEAD-EMPTY-SECTION.
069960     MOVE WS-SECTION-HEADING-STD TO WS-SECTION-HEADING.
069970*
069980     PERFORM 7900-CONCLUDE-BC.
069990*
070000   1100-BEGIN-BC.
070010     IF PRINT-DUPLEX AND ODD-NUMBERED-PAGE
070020       MOVE SPACE TO PRINTER1-RECORD
070030       PERFORM 0800-WRITE-PRINTER1-TOP.
070040     MOVE +0 TO WS-PAGE-NBR.
070050     MOVE +90 TO WS-LINE-COUNT.
070060*
070070     MOVE WS-IPARM-BC TO WS-HD1-BC.
070080     IF WS-IPARM-PRI-BR EQUAL SPACE
070090       MOVE ALL '_' TO WS-HD1-PRI-BR
070100     ELSE
070110       MOVE WS-IPARM-PRI-BR TO WS-HD1-PRI-BR
070120*                * I550 FILE START/READ TO VALIDATE IPARM CARD
070130*                 HAD BEEN FOR A SPECIFIC BRANCH, REPOSITION TO
070140*                 FIRST RECORD FOR THE BC *
070150       MOVE SPACE TO I550-PRIMARY-BRANCH I550-SECONDARY-BRANCH
070160             I550-BILLING-TYPE
070170       PERFORM 1510-START-READ-I550-FILE.
070180*
070190     IF WS-I550-SUCCESSFUL
070200         AND (I550-BC EQUAL WS-IPARM-BC)
070210       MOVE I550-HOLDING-COMPANY TO WS-HOLDING-COMPANY
070220       MOVE I550-FI-MASTER-BC TO WS-FI-MASTER-BC
070230     ELSE
070240       MOVE LOW-VALUES TO WS-NON-TABLE-BC-INFO.
070250*
070260     MOVE +0 TO WS-MAIL-CODE-COUNT.
070270     MOVE WS-IPARM-BC TO WS-TBL-INV-BC (1).
070280     SET IX-WS-INV-BC-EMPTY TO +2.
070290     SET IX-WS-GAS-KEY-EMPTY IX-WS-UPCH-KEY-EMPTY
070300           IX-WS-PROFIT-RPT-EMPTY IX-WS-CONSID-NBR-EMPTY
070310           IX-WS-NACHA-CODE-EMPTY IX-WS-MAIL-CD-EMPTY TO +1.
070320*
070330   1200-CHECK-IMAIL-FILE.
070340     PERFORM 1210-READ-IMAIL-FILE
070350       WITH TEST BEFORE
070360       UNTIL END-IMAIL-FILE
070370             OR (IMAIL-BC NOT LESS WS-IPARM-BC).
070380     IF (NOT END-IMAIL-FILE)
070390         AND (IMAIL-BC EQUAL WS-IPARM-BC)
070400       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
070410       MOVE 'MAIL FILE: ' TO WS-FILE-HD-FILE-NBR
070420       MOVE 'SPECIAL MESSAGES PARM' TO WS-FILE-HD-FILE-NAME
070430       PERFORM 1220-REPORT-IMAIL-RECORD
070440         WITH TEST AFTER
070450         UNTIL END-IMAIL-FILE
070460               OR (IMAIL-BC GREATER WS-IPARM-BC).
070470*
070480   1210-READ-IMAIL-FILE.
070490     READ IMAIL-FILE
070500       AT END
070510         MOVE 'E' TO WS-IMAIL-FILE-FLAG
070520       NOT AT END
070530         IF IMAIL-BC NOT LESS WS-IMAIL-BC
070540           MOVE IMAIL-BC TO WS-IMAIL-BC
070550         ELSE
070560           DISPLAY '* IMAIL SEQUENCE ERROR "' WS-IMAIL-BC '" "'
070570                 IMAIL-BC '" *' UPON SYSOUT
070580           GO TO 9900-DISPLAY-ABORT
070590         END-IF
070600       END-READ.
070610*
070620   1220-REPORT-IMAIL-RECORD.
070630     IF PRINT-COLUMN-HEAD
070640       MOVE +3 TO WS-LINES-NEEDED
070650     ELSE
070660       MOVE +1 TO WS-LINES-NEEDED.
070670     PERFORM 0500-CHECK-FOR-HEADINGS.
070680     IF PRINT-COLUMN-HEAD
070690       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
070700       MOVE WS-MAIL-D1 TO PRINTER1-RECORD
070710       PERFORM 0600-WRITE-PRINTER1-RECORD.
070720     MOVE IMAIL-RECORD TO WS-MAIL-P1-RECORD.
070730     MOVE WS-MAIL-P1 TO PRINTER1-RECORD.
070740     PERFORM 0600-WRITE-PRINTER1-RECORD.
070750     PERFORM 1210-READ-IMAIL-FILE.
070760*
070770   1500-PROCESS-I550-FILE.
070780     SET IX-WS-550-TBL-IN TO +1.
070790     PERFORM
070800         WITH TEST AFTER
070810         UNTIL WS-I550-END-OF-FILE
070820               OR (I550-BC GREATER WS-IPARM-BC)
070830       MOVE I550-REC TO W550-REC
070840       PERFORM 1530-ONE-W550-REC
070850       PERFORM 1520-READ-I550-FILE-NEXT
070860     END-PERFORM.
070870     MOVE '550 FILE:  ' TO WS-FILE-HD-FILE-NBR.
070880     MOVE 'BILLING MASTER FILE' TO WS-FILE-HD-FILE-NAME.
070890     PERFORM 1550-REPORT-550-TABLE.
070900*
070910   1510-START-READ-I550-FILE.
070920     START I550-FILE KEY NOT LESS I550-RECORD-KEY.
070930     IF WS-I550-SUCCESSFUL
070940       PERFORM 1520-READ-I550-FILE-NEXT
070950     ELSE
070960       IF (NOT WS-I550-END-OF-FILE)
070970           AND (NOT WS-I550-NO-SUCH-RECORD)
070980         DISPLAY '* VSAM ERROR ON I550 START. KEY NOT LESS "'
070990               I550-RECORD-KEY '". FILE STATUS = '
071000               WS-I550-FILE-STATUS '. *' UPON SYSOUT
071010         GO TO 9900-DISPLAY-ABORT.
071020*
071030   1520-READ-I550-FILE-NEXT.
071040     READ I550-FILE NEXT RECORD.
071050     IF (NOT WS-I550-SUCCESSFUL)
071060         AND (NOT WS-I550-END-OF-FILE)
071070       DISPLAY '* VSAM ERROR ON I550 READ NEXT. FILE STATUS = '
071080             WS-I550-FILE-STATUS '. *' UPON SYSOUT
071090       GO TO 9900-DISPLAY-ABORT.
071100*
071110   1530-ONE-W550-REC.
071120     IF WS-IPARM-PRI-BR EQUAL SPACE OR W550-PRIMARY-BRANCH
071130       IF IX-WS-550-TBL-IN NOT GREATER +25000
071140         MOVE W550-REC TO WS-550-TBL-ENTRY (IX-WS-550-TBL-IN)
071150         SET IX-WS-550-TBL-IN UP BY 1
071160       ELSE
071170         DISPLAY '* 550/550T BRANCH TABLE OVERFLOW FOR BC "'
071180               WS-IPARM-BC '" *' UPON SYSOUT
071190         GO TO 9900-DISPLAY-ABORT.
071200*
071210     IF NOT W550-NO-ALTERNATE-ADJ-REC
071220       MOVE W550-ALTERNATE-ADJ-ACCESS TO WS-KW-ACCESS-CODE
071230       MOVE 'A' TO WS-KW-KEY-REC-TYPE
071240       PERFORM 1532-EXPAND-ACCESS-CODE
071250       PERFORM 1534-STORE-GAS-KEY.
071260     IF NOT W550-NO-GUARANTEE-ADJ-REC
071270       MOVE W550-GUARANTEE-ADJ-ACCESS TO WS-KW-ACCESS-CODE
071280       MOVE 'G' TO WS-KW-KEY-REC-TYPE
071290       PERFORM 1532-EXPAND-ACCESS-CODE
071300       PERFORM 1534-STORE-GAS-KEY.
071310     IF NOT W550-NO-SPECIAL-ADJ-REC
071320       MOVE W550-SPECIAL-ADJ-ACCESS TO WS-KW-ACCESS-CODE
071330       MOVE 'S' TO WS-KW-KEY-REC-TYPE
071340       PERFORM 1532-EXPAND-ACCESS-CODE
071350       PERFORM 1534-STORE-GAS-KEY.
071360     IF NOT W550-NO-UPCHARGE-REC
071370       MOVE W550-UPCHARGE-ACCESS TO WS-KW-ACCESS-CODE
071380       MOVE 'B' TO WS-KW-KEY-REC-TYPE
071390       PERFORM 1532-EXPAND-ACCESS-CODE
071400       PERFORM 1536-STORE-UPCH-KEY.
071410     IF NOT W550-NO-PC-UPCHG-REC
071420       MOVE W550-PRICECARD-UPCHG-ACCESS TO WS-KW-ACCESS-CODE
071430       MOVE 'P' TO WS-KW-KEY-REC-TYPE
071440       PERFORM 1532-EXPAND-ACCESS-CODE
071450       PERFORM 1536-STORE-UPCH-KEY.
071460*
071470   1532-EXPAND-ACCESS-CODE.
071480     MOVE SPACE TO WS-KW-KEY-REST.
071490*
071500     IF WS-KW-ACCESS-1 GREATER '0'
071510       IF WS-KW-ACCESS-1 GREATER '2'
071520         IF WS-KW-ACCESS-1 GREATER '3'
071530           MOVE W550-REPORT-GROUPING (1:11) TO WS-KW-KEY-HC-GROUP
071540         ELSE
071550           MOVE W550-REPORT-GROUPING (1:9) TO
071560                 WS-KW-KEY-HC-GROUP (1:9)
071570       ELSE
071580         IF WS-KW-ACCESS-1 GREATER '1'
071590           MOVE W550-REPORT-GROUPING (1:7) TO
071600                 WS-KW-KEY-HC-GROUP (1:7)
071610         ELSE
071620           MOVE W550-HOLDING-COMPANY TO WS-KW-KEY-HC-GROUP (1:5).
071630*
071640     IF WS-KW-ACCESS-2 GREATER '0'
071650       IF WS-KW-ACCESS-2 GREATER '2'
071660         IF WS-KW-ACCESS-2 GREATER '3'
071670           MOVE W550-REPORT-GROUPING (12:14) TO
071680                 WS-KW-KEY-MBC-GROUP
071690         ELSE
071700           MOVE W550-REPORT-GROUPING (12:12) TO
071710                 WS-KW-KEY-MBC-GROUP (1:12)
071720       ELSE
071730         IF WS-KW-ACCESS-2 GREATER '1'
071740           MOVE W550-REPORT-GROUPING (12:10) TO
071750                 WS-KW-KEY-MBC-GROUP (1:10)
071760         ELSE
071770           MOVE W550-FI-MASTER-BC TO WS-KW-KEY-MBC-GROUP (1:8).
071780*
071790     IF WS-KW-ACCESS-3 GREATER '1'
071800       IF WS-KW-ACCESS-3 GREATER '2'
071810         MOVE W550-RECORD-KEY (1:18) TO WS-KW-KEY-BC-BR-BR
071820       ELSE
071830         MOVE W550-RECORD-KEY (1:13) TO WS-KW-KEY-BC-BR-BR (1:13)
071840     ELSE
071850       IF WS-KW-ACCESS-3 GREATER '0'
071860         MOVE W550-BC TO WS-KW-KEY-BC-BR-BR (1:8).
071870*
071880     IF WS-KW-ACCESS-4 GREATER '0'
071890       MOVE W550-BILLING-TYPE TO WS-KW-KEY-BILL-TYPE.
071900*
071910   1534-STORE-GAS-KEY.
071920     SET IX-WS-GAS-KEY-CURR TO +1.
071930     PERFORM
071940         WITH TEST BEFORE
071950         UNTIL (IX-WS-GAS-KEY-CURR NOT LESS IX-WS-GAS-KEY-EMPTY)
071960             OR (WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR) NOT LESS
071970                   WS-KW-KEY)
071980       SET IX-WS-GAS-KEY-CURR UP BY 1
071990     END-PERFORM.
072000     IF (IX-WS-GAS-KEY-CURR NOT LESS IX-WS-GAS-KEY-EMPTY)
072010         OR (WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR) NOT EQUAL
072020               WS-KW-KEY)
072030*                * KEY NOT YET IN TABLE *
072040       IF IX-WS-GAS-KEY-EMPTY NOT GREATER +200
072050*                * TABLE HAS ROOM FOR NEW KEY *
072060         IF IX-WS-GAS-KEY-CURR LESS IX-WS-GAS-KEY-EMPTY
072070*                * NEW KEY BELONGS OTHER THAN AT THE END, NEED
072080*                 TO SHIFT EXISTING KEYS TO MAKE ROOM FOR IT *
072090           SET IX-WS-GAS-KEY-FROM TO IX-WS-GAS-KEY-EMPTY
072100           PERFORM
072110               WITH TEST AFTER
072120               UNTIL IX-WS-GAS-KEY-FROM NOT GREATER
072130                     IX-WS-GAS-KEY-CURR
072140             SET IX-WS-GAS-KEY-TO TO IX-WS-GAS-KEY-FROM
072150             SET IX-WS-GAS-KEY-FROM DOWN BY 1
072160             MOVE WS-TBL-GAS-KEY (IX-WS-GAS-KEY-FROM) TO
072170                   WS-TBL-GAS-KEY (IX-WS-GAS-KEY-TO)
072180           END-PERFORM
072190         END-IF
072200         MOVE WS-KW-KEY TO WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR)
072210         SET IX-WS-GAS-KEY-EMPTY UP BY 1
072220       ELSE
072230         DISPLAY '* G.A.S. KEY TABLE OVERFLOWED FOR BC "'
072240               WS-IPARM-BC '" *' UPON SYSOUT
072250         GO TO 9900-DISPLAY-ABORT.
072260*
072270   1536-STORE-UPCH-KEY.
072280     SET IX-WS-UPCH-KEY-CURR TO +1.
072290     PERFORM
072300         WITH TEST BEFORE
072310         UNTIL (IX-WS-UPCH-KEY-CURR NOT LESS
072320               IX-WS-UPCH-KEY-EMPTY)
072330             OR (WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-CURR) NOT LESS
072340                   WS-KW-KEY)
072350       SET IX-WS-UPCH-KEY-CURR UP BY 1
072360     END-PERFORM.
072370     IF (IX-WS-UPCH-KEY-CURR NOT LESS IX-WS-UPCH-KEY-EMPTY)
072380         OR (WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-CURR) NOT EQUAL
072390               WS-KW-KEY)
072400*                * KEY NOT YET IN TABLE *
072410       IF IX-WS-UPCH-KEY-EMPTY NOT GREATER +200
072420*                * TABLE HAS ROOM FOR NEW KEY *
072430         IF IX-WS-UPCH-KEY-CURR LESS IX-WS-UPCH-KEY-EMPTY
072440*                * NEW KEY BELONGS OTHER THAN AT THE END, NEED
072450*                 TO SHIFT EXISTING KEYS TO MAKE ROOM FOR IT *
072460           SET IX-WS-UPCH-KEY-FROM TO IX-WS-UPCH-KEY-EMPTY
072470           PERFORM
072480               WITH TEST AFTER
072490               UNTIL IX-WS-UPCH-KEY-FROM NOT GREATER
072500                     IX-WS-UPCH-KEY-CURR
072510             SET IX-WS-UPCH-KEY-TO TO IX-WS-UPCH-KEY-FROM
072520             SET IX-WS-UPCH-KEY-FROM DOWN BY 1
072530             MOVE WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-FROM) TO
072540                   WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-TO)
072550           END-PERFORM
072560         END-IF
072570         MOVE WS-KW-KEY TO WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-CURR)
072580         SET IX-WS-UPCH-KEY-EMPTY UP BY 1
072590       ELSE
072600         DISPLAY '* UPCHARGE KEY TABLE OVERFLOWED FOR BC "'
072610               WS-IPARM-BC '" *' UPON SYSOUT
072620         GO TO 9900-DISPLAY-ABORT.
072630*
072640   1538-STORE-NACHA-CODE.
072650     SET IX-WS-NACHA-CODE-CURR TO +1.
072660     PERFORM
072670         WITH TEST BEFORE
072680         UNTIL (IX-WS-NACHA-CODE-CURR NOT LESS
072690               IX-WS-NACHA-CODE-EMPTY)
072700             OR (WS-TBL-NACHA-CODE (IX-WS-NACHA-CODE-CURR)
072710                   NOT LESS WS-NACHA-CODE)
072720       SET IX-WS-NACHA-CODE-CURR UP BY 1
072730     END-PERFORM.
072740     IF (IX-WS-NACHA-CODE-CURR NOT LESS IX-WS-NACHA-CODE-EMPTY)
072750         OR (WS-TBL-NACHA-CODE (IX-WS-NACHA-CODE-CURR) NOT EQUAL
072760               WS-NACHA-CODE)
072770*                * NACHA CODE NOT YET IN TABLE *
072780       IF IX-WS-NACHA-CODE-EMPTY NOT GREATER +6000
072790*                * TABLE HAS ROOM FOR NEW NACHA CODE *
072800         IF IX-WS-NACHA-CODE-CURR LESS IX-WS-NACHA-CODE-EMPTY
072810*                * NEW NACHA CODE BELONGS OTHER THAN AT THE END,
072820*                 SHIFT EXISTING ENTRIES TO MAKE ROOM FOR IT *
072830           SET IX-WS-NACHA-CODE-FROM TO IX-WS-NACHA-CODE-EMPTY
072840           PERFORM
072850               WITH TEST AFTER
072860               UNTIL IX-WS-NACHA-CODE-FROM NOT GREATER
072870                     IX-WS-NACHA-CODE-CURR
072880             SET IX-WS-NACHA-CODE-TO TO IX-WS-NACHA-CODE-FROM
072890             SET IX-WS-NACHA-CODE-FROM DOWN BY 1
072900             MOVE WS-TBL-NACHA-CODE (IX-WS-NACHA-CODE-FROM) TO
072910                   WS-TBL-NACHA-CODE (IX-WS-NACHA-CODE-TO)
072920           END-PERFORM
072930         END-IF
072940         MOVE WS-NACHA-CODE TO
072950               WS-TBL-NACHA-CODE (IX-WS-NACHA-CODE-CURR)
072960         SET IX-WS-NACHA-CODE-EMPTY UP BY 1
072970       ELSE
072980         DISPLAY '* NACHA CODE TABLE OVERFLOWED FOR BC "'
072990               WS-IPARM-BC '" *' UPON SYSOUT
073000         GO TO 9900-DISPLAY-ABORT.
073010*
073020   1550-REPORT-550-TABLE.
073030     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
073040     SET IX-WS-550-TBL-OUT TO +1.
073050     PERFORM 1560-REPORT-550-LINE-1
073060           WITH TEST AFTER
073070           UNTIL IX-WS-550-TBL-OUT NOT LESS IX-WS-550-TBL-IN.
073080     MOVE 'Y' TO WS-COLUMN-HEAD-FLAG.
073090     SET IX-WS-550-TBL-OUT TO +1.
073100     PERFORM 1570-REPORT-550-LINE-2
073110           WITH TEST AFTER
073120           UNTIL IX-WS-550-TBL-OUT NOT LESS IX-WS-550-TBL-IN.
073130     MOVE 'Y' TO WS-COLUMN-HEAD-FLAG.
073140     SET IX-WS-550-TBL-OUT TO +1.
073150     PERFORM 1580-REPORT-550-LINE-3
073160           WITH TEST AFTER
073170           UNTIL IX-WS-550-TBL-OUT NOT LESS IX-WS-550-TBL-IN.
073180     IF IX-WS-550-TBL-IN GREATER +20001
073190       MOVE 'Y' TO WS-RETURN-07-FLAG
073200       DISPLAY '550/550T BRANCH TABLE OVER 80% FULL FOR BC "'
073210               WS-IPARM-BC '".' UPON SYSOUT.
073220*
073230   1560-REPORT-550-LINE-1.
073240     MOVE WS-550-TBL-ENTRY (IX-WS-550-TBL-OUT) TO W550-REC.
073250     SET IX-WS-550-TBL-OUT UP BY 1.
073260     IF PRINT-COLUMN-HEAD
073270       MOVE +4 TO WS-LINES-NEEDED
073280     ELSE
073290       MOVE +1 TO WS-LINES-NEEDED.
073300     PERFORM 0500-CHECK-FOR-HEADINGS.
073310     IF PRINT-COLUMN-HEAD
073320       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
073330       MOVE WS-550-C1A TO PRINTER1-RECORD
073340       PERFORM 0600-WRITE-PRINTER1-RECORD
073350       MOVE WS-550-C1B TO PRINTER1-RECORD
073360       PERFORM 0600-WRITE-PRINTER1-RECORD
073370       MOVE WS-550-D1 TO PRINTER1-RECORD
073380       PERFORM 0600-WRITE-PRINTER1-RECORD.
073390     MOVE W550-BC TO WS-550-P1-BC.
073400     MOVE W550-PRIMARY-BRANCH TO WS-550-P1-BRANCH.
073410     MOVE W550-DATE-OF-LAST-UPDATE TO WS-550-P1-LAST-UPDATE.
073420     MOVE W550-HOLDING-COMPANY TO WS-550-P1-HOLDING-CO.
073430     MOVE W550-HOLD-CO-LEVEL-1-DIV TO WS-550-P1-HC-L1-DIV.
073440     MOVE W550-HOLD-CO-LEVEL-2-DIV TO WS-550-P1-HC-L2-DIV.
073450     MOVE W550-HOLD-CO-LEVEL-3-DIV TO WS-550-P1-HC-L3-DIV.
073460     MOVE W550-FI-MASTER-BC TO WS-550-P1-FI-MASTER-BC.
073470     MOVE W550-FI-LEVEL-1-DIV TO WS-550-P1-FI-L1-DIV.
073480     MOVE W550-FI-LEVEL-2-DIV TO WS-550-P1-FI-L2-DIV.
073490     MOVE W550-FI-LEVEL-3-DIV TO WS-550-P1-FI-L3-DIV.
073500     MOVE W550-NORMAL-PRICE-DESIGNATION TO WS-550-P1-PRICE-DESIG.
073510     MOVE W550-GUARANTEE-ADJ-ACCESS TO WS-550-P1-GUAR-ADJ-ACC.
073520     MOVE W550-ALTERNATE-ADJ-ACCESS TO WS-550-P1-ALT-ADJ-ACC.
073530     MOVE W550-SPECIAL-ADJ-ACCESS TO WS-550-P1-SPL-ADJ-ACC.
073540     MOVE W550-UPCHARGE-ACCESS TO WS-550-P1-UPCHARGE-ACC.
073550     MOVE W550-DEPOSIT-STATUS-X TO WS-550-P1-DEP-STATUS.
073560     MOVE W550-TYPE-OF-INSTITUTION TO WS-550-P1-TYPE-INST.
073570     MOVE W550-TYPE-OF-OFFICE TO WS-550-P1-TYPE-OFFICE.
073580     MOVE W550-TAX-JURISDICTION TO WS-550-P1-TAX-JURIS.
073590     MOVE W550-EXPENSE-TAX-FLAG TO WS-550-P1-EXP-TAX-FLAG.
073600     MOVE W550-RESALE-TAX-FLAG TO WS-550-P1-RSL-TAX-FLAG.
073610     MOVE W550-UPCHARGE-REBATE-FLAG TO WS-550-P1-UPCH-REBT-FLAG.
073620     MOVE W550-A-R-BC TO WS-550-P1-A-R-BC.
073630     MOVE W550-A-R-PRI-BRANCH TO WS-550-P1-A-R-PRI-BR.
073640     MOVE W550-A-R-BILL-TYPE TO WS-550-P1-A-R-TYP.
073650     MOVE W550-SALES-BANK-NUMBER TO WS-550-P1-SALES-BANK-NBR.
073660     MOVE W550-SALESREP-NUMBER TO WS-550-P1-SLSREP-NBR.
073670     MOVE WS-550-P1 TO PRINTER1-RECORD.
073680     PERFORM 0600-WRITE-PRINTER1-RECORD.
073690*
073700   1570-REPORT-550-LINE-2.
073710     MOVE WS-550-TBL-ENTRY (IX-WS-550-TBL-OUT) TO W550-REC.
073720     SET IX-WS-550-TBL-OUT UP BY 1.
073730     IF PRINT-COLUMN-HEAD
073740       MOVE +4 TO WS-LINES-NEEDED
073750     ELSE
073760       MOVE +1 TO WS-LINES-NEEDED.
073770     PERFORM 0500-CHECK-FOR-HEADINGS.
073780     IF PRINT-COLUMN-HEAD
073790       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
073800       MOVE WS-550-C2 TO PRINTER1-RECORD
073810       IF WS-LINE-COUNT GREATER +3
073820         MOVE +2 TO WS-LINE-SPACER
073830       END-IF
073840       PERFORM 0600-WRITE-PRINTER1-RECORD
073850       MOVE +1 TO WS-LINE-SPACER
073860       MOVE WS-550-D2 TO PRINTER1-RECORD
073870       PERFORM 0600-WRITE-PRINTER1-RECORD.
073880     MOVE W550-BC TO WS-550-P2-BC.
073890     MOVE W550-PRIMARY-BRANCH TO WS-550-P2-BRANCH.
073900     MOVE W550-FI-NAME TO WS-550-P2-FI-NAME.
073910     MOVE W550-BRANCH-NAME TO WS-550-P2-BRANCH-NAME.
073920     MOVE W550-ADDRESS-LINE-1 TO WS-550-P2-ADDR-LINE-1.
073930     MOVE WS-550-P2 TO PRINTER1-RECORD.
073940     PERFORM 0600-WRITE-PRINTER1-RECORD.
073950*
073960   1580-REPORT-550-LINE-3.
073970     MOVE WS-550-TBL-ENTRY (IX-WS-550-TBL-OUT) TO W550-REC.
073980     SET IX-WS-550-TBL-OUT UP BY 1.
073990     IF PRINT-COLUMN-HEAD
074000       MOVE +4 TO WS-LINES-NEEDED
074010     ELSE
074020       MOVE +1 TO WS-LINES-NEEDED.
074030     PERFORM 0500-CHECK-FOR-HEADINGS.
074040     IF PRINT-COLUMN-HEAD
074050       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
074060       MOVE WS-550-C3 TO PRINTER1-RECORD
074070       IF WS-LINE-COUNT GREATER +3
074080         MOVE +2 TO WS-LINE-SPACER
074090       END-IF
074100       PERFORM 0600-WRITE-PRINTER1-RECORD
074110       MOVE +1 TO WS-LINE-SPACER
074120       MOVE WS-550-D3 TO PRINTER1-RECORD
074130       PERFORM 0600-WRITE-PRINTER1-RECORD.
074140     MOVE W550-BC TO WS-550-P3-BC.
074150     MOVE W550-PRIMARY-BRANCH TO WS-550-P3-BRANCH.
074160     MOVE W550-ADDRESS-LINE-2 TO WS-550-P3-ADDR-LINE-2.
074170     MOVE W550-ADDRESS-LINE-3 TO WS-550-P3-ADDR-LINE-3.
074180     MOVE W550-ADDRESS-CITY TO WS-550-P3-ADDRESS-CITY.
074190     MOVE W550-ADDRESS-STATE TO WS-550-P3-ADDRESS-STATE.
074200     MOVE W550-5-DIGIT-ZIP-CODE TO WS-550-P3-5-DIG-ZIP-CD.
074210     MOVE W550-ZIP-PLUS-4 TO WS-550-P3-ZIP-PLUS-4.
074220     MOVE WS-550-P3 TO PRINTER1-RECORD.
074230     PERFORM 0600-WRITE-PRINTER1-RECORD.
074240*
074250*
074260   1600-CHECK-I550T-FILE.
074270     MOVE WS-IPARM-BC TO O550-BC.
074280     MOVE SPACE TO O550-PRIMARY-BRANCH O550-SECONDARY-BRANCH
074290           O550-BILLING-TYPE.
074300     PERFORM 1610-START-READ-I550T-FILE.
074310     IF WS-I550T-SUCCESSFUL
074320         AND (O550-BC EQUAL WS-IPARM-BC)
074330       SET IX-WS-550-TBL-IN TO +1
074340       PERFORM
074350           WITH TEST AFTER
074360           UNTIL WS-I550T-END-OF-FILE
074370                 OR (O550-BC GREATER WS-IPARM-BC)
074380         MOVE O550-REC TO W550-REC
074390         PERFORM 1530-ONE-W550-REC
074400         PERFORM 1620-READ-I550T-FILE-NEXT
074410       END-PERFORM
074420       IF IX-WS-550-TBL-IN GREATER +1
074430         MOVE '550T FILE: ' TO WS-FILE-HD-FILE-NBR
074440         MOVE 'BILLING MASTER FILE (TEST)' TO WS-FILE-HD-FILE-NAME
074450         PERFORM 1550-REPORT-550-TABLE.
074460*
074470   1610-START-READ-I550T-FILE.
074480     START I550T-FILE KEY NOT LESS O550-RECORD-KEY.
074490     IF WS-I550T-SUCCESSFUL
074500       PERFORM 1620-READ-I550T-FILE-NEXT
074510     ELSE
074520       IF (NOT WS-I550T-END-OF-FILE)
074530           AND (NOT WS-I550T-NO-SUCH-RECORD)
074540         DISPLAY '* VSAM ERROR ON I550T START. KEY NOT LESS "'
074550               O550-RECORD-KEY '". FILE STATUS = '
074560               WS-I550T-FILE-STATUS '. *' UPON SYSOUT
074570         GO TO 9900-DISPLAY-ABORT.
074580*
074590   1620-READ-I550T-FILE-NEXT.
074600     READ I550T-FILE NEXT RECORD.
074610     IF (NOT WS-I550T-SUCCESSFUL)
074620         AND (NOT WS-I550T-END-OF-FILE)
074630       DISPLAY '* VSAM ERROR ON I550T READ NEXT. FILE STATUS = '
074640             WS-I550T-FILE-STATUS '. *' UPON SYSOUT
074650       GO TO 9900-DISPLAY-ABORT.
074660*
074670*
074680   1905-CHECK-I864-FILE.
074690     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
074700     MOVE '864 FILE:  ' TO WS-FILE-HD-FILE-NBR.
074710     MOVE 'DEALS CONTROL FILE      ' TO WS-FILE-HD-FILE-NAME.
074720     MOVE LOW-VALUES TO I864-ALTERNATE-KEY
074730     MOVE WS-IPARM-BC TO I864-BC.
074740     PERFORM 1906-START-READ-I864-FILE.
074750     PERFORM
074760         WITH TEST BEFORE
074770         UNTIL (NOT WS-I864-SUCCESSFUL)
074780             OR (I864-BC NOT EQUAL WS-IPARM-BC)
074790       PERFORM 1912-BUILD-VARIABLE-FIELDS
074800       PERFORM 1908-READ-I864-FILE-NEXT
074810     END-PERFORM.
074820*
074830   1906-START-READ-I864-FILE.
074840     START I864-FILE  KEY NOT LESS I864-ALTERNATE-KEY.
074850     IF WS-I864-SUCCESSFUL
074860       PERFORM 1908-READ-I864-FILE-NEXT
074870     ELSE
074880       IF (NOT WS-I864-END-OF-FILE)
074890           AND (NOT WS-I864-NO-SUCH-RECORD)
074900         DISPLAY '* VSAM ERROR ON I864 START. KEY NOT LESS "'
074910               I864-KEY '"' UPON SYSOUT
074920         DISPLAY '   FILE STATUS = ' WS-I864-FILE-STATUS '. *'
074930               UPON SYSOUT
074940         GO TO 9900-DISPLAY-ABORT.
074950*
074960   1908-READ-I864-FILE-NEXT.
074970     READ I864-FILE NEXT RECORD
074980     IF (NOT WS-I864-SUCCESSFUL)
074990         AND (NOT WS-I864-END-OF-FILE)
075000       DISPLAY '* VSAM ERROR ON I864 READ NEXT. FILE STATUS = '
075010             WS-I864-FILE-STATUS '. *' UPON SYSOUT
075020       GO TO 9900-DISPLAY-ABORT.
075030*
075040   1911-REPORT-I864-RECORD.
075050     IF PRINT-COLUMN-HEAD
075060       MOVE +3 TO WS-LINES-NEEDED
075070     ELSE
075080       MOVE +1 TO WS-LINES-NEEDED.
075090     PERFORM 0500-CHECK-FOR-HEADINGS.
075100     IF PRINT-COLUMN-HEAD
075110       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
075120       MOVE WS-864-C1 TO PRINTER1-RECORD
075130       PERFORM 0600-WRITE-PRINTER1-RECORD
075140       MOVE WS-864-D1 TO PRINTER1-RECORD
075150       PERFORM 0600-WRITE-PRINTER1-RECORD.
075160     IF ((PRINT-COLUMN-HEAD) OR (IX-BILL-TO = 1))
075170       MOVE I864-BC TO WS-864-P1-BC
075180       MOVE I864-DEAL-NUMBER    TO WS-864-DEAL-NBR
075190       MOVE I864-BILL-FLAG      TO WS-864-BILL-FLAG
075200       MOVE WS-BILL-OC(IX-BILL-TO)         TO WS-864-BILL-OC
075210       MOVE WS-BILL-NEW-EXP-CODE(IX-BILL-TO)
075220                                        TO WS-864-BILL-NEW-EXP
075230       MOVE WS-BILL-REORDER-EXP-CODE(IX-BILL-TO) TO
075240                                   WS-864-BILL-R-EXP
075250       MOVE WS-864-P1 TO PRINTER1-RECORD
075260       PERFORM 0600-WRITE-PRINTER1-RECORD
075270     ELSE
075280       MOVE WS-BILL-OC(IX-BILL-TO)         TO WS-864-BILL-OC
075290       MOVE WS-BILL-NEW-EXP-CODE(IX-BILL-TO)
075300                                        TO WS-864-BILL-NEW-EXP
075310       MOVE WS-BILL-REORDER-EXP-CODE(IX-BILL-TO) TO
075320                                   WS-864-BILL-R-EXP
075330       IF ((WS-864-BILL-OC NOT EQUAL SPACES) OR
075340          (WS-864-BILL-NEW-EXP NOT EQUAL SPACES) OR
075350          (WS-864-BILL-R-EXP NOT EQUAL SPACES))
075360         MOVE WS-864-P1 TO PRINTER1-RECORD
075370         PERFORM 0600-WRITE-PRINTER1-RECORD.
075380     SET IX-BILL-TO UP BY 1.
075390*
075400   1912-BUILD-VARIABLE-FIELDS.
075410     MOVE 'E' TO WS-FUNCTION-FLAG.
075420     MOVE I864-TOTAL-LENGTH TO WS-W864-TOTAL-LENGTH.
075430     MOVE I864-VARIABLE-FIELD TO WS-W864-VARIABLE-INFO.
075440     CALL WS-MIS104 USING CPY99-REC
075450                          WS-MIS104-FLAGS
075460                          WS-W864-TOTAL-LENGTH
075470                          WS-W864-VARIABLE-INFO.
075480     MOVE CPY99-BILL-TO-INFO TO WS-BILL-TO-INFO.
075490     SET IX-BILL-TO TO 1
075500     PERFORM
075510           WITH TEST AFTER
075520           UNTIL ((IX-BILL-TO > 10) OR
075530                ((WS-BILL-OC(IX-BILL-TO) EQUAL SPACE) AND
075540                (WS-BILL-NEW-EXP-CODE(IX-BILL-TO) EQUAL SPACE)
075550                AND
075560                (WS-BILL-REORDER-EXP-CODE(IX-BILL-TO)
075570                      EQUAL SPACE)))
075580           PERFORM 1911-REPORT-I864-RECORD
075590     END-PERFORM.
075600*
075610*
075620   2000-CHECK-I561-FILE.
075630     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
075640     MOVE '561 FILE:  ' TO WS-FILE-HD-FILE-NBR.
075650     MOVE 'MANIP FILE 1' TO WS-FILE-HD-FILE-NAME.
075660     MOVE WS-IPARM-BC TO I561-PRODUCTION-BC.
075670     MOVE LOW-VALUES TO I561-RECORD-KEY (9:4).
075680     PERFORM 2010-START-READ-I561-FILE.
075690     PERFORM
075700*                * BY PRODUCTION BC  -  DIRECT 561 LOOK-UP *
075710         WITH TEST BEFORE
075720         UNTIL (NOT WS-I561-SUCCESSFUL)
075730             OR (I561-PRODUCTION-BC NOT EQUAL WS-IPARM-BC)
075740       PERFORM 2030-REPORT-I561-RECORD
075750       PERFORM 2020-READ-I561-FILE-NEXT
075760     END-PERFORM.
075770     IF WS-561-ENTRY-COUNT NOT EQUAL +0
075780       SET IX-WS-561-TBL TO +1
075790       PERFORM
075800*                * BY BILLING BC  -  TABLE LOOK-UP *
075810           WS-561-ENTRY-COUNT TIMES
075820         IF WS-561-BILLING-BC (IX-WS-561-TBL) EQUAL WS-IPARM-BC
075830           MOVE WS-561-RECORD-KEY (IX-WS-561-TBL) TO
075840                 I561-RECORD-KEY
075850           READ I561-FILE KEY I561-RECORD-KEY
075860           IF WS-I561-SUCCESSFUL
075870             PERFORM 2030-REPORT-I561-RECORD
075880           ELSE
075890             DISPLAY '* VSAM ERROR ON I561 READ. KEY = "'
075900                   WS-561-RECORD-KEY (IX-WS-561-TBL)
075910                   '". FILE STATUS = ' WS-I561-FILE-STATUS '. *'
075920                   UPON SYSOUT
075930             GO TO 9900-DISPLAY-ABORT
075940           END-IF
075950         END-IF
075960         SET IX-WS-561-TBL UP BY 1
075970       END-PERFORM.
075980*
075990   2010-START-READ-I561-FILE.
076000     START I561-FILE KEY NOT LESS I561-RECORD-KEY.
076010     IF WS-I561-SUCCESSFUL
076020       PERFORM 2020-READ-I561-FILE-NEXT
076030     ELSE
076040       IF (NOT WS-I561-END-OF-FILE)
076050           AND (NOT WS-I561-NO-SUCH-RECORD)
076060         DISPLAY '* VSAM ERROR ON I561 START. KEY NOT LESS "'
076070               I561-RECORD-KEY '"' UPON SYSOUT
076080         DISPLAY '   FILE STATUS = ' WS-I561-FILE-STATUS '. *'
076090               UPON SYSOUT
076100         GO TO 9900-DISPLAY-ABORT.
076110*
076120   2020-READ-I561-FILE-NEXT.
076130     READ I561-FILE NEXT RECORD.
076140     IF (NOT WS-I561-SUCCESSFUL)
076150         AND (NOT WS-I561-END-OF-FILE)
076160       DISPLAY '* VSAM ERROR ON I561 READ NEXT. FILE STATUS = '
076170             WS-I561-FILE-STATUS '. *' UPON SYSOUT
076180       GO TO 9900-DISPLAY-ABORT.
076190*
076200   2030-REPORT-I561-RECORD.
076210     IF PRINT-COLUMN-HEAD
076220       MOVE +3 TO WS-LINES-NEEDED
076230     ELSE
076240       MOVE +1 TO WS-LINES-NEEDED.
076250     PERFORM 0500-CHECK-FOR-HEADINGS.
076260     IF PRINT-COLUMN-HEAD
076270       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
076280       MOVE WS-561-C1 TO PRINTER1-RECORD
076290       PERFORM 0600-WRITE-PRINTER1-RECORD
076300       MOVE WS-561-D1 TO PRINTER1-RECORD
076310       PERFORM 0600-WRITE-PRINTER1-RECORD.
076320     MOVE I561-PRODUCTION-BC TO WS-561-P1-PRD-BC.
076330     MOVE I561-SEQUENCE-NUMBER TO WS-561-P1-KEY-SEQ.
076340     MOVE I561-DATE-OF-LAST-UPDATE TO WS-561-P1-UPDATE-DATE.
076350     MOVE I561-PRODUCTION-PRI-BRANCH TO WS-561-P1-PRD-PRI-BR.
076360     MOVE I561-PRODUCTION-SEC-BRANCH TO WS-561-P1-PRD-SEC-BR.
076370     MOVE I561-ACCOUNT-FORMAT TO WS-561-P1-ACCT-FORMAT.
076380     MOVE I561-BILLING-BC TO WS-561-P1-BIL-BC.
076390     MOVE I561-BILLING-PRI-BRANCH TO WS-561-P1-BIL-PRI-BR.
076400     MOVE WS-561-P1 TO PRINTER1-RECORD.
076410     PERFORM 0600-WRITE-PRINTER1-RECORD.
076420*
076430   2100-CHECK-I562-FILE.
076440     MOVE WS-IPARM-BC TO I562-BC.
076450     MOVE ZEROS TO I562-KEY-SEQUENCE.
076460     PERFORM 2110-START-READ-I562-FILE.
076470     IF WS-I562-SUCCESSFUL
076480         AND (I562-BC EQUAL WS-IPARM-BC)
076490       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
076500       MOVE '562 FILE:  ' TO WS-FILE-HD-FILE-NBR
076510       MOVE 'MANIP FILE 2' TO WS-FILE-HD-FILE-NAME
076520       PERFORM
076530           WITH TEST AFTER
076540           UNTIL (NOT WS-I562-SUCCESSFUL)
076550               OR (I562-BC NOT EQUAL WS-IPARM-BC)
076560         PERFORM 2130-REPORT-I562-RECORD
076570         PERFORM 2120-READ-I562-FILE-NEXT
076580       END-PERFORM.
076590*
076600   2110-START-READ-I562-FILE.
076610     START I562-FILE KEY NOT LESS I562-RECORD-KEY.
076620     IF WS-I562-SUCCESSFUL
076630       PERFORM 2120-READ-I562-FILE-NEXT
076640     ELSE
076650       IF (NOT WS-I562-END-OF-FILE)
076660           AND (NOT WS-I562-NO-SUCH-RECORD)
076670         DISPLAY '* VSAM ERROR ON I562 START. KEY NOT LESS "'
076680               I562-RECORD-KEY '"' UPON SYSOUT
076690         DISPLAY '   FILE STATUS = ' WS-I562-FILE-STATUS '. *'
076700               UPON SYSOUT
076710         GO TO 9900-DISPLAY-ABORT.
076720*
076730   2120-READ-I562-FILE-NEXT.
076740     READ I562-FILE NEXT RECORD.
076750     IF (NOT WS-I562-SUCCESSFUL)
076760         AND (NOT WS-I562-END-OF-FILE)
076770       DISPLAY '* VSAM ERROR ON I562 READ NEXT. FILE STATUS = '
076780             WS-I562-FILE-STATUS '. *' UPON SYSOUT
076790       GO TO 9900-DISPLAY-ABORT.
076800*
076810   2130-REPORT-I562-RECORD.
076820     IF PRINT-COLUMN-HEAD
076830       MOVE +3 TO WS-LINES-NEEDED
076840     ELSE
076850       MOVE +1 TO WS-LINES-NEEDED.
076860     PERFORM 0500-CHECK-FOR-HEADINGS.
076870     IF PRINT-COLUMN-HEAD
076880       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
076890       MOVE WS-562-C1 TO PRINTER1-RECORD
076900       PERFORM 0600-WRITE-PRINTER1-RECORD
076910       MOVE WS-562-D1 TO PRINTER1-RECORD
076920       PERFORM 0600-WRITE-PRINTER1-RECORD.
076930     MOVE I562-BC TO WS-562-P1-BC.
076940     MOVE I562-KEY-SEQUENCE TO WS-562-P1-KEY-SEQ.
076950     MOVE I562-DATE-OF-LAST-UPDATE TO WS-562-P1-UPDATE-DATE.
076960     MOVE I562-MATCH-LOW-PRI-BRANCH TO WS-562-P1-M-LOW-PRI-BR.
076970     MOVE I562-MATCH-HIGH-PRI-BRANCH TO WS-562-P1-M-HI-PRI-BR.
076980     MOVE I562-MATCH-PRODUCT-CODE TO WS-562-P1-M-PROD-CODE.
076990     MOVE I562-MATCH-EXTRA-WORK-FLAG TO WS-562-P1-M-XW-FLAG.
077000     MOVE I562-MATCH-ACCOUNT-FORMAT TO WS-562-P1-M-ACCT-FMT.
077010     MOVE I562-MATCH-REORDER-FLAG TO WS-562-P1-M-REORD-FLG.
077020     MOVE I562-CONV-PREFERRED-FLAG TO WS-562-P1-CONV-PREF-FLG.
077030     MOVE I562-CHANGE-PRODUCT-BYTES-1-2 TO WS-562-P1-CHG-PROD-1-2.
077040     MOVE WS-562-P1 TO PRINTER1-RECORD.
077050     PERFORM 0600-WRITE-PRINTER1-RECORD.
077060*
077070   2200-CHECK-I563-FILE.
077080     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
077090     MOVE '563 FILE:  ' TO WS-FILE-HD-FILE-NBR.
077100     MOVE 'MANIP FILE 3' TO WS-FILE-HD-FILE-NAME.
077110     MOVE WS-IPARM-BC TO I563-BC.
077120     MOVE ZERO TO I563-KEY-SEQUENCE.
077130     PERFORM 2210-START-READ-I563-FILE.
077140     PERFORM
077150*                * BY KEY BC  -  DIRECT 563 LOOK-UP *
077160         WITH TEST BEFORE
077170         UNTIL (NOT WS-I563-SUCCESSFUL)
077180             OR (I563-BC NOT EQUAL WS-IPARM-BC)
077190       PERFORM 2230-REPORT-I563-RECORD
077200       PERFORM 2220-READ-I563-FILE-NEXT
077210     END-PERFORM.
077220     IF WS-563-ENTRY-COUNT NOT EQUAL +0
077230       SET IX-WS-563-TBL TO +1
077240       PERFORM
077250*                * BY CHANGE BC  -  TABLE LOOK-UP *
077260           WS-563-ENTRY-COUNT TIMES
077270         IF WS-563-CHANGE-BC (IX-WS-563-TBL) EQUAL WS-IPARM-BC
077280           MOVE WS-563-RECORD-KEY (IX-WS-563-TBL) TO
077290                 I563-RECORD-KEY
077300           READ I563-FILE KEY I563-RECORD-KEY
077310           IF WS-I563-SUCCESSFUL
077320             PERFORM 2230-REPORT-I563-RECORD
077330           ELSE
077340             DISPLAY '* VSAM ERROR ON I563 READ. KEY = "'
077350                   WS-563-RECORD-KEY (IX-WS-563-TBL)
077360                   '". FILE STATUS = ' WS-I563-FILE-STATUS '. *'
077370                   UPON SYSOUT
077380             GO TO 9900-DISPLAY-ABORT
077390           END-IF
077400         END-IF
077410         SET IX-WS-563-TBL UP BY 1
077420       END-PERFORM.
077430*
077440   2210-START-READ-I563-FILE.
077450     START I563-FILE KEY NOT LESS I563-RECORD-KEY.
077460     IF WS-I563-SUCCESSFUL
077470       PERFORM 2220-READ-I563-FILE-NEXT
077480     ELSE
077490       IF (NOT WS-I563-END-OF-FILE)
077500           AND (NOT WS-I563-NO-SUCH-RECORD)
077510         DISPLAY '* VSAM ERROR ON I563 START. KEY NOT LESS "'
077520               I563-RECORD-KEY '". FILE STATUS = '
077530               WS-I563-FILE-STATUS '. *' UPON SYSOUT
077540         GO TO 9900-DISPLAY-ABORT.
077550*
077560   2220-READ-I563-FILE-NEXT.
077570     READ I563-FILE NEXT RECORD.
077580     IF (NOT WS-I563-SUCCESSFUL)
077590         AND (NOT WS-I563-END-OF-FILE)
077600       DISPLAY '* VSAM ERROR ON I563 READ NEXT. FILE STATUS = '
077610             WS-I563-FILE-STATUS '. *' UPON SYSOUT
077620       GO TO 9900-DISPLAY-ABORT.
077630*
077640   2230-REPORT-I563-RECORD.
077650     IF PRINT-COLUMN-HEAD
077660       MOVE +3 TO WS-LINES-NEEDED
077670     ELSE
077680       MOVE +1 TO WS-LINES-NEEDED.
077690     PERFORM 0500-CHECK-FOR-HEADINGS.
077700     IF PRINT-COLUMN-HEAD
077710       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
077720       MOVE WS-563-C1 TO PRINTER1-RECORD
077730       PERFORM 0600-WRITE-PRINTER1-RECORD
077740       MOVE WS-563-D1 TO PRINTER1-RECORD
077750       PERFORM 0600-WRITE-PRINTER1-RECORD.
077760     MOVE I563-BC TO WS-563-P1-BC.
077770     MOVE I563-KEY-SEQUENCE TO WS-563-P1-KEY-SEQ.
077780     MOVE I563-DATE-OF-LAST-UPDATE TO WS-563-P1-UPDATE-DATE.
077790     MOVE I563-MATCH-LOW-PRI-BRANCH TO WS-563-P1-M-LOW-PRI-BR.
077800     MOVE I563-MATCH-HIGH-PRI-BRANCH TO WS-563-P1-M-HIGH-PRI-BR.
077810     MOVE I563-MATCH-12-BYTE-PRODUCT TO WS-563-P1-M-PROD.
077820     MOVE I563-MATCH-ACCOUNT-FORMAT TO WS-563-P1-M-ACCT-FMT.
077830     MOVE I563-MATCH-P-O-FLAG TO WS-563-P1-M-PO-FLAG.
077840     MOVE I563-CHANGE-BC TO WS-563-P1-CHG-BC.
077850     MOVE I563-CHANGE-PRIMARY-BRANCH TO WS-563-P1-CHG-PRI-BR.
077860     MOVE WS-563-P1 TO PRINTER1-RECORD.
077870     PERFORM 0600-WRITE-PRINTER1-RECORD.
077880*
077890   2400-CHECK-I565-FILE.
077900     MOVE WS-IPARM-BC TO I565-BC.
077910     MOVE ZERO TO I565-KEY-SEQUENCE.
077920     PERFORM 2410-START-READ-I565-FILE.
077930     IF WS-I565-SUCCESSFUL
077940         AND (I565-BC EQUAL WS-IPARM-BC)
077950       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
077960       MOVE '565 FILE:  ' TO WS-FILE-HD-FILE-NBR
077970       MOVE 'MANIP FILE 5' TO WS-FILE-HD-FILE-NAME
077980       PERFORM
077990           WITH TEST AFTER
078000           UNTIL (NOT WS-I565-SUCCESSFUL)
078010               OR (I565-BC NOT EQUAL WS-IPARM-BC)
078020         PERFORM 2430-REPORT-I565-RECORD
078030         PERFORM 2420-READ-I565-FILE-NEXT
078040       END-PERFORM.
078050*
078060   2410-START-READ-I565-FILE.
078070     START I565-FILE KEY NOT LESS I565-RECORD-KEY.
078080     IF WS-I565-SUCCESSFUL
078090       PERFORM 2420-READ-I565-FILE-NEXT
078100     ELSE
078110       IF (NOT WS-I565-END-OF-FILE)
078120           AND (NOT WS-I565-NO-SUCH-RECORD)
078130         DISPLAY '* VSAM ERROR ON I565 START. KEY NOT LESS "'
078140               I565-RECORD-KEY '". FILE STATUS = '
078150               WS-I565-FILE-STATUS '.  *' UPON SYSOUT
078160         GO TO 9900-DISPLAY-ABORT.
078170*
078180   2420-READ-I565-FILE-NEXT.
078190     READ I565-FILE NEXT RECORD.
078200     IF (NOT WS-I565-SUCCESSFUL)
078210         AND (NOT WS-I565-END-OF-FILE)
078220       DISPLAY '* VSAM ERROR ON I565 READ NEXT. FILE STATUS = '
078230             WS-I565-FILE-STATUS '. *' UPON SYSOUT
078240       GO TO 9900-DISPLAY-ABORT.
078250*
078260   2430-REPORT-I565-RECORD.
078270     IF PRINT-COLUMN-HEAD
078280       MOVE +3 TO WS-LINES-NEEDED
078290     ELSE
078300       MOVE +1 TO WS-LINES-NEEDED.
078310     PERFORM 0500-CHECK-FOR-HEADINGS.
078320     IF PRINT-COLUMN-HEAD
078330       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
078340       MOVE WS-565-C1 TO PRINTER1-RECORD
078350       PERFORM 0600-WRITE-PRINTER1-RECORD
078360       MOVE WS-565-D1 TO PRINTER1-RECORD
078370       PERFORM 0600-WRITE-PRINTER1-RECORD.
078380     MOVE I565-BC TO WS-565-P1-BC.
078390     MOVE I565-KEY-SEQUENCE TO WS-565-P1-KEY-SEQ.
078400     MOVE I565-DATE-OF-LAST-UPDATE TO WS-565-P1-UPDATE-DATE.
078410     MOVE I565-MATCH-LOW-PRI-BRANCH TO WS-565-P1-M-LOW-PRI-BR.
078420     MOVE I565-MATCH-HIGH-PRI-BRANCH TO WS-565-P1-M-HIGH-PRI-BR.
078430     MOVE I565-MATCH-EXPENSE-FLAG TO WS-565-P1-M-EXP-FLG.
078440     MOVE I565-MATCH-CREDIT-FLAG TO WS-565-P1-M-CR-FLG.
078450     MOVE I565-MATCH-PURCH-ORD-FLAG TO WS-565-P1-M-P-O-FLG.
078460     MOVE I565-MATCH-PRODUCT-CODE TO WS-565-P1-M-PROD-CODE.
078470     MOVE I565-MATCH-ACCOUNT-FORMAT TO WS-565-P1-M-ACCT-FMT.
078480     MOVE I565-FORCE-TO-INVOICE-FLAG TO WS-565-P1-FORCE-TO-INV.
078490     MOVE I565-OVERRIDE-NACHA-CODE TO WS-565-P1-NACHA.
078500     IF I565-OVERRIDE-NACHA-CODE NOT EQUAL SPACE
078510       MOVE I565-OVERRIDE-NACHA-CODE TO WS-NACHA-CODE
078520       PERFORM 1538-STORE-NACHA-CODE.
078530     MOVE WS-565-P1 TO PRINTER1-RECORD.
078540     PERFORM 0600-WRITE-PRINTER1-RECORD.
078550*
078560*
078570   2440-CHECK-I566SUM-FILE.
078580     PERFORM 8561-READ-I566SUM-FILE
078590         UNTIL (I566S-BC NOT LESS WS-IPARM-BC)
078600              OR END-I566SUM-FILE.
078610     IF I566S-BC EQUAL WS-IPARM-BC
078620       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
078630       MOVE '566 FILE:  ' TO WS-FILE-HD-FILE-NBR
078640       MOVE 'NUMBER OF 566 RECORDS' TO WS-FILE-HD-FILE-NAME
078650       PERFORM 2450-REPORT-I566SUM-RECORD
078660             UNTIL (I566S-BC NOT EQUAL WS-IPARM-BC)
078670                  OR END-I566SUM-FILE.
078680*
078690   2450-REPORT-I566SUM-RECORD.
078700     IF PRINT-COLUMN-HEAD
078710       MOVE +3 TO WS-LINES-NEEDED
078720     ELSE
078730       MOVE +1 TO WS-LINES-NEEDED.
078740     PERFORM 0500-CHECK-FOR-HEADINGS.
078750     IF PRINT-COLUMN-HEAD
078760       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
078770       MOVE WS-566-C1 TO PRINTER1-RECORD
078780       PERFORM 0600-WRITE-PRINTER1-RECORD
078790       MOVE WS-566-D1 TO PRINTER1-RECORD
078800       PERFORM 0600-WRITE-PRINTER1-RECORD.
078810       MOVE I566S-BC TO WS-566-P1-BC
078820       MOVE I566S-RECORD-TYPE TO WS-566-P1-RECORD-TYPE
078830       MOVE I566S-PREF-CONV-PROGRAM-ID TO WS-566-P1-PROG-ID
078840       MOVE I566S-RECORD-COUNT TO WS-566-P1-REC-CNT
078850       MOVE WS-566-P1 TO PRINTER1-RECORD
078860       PERFORM 0600-WRITE-PRINTER1-RECORD
078870       PERFORM 8561-READ-I566SUM-FILE.
078880*
078890   2500-CHECK-I567-FILE.
078900     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
078910     MOVE '567 FILE:  ' TO WS-FILE-HD-FILE-NBR.
078920     MOVE 'PREFERRED/CONVERSION PROGRAMS FILE' TO
078930           WS-FILE-HD-FILE-NAME.
078940     MOVE WS-IPARM-BC TO I567-BC.
078950     MOVE LOW-VALUE TO I567-PREF-CONV-PROGRAM-ID.
078960     PERFORM 2510-START-READ-I567-FILE.
078970     PERFORM
078980*                * BY KEY BC  -  DIRECT 567 LOOK-UP *
078990         WITH TEST BEFORE
079000         UNTIL (NOT WS-I567-SUCCESSFUL)
079010             OR (I567-BC NOT EQUAL WS-IPARM-BC)
079020       PERFORM 2530-REPORT-I567-RECORD
079030       PERFORM 2520-READ-I567-FILE-NEXT
079040     END-PERFORM.
079050     IF WS-567-ENTRY-COUNT NOT EQUAL +0
079060       SET IX-WS-567-TBL TO +1
079070       PERFORM
079080*                * BY CHANGE BC  -  TABLE LOOK-UP *
079090           WS-567-ENTRY-COUNT TIMES
079100         IF WS-567-CHANGE-BC (IX-WS-567-TBL) EQUAL WS-IPARM-BC
079110           MOVE WS-567-RECORD-KEY (IX-WS-567-TBL) TO
079120                 I567-RECORD-KEY
079130           READ I567-FILE KEY I567-RECORD-KEY
079140           IF WS-I567-SUCCESSFUL
079150             PERFORM 2530-REPORT-I567-RECORD
079160           ELSE
079170             DISPLAY '* VSAM ERROR ON I567 READ. KEY = "'
079180                   WS-567-RECORD-KEY (IX-WS-567-TBL)
079190                   '". FILE STATUS = ' WS-I567-FILE-STATUS '. *'
079200                   UPON SYSOUT
079210             GO TO 9900-DISPLAY-ABORT
079220           END-IF
079230         END-IF
079240         SET IX-WS-567-TBL UP BY 1
079250       END-PERFORM.
079260*
079270   2510-START-READ-I567-FILE.
079280     START I567-FILE KEY NOT LESS I567-RECORD-KEY.
079290     IF WS-I567-SUCCESSFUL
079300       PERFORM 2520-READ-I567-FILE-NEXT
079310     ELSE
079320       IF (NOT WS-I567-END-OF-FILE)
079330           AND (NOT WS-I567-NO-SUCH-RECORD)
079340         DISPLAY '* VSAM ERROR ON I567 START. KEY NOT LESS "'
079350               I567-RECORD-KEY '". FILE STATUS = '
079360               WS-I567-FILE-STATUS '. *' UPON SYSOUT
079370         GO TO 9900-DISPLAY-ABORT.
079380*
079390   2520-READ-I567-FILE-NEXT.
079400     READ I567-FILE NEXT RECORD.
079410     IF (NOT WS-I567-SUCCESSFUL)
079420         AND (NOT WS-I567-END-OF-FILE)
079430       DISPLAY '* VSAM ERROR ON I567 READ NEXT. FILE STATUS = '
079440             WS-I567-FILE-STATUS '. *' UPON SYSOUT
079450       GO TO 9900-DISPLAY-ABORT.
079460*
079470   2530-REPORT-I567-RECORD.
079480     IF PRINT-COLUMN-HEAD
079490       MOVE +3 TO WS-LINES-NEEDED
079500     ELSE
079510       MOVE +1 TO WS-LINES-NEEDED.
079520     PERFORM 0500-CHECK-FOR-HEADINGS.
079530     IF PRINT-COLUMN-HEAD
079540       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
079550       MOVE WS-567-C1 TO PRINTER1-RECORD
079560       PERFORM 0600-WRITE-PRINTER1-RECORD
079570       MOVE WS-567-D1 TO PRINTER1-RECORD
079580       PERFORM 0600-WRITE-PRINTER1-RECORD.
079590     MOVE I567-BC TO WS-567-P1-BC.
079600     MOVE I567-PREF-CONV-PROGRAM-ID TO WS-567-P1-PROG-ID.
079610     MOVE I567-DATE-OF-LAST-UPDATE TO WS-567-P1-UPDATE-DATE.
079620     MOVE I567-CHANGE-PRODUCT-BYTES-1-2 TO WS-567-P1-CHG-EXP-CODE.
079630     MOVE I567-CHANGE-BC TO WS-567-P1-CHG-BC.
079640     MOVE I567-CHANGE-PRI-BRANCH TO WS-567-P1-CHG-PRI-BR.
079650     MOVE I567-L-RESET-FLAG TO WS-567-P1-RESET-FLAG.
079660     MOVE I567-L-MAX-WAIVED-UNITS TO WS-567-P1-L-MAX-WVE-UNIT.
079670     MOVE I567-PROD-RESTR-DEFAULT TO WS-567-P1-PROD-RESTR-DEF.
079680     MOVE I567-EMPL-CONV-FLAG TO WS-567-P1-EMP-CNV-FLAG.
079690     MOVE I567-PROD-RESTR-COUNT TO WS-567-P1-PROD-RESTR-CT.
079700     IF I567-PROD-RESTR-COUNT NOT EQUAL +0
079710       MOVE '** RECORD ALSO HAS "B CARD" PRODUCT RESTRICTIONS **'
079720             TO WS-567-P1-B-CARD-MSG
079730     ELSE
079740       MOVE SPACE TO WS-567-P1-B-CARD-MSG.
079750     MOVE WS-567-P1 TO PRINTER1-RECORD.
079760     PERFORM 0600-WRITE-PRINTER1-RECORD.
079770*
079780   2600-CHECK-I996P-FILE.
079790     PERFORM 2610-READ-I996P-FILE
079800       WITH TEST BEFORE
079810       UNTIL END-I996P-FILE
079820             OR (I996P-BC NOT LESS WS-IPARM-BC).
079830     IF (NOT END-I996P-FILE)
079840         AND (I996P-BC EQUAL WS-IPARM-BC)
079850       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
079860       MOVE '996C FILE: ' TO WS-FILE-HD-FILE-NBR
079870       MOVE 'ASSIGN PROGRAM ID BY BC' TO WS-FILE-HD-FILE-NAME
079880       PERFORM 2620-REPORT-I996P-RECORD
079890         WITH TEST AFTER
079900         UNTIL END-I996P-FILE
079910               OR (I996P-BC GREATER WS-IPARM-BC).
079920*
079930   2610-READ-I996P-FILE.
079940     READ I996P-FILE
079950       AT END
079960         MOVE 'E' TO WS-I996P-FILE-FLAG
079970       NOT AT END
079980         IF I996P-BC NOT LESS WS-I996P-BC
079990           MOVE I996P-BC TO WS-I996P-BC
080000         ELSE
080010           DISPLAY '* I996P SEQUENCE ERROR "' WS-I996P-BC '" "'
080020                 I996P-BC '" *' UPON SYSOUT
080030           GO TO 9900-DISPLAY-ABORT
080040         END-IF
080050       END-READ.
080060*
080070   2620-REPORT-I996P-RECORD.
080080     IF PRINT-COLUMN-HEAD
080090       MOVE +3 TO WS-LINES-NEEDED
080100     ELSE
080110       MOVE +1 TO WS-LINES-NEEDED.
080120     PERFORM 0500-CHECK-FOR-HEADINGS.
080130     IF PRINT-COLUMN-HEAD
080140       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
080150       MOVE WS-996P-C1 TO PRINTER1-RECORD
080160       PERFORM 0600-WRITE-PRINTER1-RECORD
080170       MOVE WS-996P-D1 TO PRINTER1-RECORD
080180       PERFORM 0600-WRITE-PRINTER1-RECORD.
080190     MOVE I996P-BC TO WS-996P-P1-BC.
080200     MOVE I996P-SEQ-NBR TO WS-996P-P1-SEQ-NBR.
080210     MOVE I996P-MATCH-TYPE TO WS-996P-P1-MATCH-TYPE.
080220     MOVE I996P-MATCH-PRODUCT TO WS-996P-P1-MATCH-PROD.
080230     MOVE I996P-CONVERSION-FLAG TO WS-996P-P1-CONVERS-FLG.
080240     MOVE I996P-PROGRAM-ID TO WS-996P-P1-PROGRAM-ID.
080250     MOVE I996P-DESCRIPTION TO WS-996P-P1-DESCRIPTION.
080260     MOVE WS-996P-P1 TO PRINTER1-RECORD.
080270     PERFORM 0600-WRITE-PRINTER1-RECORD.
080280     PERFORM 2610-READ-I996P-FILE.
080290*
080300   2900-CHECK-I233P-FILE.
080310     PERFORM 2910-READ-I233P-FILE
080320       WITH TEST BEFORE
080330       UNTIL END-I233P-FILE
080340             OR (WS-I233P-BC NOT LESS WS-IPARM-BC).
080350     IF (NOT END-I233P-FILE)
080360         AND (WS-I233P-BC EQUAL WS-IPARM-BC)
080370       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
080380       MOVE '233C FILE: ' TO WS-FILE-HD-FILE-NBR
080390       MOVE 'ORDER SCREEN / MAIL CARE EXP CODE OVERRIDES' TO
080400             WS-FILE-HD-FILE-NAME
080410       PERFORM 2920-REPORT-I233P-CARD
080420         WITH TEST AFTER
080430         UNTIL END-I233P-FILE
080440               OR (WS-I233P-BC GREATER WS-IPARM-BC).
080450*
080460   2910-READ-I233P-FILE.
080470     READ I233P-FILE
080480       AT END
080490         MOVE 'E' TO WS-I233P-FILE-FLAG
080500       NOT AT END
080510         IF I233P-BC GREATER WS-I233P-BC
080520           MOVE I233P-BC TO WS-I233P-BC
080530         ELSE
080540           DISPLAY '* I233P SEQUENCE ERROR "' WS-I233P-BC '" "'
080550                 I233P-BC '" *' UPON SYSOUT
080560           GO TO 9900-DISPLAY-ABORT
080570         END-IF
080580       END-READ.
080590*
080600   2920-REPORT-I233P-CARD.
080610     IF PRINT-COLUMN-HEAD
080620       MOVE +3 TO WS-LINES-NEEDED
080630     ELSE
080640       MOVE +1 TO WS-LINES-NEEDED.
080650     PERFORM 0500-CHECK-FOR-HEADINGS.
080660     IF PRINT-COLUMN-HEAD
080670       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
080680       MOVE WS-233P-C1 TO PRINTER1-RECORD
080690       PERFORM 0600-WRITE-PRINTER1-RECORD
080700       MOVE WS-233P-D1 TO PRINTER1-RECORD
080710       PERFORM 0600-WRITE-PRINTER1-RECORD.
080720     MOVE I233P-BC TO WS-233P-P1-BC.
080730     MOVE I233P-EXP-CODE (01) TO WS-233P-P1-EXP-CODE (01).
080740     MOVE I233P-EXP-CODE (02) TO WS-233P-P1-EXP-CODE (02).
080750     MOVE I233P-EXP-CODE (03) TO WS-233P-P1-EXP-CODE (03).
080760     MOVE I233P-EXP-CODE (04) TO WS-233P-P1-EXP-CODE (04).
080770     MOVE I233P-EXP-CODE (05) TO WS-233P-P1-EXP-CODE (05).
080780     MOVE I233P-EXP-CODE (06) TO WS-233P-P1-EXP-CODE (06).
080790     MOVE I233P-EXP-CODE (07) TO WS-233P-P1-EXP-CODE (07).
080800     MOVE I233P-EXP-CODE (08) TO WS-233P-P1-EXP-CODE (08).
080810     MOVE I233P-EXP-CODE (09) TO WS-233P-P1-EXP-CODE (09).
080820     MOVE I233P-EXP-CODE (10) TO WS-233P-P1-EXP-CODE (10).
080830     MOVE I233P-EXP-CODE (11) TO WS-233P-P1-EXP-CODE (11).
080840     MOVE I233P-EXP-CODE (12) TO WS-233P-P1-EXP-CODE (12).
080850     MOVE I233P-EXP-CODE (13) TO WS-233P-P1-EXP-CODE (13).
080860     MOVE I233P-EXP-CODE (14) TO WS-233P-P1-EXP-CODE (14).
080870     MOVE I233P-EXP-CODE (15) TO WS-233P-P1-EXP-CODE (15).
080880     MOVE I233P-EXP-CODE (16) TO WS-233P-P1-EXP-CODE (16).
080890     MOVE I233P-EXP-CODE (17) TO WS-233P-P1-EXP-CODE (17).
080900     MOVE I233P-EXP-CODE (18) TO WS-233P-P1-EXP-CODE (18).
080910     MOVE I233P-EXP-CODE (19) TO WS-233P-P1-EXP-CODE (19).
080920     MOVE I233P-EXP-CODE (20) TO WS-233P-P1-EXP-CODE (20).
080930     MOVE WS-233P-P1 TO PRINTER1-RECORD.
080940     PERFORM 0600-WRITE-PRINTER1-RECORD.
080950     PERFORM 2910-READ-I233P-FILE.
080960*
080970   3000-CHECK-556-TABLE.
080980     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
080990     MOVE '556 FILE:  ' TO WS-FILE-HD-FILE-NBR.
081000     MOVE 'SUMMARY INVOICE CONTROL FILE' TO WS-FILE-HD-FILE-NAME.
081010     SET IX-WS-556-TBL TO +1.
081020     PERFORM
081030         WS-556-ENTRY-COUNT TIMES
081040       MOVE WS-556-TBL-ENTRY (IX-WS-556-TBL) TO WS-556-REC
081050       IF WS-IPARM-BC EQUAL WS-556-KEY-BC OR WS-556-SUM-BC
081060         IF (WS-556-SUM-BC IS NUMERIC)
081070             AND (WS-556-SUM-BC NOT EQUAL WS-IPARM-BC)
081080           MOVE WS-556-SUM-BC TO WS-INV-BC
081090           PERFORM 3020-CHECK-INV-BC
081100         END-IF
081110         PERFORM 3010-REPORT-556-ENTRY
081120       END-IF
081130       SET IX-WS-556-TBL UP BY 1
081140     END-PERFORM.
081150*
081160   3010-REPORT-556-ENTRY.
081170     IF PRINT-COLUMN-HEAD
081180       MOVE +4 TO WS-LINES-NEEDED
081190     ELSE
081200       MOVE +1 TO WS-LINES-NEEDED.
081210     PERFORM 0500-CHECK-FOR-HEADINGS.
081220     IF PRINT-COLUMN-HEAD
081230       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
081240       MOVE WS-556-C1A TO PRINTER1-RECORD
081250       PERFORM 0600-WRITE-PRINTER1-RECORD
081260       MOVE WS-556-C1B TO PRINTER1-RECORD
081270       PERFORM 0600-WRITE-PRINTER1-RECORD
081280       MOVE WS-556-D1 TO PRINTER1-RECORD
081290       PERFORM 0600-WRITE-PRINTER1-RECORD.
081300     MOVE WS-556-KEY-BC TO WS-556-P1-KEY-BC.
081310     MOVE WS-556-KEY-SEQ TO WS-556-P1-KEY-SEQ.
081320     MOVE WS-556-UPDATE TO WS-556-P1-UPDATE.
081330     MOVE WS-556-SUM-BC TO WS-556-P1-SUM-BC.
081340     MOVE WS-556-SUM-BR TO WS-556-P1-SUM-BR.
081350     MOVE WS-556-SUM-SI TO WS-556-P1-SUM-SI.
081360     MOVE WS-556-LOW-BR TO WS-556-P1-LOW-BR.
081370     MOVE WS-556-HIGH-BR TO WS-556-P1-HIGH-BR.
081380     MOVE WS-556-MEDIUM TO WS-556-P1-MEDIUM.
081390     MOVE WS-556-NACHA TO WS-556-P1-NACHA.
081400     MOVE WS-556-PO-FLG TO WS-556-P1-PO-FLG.
081410     MOVE WS-556-PRODUCT TO WS-556-P1-PRODUCT.
081420     MOVE WS-556-P1 TO PRINTER1-RECORD.
081430     PERFORM 0600-WRITE-PRINTER1-RECORD.
081440*
081450   3020-CHECK-INV-BC.
081460     SET IX-WS-INV-BC-CURR TO +1.
081470     PERFORM
081480         WITH TEST BEFORE
081490         UNTIL (IX-WS-INV-BC-CURR NOT LESS IX-WS-INV-BC-EMPTY)
081500             OR (WS-TBL-INV-BC (IX-WS-INV-BC-CURR) NOT LESS
081510                   WS-INV-BC)
081520       SET IX-WS-INV-BC-CURR UP BY 1
081530     END-PERFORM.
081540     IF (IX-WS-INV-BC-CURR NOT LESS IX-WS-INV-BC-EMPTY)
081550         OR (WS-TBL-INV-BC (IX-WS-INV-BC-CURR) NOT EQUAL
081560               WS-INV-BC)
081570*                * BC NOT YET IN TABLE - NEED TO INSTALL *
081580       IF IX-WS-INV-BC-EMPTY GREATER +100
081590         DISPLAY '* INVOICE BC TABLE OVERFLOWED FULL FOR BC "'
081600               WS-IPARM-BC '" *' UPON SYSOUT
081610         GO TO 9900-DISPLAY-ABORT
081620       END-IF
081630       IF IX-WS-INV-BC-CURR LESS IX-WS-INV-BC-EMPTY
081640*                * HIGHER BCS IN TABLE - SHIFT TO MAKE ROOM *
081650         SET IX-WS-INV-BC-FROM TO IX-WS-INV-BC-EMPTY
081660         PERFORM
081670             WITH TEST AFTER
081680             UNTIL IX-WS-INV-BC-FROM NOT GREATER IX-WS-INV-BC-CURR
081690           SET IX-WS-INV-BC-TO TO IX-WS-INV-BC-FROM
081700           SET IX-WS-INV-BC-FROM DOWN BY 1
081710           MOVE WS-TBL-INV-BC (IX-WS-INV-BC-FROM)
081720                 TO WS-TBL-INV-BC (IX-WS-INV-BC-TO)
081730         END-PERFORM
081740       END-IF
081750*                * INSTALL NEW ENTRY & ADJUST "EMPTY" INDEX *
081760       MOVE WS-INV-BC TO WS-TBL-INV-BC (IX-WS-INV-BC-CURR)
081770       SET IX-WS-INV-BC-EMPTY UP BY 1.
081780*
081790   3050-CHECK-C285-TABLE.
081800     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
081810     MOVE '285C FILE: ' TO WS-FILE-HD-FILE-NBR.
081820     MOVE 'INVOICE PAYMENT TERM EXCEPTIONS' TO
081830           WS-FILE-HD-FILE-NAME.
081840     SET IX-WS-INV-BC-CURR IX-WS-C285-TBL-CURR TO +1.
081850     PERFORM
081860         WITH TEST AFTER
081870         UNTIL (IX-WS-INV-BC-CURR NOT LESS IX-WS-INV-BC-EMPTY)
081880             OR (IX-WS-C285-TBL-CURR NOT LESS
081890                   IX-WS-C285-TBL-EMPTY)
081900       MOVE WS-TBL-INV-BC (IX-WS-INV-BC-CURR) TO WS-INV-BC
081910       PERFORM
081920           WITH TEST BEFORE
081930           UNTIL (IX-WS-C285-TBL-CURR NOT LESS
081940                 IX-WS-C285-TBL-EMPTY)
081950               OR (WS-C285-TBL-BC (IX-WS-C285-TBL-CURR) NOT LESS
081960                     WS-INV-BC)
081970         SET IX-WS-C285-TBL-CURR UP BY 1
081980       END-PERFORM
081990       PERFORM
082000           WITH TEST BEFORE
082010           UNTIL (IX-WS-C285-TBL-CURR NOT LESS
082020                 IX-WS-C285-TBL-EMPTY)
082030               OR (WS-C285-TBL-BC (IX-WS-C285-TBL-CURR) GREATER
082040                     WS-INV-BC)
082050         MOVE WS-C285-TBL-REC (IX-WS-C285-TBL-CURR) TO
082060               WS-C285-REC
082070         PERFORM 3060-REPORT-C285-REC
082080         SET IX-WS-C285-TBL-CURR UP BY 1
082090       END-PERFORM
082100       SET IX-WS-INV-BC-CURR UP BY 1
082110     END-PERFORM.
082120*
082130   3060-REPORT-C285-REC.
082140     IF PRINT-COLUMN-HEAD
082150       MOVE +3 TO WS-LINES-NEEDED
082160     ELSE
082170       MOVE +1 TO WS-LINES-NEEDED.
082180     PERFORM 0500-CHECK-FOR-HEADINGS.
082190     IF PRINT-COLUMN-HEAD
082200       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
082210       MOVE WS-285P-C1 TO PRINTER1-RECORD
082220       PERFORM 0600-WRITE-PRINTER1-RECORD
082230       MOVE WS-285P-D1 TO PRINTER1-RECORD
082240       PERFORM 0600-WRITE-PRINTER1-RECORD.
082250     MOVE WS-C285-BC TO WS-285P-P1-BC.
082260     MOVE WS-C285-PRI-BR TO WS-285P-P1-PRI-BR.
082270     MOVE WS-C285-SEC-BR TO WS-285P-P1-SEC-BR.
082280     MOVE WS-C285-TYP-CD TO WS-285P-P1-TYP-CD.
082290     MOVE WS-C285-SEP-INV TO WS-285P-P1-SEP-INV.
082300     MOVE WS-C285-PYMT-DAYS TO WS-285P-P1-PYMT-DAYS.
082310     MOVE WS-285P-P1 TO PRINTER1-RECORD.
082320     PERFORM 0600-WRITE-PRINTER1-RECORD.
082330*
082340   3100-CHECK-I262P-FILE.
082350     PERFORM 3110-READ-I262P-FILE
082360       WITH TEST BEFORE
082370       UNTIL END-I262P-FILE
082380             OR (I262P-BC NOT LESS WS-IPARM-BC).
082390     IF (NOT END-I262P-FILE)
082400         AND (I262P-BC EQUAL WS-IPARM-BC)
082410       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
082420       MOVE '262C FILE: ' TO WS-FILE-HD-FILE-NBR
082430       MOVE 'MAIL CODE ASSIGNMENT' TO WS-FILE-HD-FILE-NAME
082440       PERFORM 3120-REPORT-I262P-RECORD
082450         WITH TEST AFTER
082460         UNTIL END-I262P-FILE
082470               OR (I262P-BC GREATER WS-IPARM-BC).
082480*
082490   3110-READ-I262P-FILE.
082500     READ I262P-FILE
082510       AT END
082520         MOVE 'E' TO WS-I262P-FILE-FLAG
082530       NOT AT END
082540         IF I262P-BC NOT LESS WS-I262P-BC
082550           MOVE I262P-BC TO WS-I262P-BC
082560         ELSE
082570           DISPLAY '* I262P SEQUENCE ERROR "' WS-I262P-BC '" "'
082580                 I262P-BC '" *' UPON SYSOUT
082590           GO TO 9900-DISPLAY-ABORT
082600         END-IF
082610       END-READ.
082620*
082630   3120-REPORT-I262P-RECORD.
082640     IF PRINT-COLUMN-HEAD
082650       MOVE +3 TO WS-LINES-NEEDED
082660     ELSE
082670       MOVE +1 TO WS-LINES-NEEDED.
082680     PERFORM 0500-CHECK-FOR-HEADINGS.
082690     IF PRINT-COLUMN-HEAD
082700       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
082710       MOVE WS-262P-C1 TO PRINTER1-RECORD
082720       PERFORM 0600-WRITE-PRINTER1-RECORD
082730       MOVE WS-262P-D1 TO PRINTER1-RECORD
082740       PERFORM 0600-WRITE-PRINTER1-RECORD.
082750     MOVE I262P-BC TO WS-262P-P1-BC.
082760     MOVE I262P-PRI-BR TO WS-262P-P1-PRI-BR.
082770     MOVE I262P-SEC-BR TO WS-262P-P1-SEC-BR.
082780     MOVE I262P-BILL-TYPE TO WS-262P-P1-BILL-TYPE.
082790     MOVE I262P-SEP-INV-CODE TO WS-262P-P1-SEP-INV.
082800     MOVE I262P-MAIL-CODE TO WS-262P-P1-MAIL-CODE.
082810     MOVE I262P-COMMENT TO WS-262P-P1-COMMENT.
082820     MOVE WS-262P-P1 TO PRINTER1-RECORD.
082830     PERFORM 0600-WRITE-PRINTER1-RECORD.
082840     IF I262P-MAIL-CODE NOT EQUAL '00000'
082850       PERFORM 3130-STORE-MAIL-CODE.
082860     PERFORM 3110-READ-I262P-FILE.
082870*
082880   3130-STORE-MAIL-CODE.
082890     SET IX-WS-MAIL-CD-CURR TO +1.
082900     PERFORM
082910         WITH TEST BEFORE
082920         UNTIL (IX-WS-MAIL-CD-CURR NOT LESS IX-WS-MAIL-CD-EMPTY)
082930             OR (WS-MAIL-CODE (IX-WS-MAIL-CD-CURR) NOT LESS
082940                   I262P-MAIL-CODE)
082950       SET IX-WS-MAIL-CD-CURR UP BY 1
082960     END-PERFORM.
082970     IF (IX-WS-MAIL-CD-CURR EQUAL IX-WS-MAIL-CD-EMPTY)
082980         OR (WS-MAIL-CODE (IX-WS-MAIL-CD-CURR) GREATER
082990               I262P-MAIL-CODE)
083000*                * MAIL CODE NOT YET IN TABLE *
083010       IF WS-MAIL-CODE-COUNT LESS +99
083020*                * THERE'S ROOM FOR IT *
083030         ADD 1 TO WS-MAIL-CODE-COUNT
083040         IF IX-WS-MAIL-CD-CURR LESS IX-WS-MAIL-CD-EMPTY
083050*                * IT GOES ELSEWHERE THAN END OF TABLE *
083060           SET IX-WS-MAIL-CD-FROM TO IX-WS-MAIL-CD-EMPTY
083070           PERFORM
083080               WITH TEST AFTER
083090               UNTIL IX-WS-MAIL-CD-FROM NOT GREATER
083100                     IX-WS-MAIL-CD-CURR
083110             SET IX-WS-MAIL-CD-TO TO IX-WS-MAIL-CD-FROM
083120             SET IX-WS-MAIL-CD-FROM DOWN BY 1
083130             MOVE WS-MAIL-CODE (IX-WS-MAIL-CD-FROM) TO
083140                   WS-MAIL-CODE (IX-WS-MAIL-CD-TO)
083150           END-PERFORM
083160         END-IF
083170         MOVE I262P-MAIL-CODE TO WS-MAIL-CODE (IX-WS-MAIL-CD-CURR)
083180         SET IX-WS-MAIL-CD-EMPTY UP BY 1
083190       ELSE
083200*                * THERE'S NO ROOM FOR IT *
083210         DISPLAY '* MAIL CODE TABLE OVERFLOWED FOR IPARM BC "'
083220               WS-IPARM-BC '" *' UPON SYSOUT
083230         GO TO 9900-DISPLAY-ABORT.
083240*
083250   3200-CHECK-C769-TABLE.
083260     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
083270     MOVE '769C FILE: ' TO WS-FILE-HD-FILE-NBR.
083280     MOVE 'INVOICE SPECIAL ADDRESSES' TO WS-FILE-HD-FILE-NAME.
083290     SET IX-WS-C769-TBL TO +1.
083300     PERFORM
083310         WS-C769-ENTRY-COUNT TIMES
083320       IF WS-C769-BC (IX-WS-C769-TBL) EQUAL WS-IPARM-BC
083330         PERFORM 3210-REPORT-C769-ENTRY
083340       ELSE
083350         IF (WS-MAIL-CODE-COUNT GREATER +0)
083360             AND (WS-C769-BC (IX-WS-C769-TBL) EQUAL SPACE)
083370           SEARCH ALL WS-MAIL-CODE
083380             WHEN WS-MAIL-CODE (IX-WS-MAIL-CD-CURR) EQUAL
083390                   WS-C769-MAIL-CODE (IX-WS-C769-TBL)
083400               PERFORM 3210-REPORT-C769-ENTRY
083410           END-SEARCH
083420         END-IF
083430       END-IF
083440       SET IX-WS-C769-TBL UP BY 1
083450     END-PERFORM.
083460*
083470   3210-REPORT-C769-ENTRY.
083480     IF PRINT-COLUMN-HEAD
083490       MOVE +3 TO WS-LINES-NEEDED
083500     ELSE
083510       MOVE +1 TO WS-LINES-NEEDED.
083520     IF WS-C769-CARD-CODE (IX-WS-C769-TBL) EQUAL '1'
083530*                * TRY TO AVOID PAGE BREAK BETWEEN 1 & 2 PAIR *
083540       ADD 1 TO WS-LINES-NEEDED.
083550     PERFORM 0500-CHECK-FOR-HEADINGS.
083560     IF PRINT-COLUMN-HEAD
083570       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
083580       MOVE WS-769P-C1 TO PRINTER1-RECORD
083590       PERFORM 0600-WRITE-PRINTER1-RECORD
083600       MOVE WS-769P-D1 TO PRINTER1-RECORD
083610       PERFORM 0600-WRITE-PRINTER1-RECORD.
083620     MOVE WS-C769-MAIL-CODE (IX-WS-C769-TBL) TO
083630           WS-769P-P1-MAIL-CODE.
083640     MOVE WS-C769-BC (IX-WS-C769-TBL) TO WS-769P-P1-BC.
083650     MOVE WS-C769-PRI-BR (IX-WS-C769-TBL) TO WS-769P-P1-PRI-BR.
083660     MOVE WS-C769-SEC-BR (IX-WS-C769-TBL) TO WS-769P-P1-SEC-BR.
083670     MOVE WS-C769-BILL-TYPE (IX-WS-C769-TBL) TO
083680           WS-769P-P1-BILL-TYPE.
083690     MOVE WS-C769-SEP-INV-CD (IX-WS-C769-TBL) TO
083700           WS-769P-P1-SEP-INV-CD.
083710     MOVE WS-C769-CARD-CODE (IX-WS-C769-TBL) TO
083720           WS-769P-P1-CARD-CODE.
083730     IF WS-769P-P1-CARD-CODE EQUAL '1'
083740       MOVE WS-C769-1-ADDR-LINE-1 (IX-WS-C769-TBL) TO
083750             WS-769P-P1-ADDR-LINE-1
083760       MOVE WS-C769-1-ADDR-LINE-2 (IX-WS-C769-TBL) TO
083770             WS-769P-P1-ADDR-LINE-2
083780       MOVE WS-C769-1-ADDR-LINE-3 (IX-WS-C769-TBL) TO
083790             WS-769P-P1-ADDR-LINE-3
083800       MOVE SPACE TO WS-769P-P1-BR-NM-REST
083810     ELSE
083820       MOVE SPACE TO WS-769P-P1-ADDR-LINE-2
083830       MOVE WS-C769-2-ADDR-CITY (IX-WS-C769-TBL) TO
083840             WS-769P-P1-ADDR-CITY
083850       MOVE WS-C769-2-ADDR-STATE (IX-WS-C769-TBL) TO
083860             WS-769P-P1-ADDR-STATE
083870       MOVE WS-C769-2-ADDR-ZIP-01-09 (IX-WS-C769-TBL) TO
083880             WS-769P-P1-ADDR-ZIP-9
083890       MOVE WS-C769-2-ADDR-ZIP-10-11 (IX-WS-C769-TBL) TO
083900             WS-769P-P1-ADDR-ZIP-2
083910       MOVE WS-C769-2-BRANCH-NAME (IX-WS-C769-TBL) TO
083920             WS-769P-P1-BRANCH-NAME.
083930     MOVE WS-769P-P1 TO PRINTER1-RECORD.
083940     PERFORM 0600-WRITE-PRINTER1-RECORD.
083950*
083960   3300-CHECK-I663P-FILE.
083970     PERFORM 3310-READ-I663P-FILE
083980       WITH TEST BEFORE
083990       UNTIL END-I663P-FILE
084000             OR (I663P-BC NOT LESS WS-IPARM-BC).
084010     IF (NOT END-I663P-FILE)
084020         AND (I663P-BC EQUAL WS-IPARM-BC)
084030       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
084040       MOVE '663C FILE: ' TO WS-FILE-HD-FILE-NBR
084050       MOVE 'INVOICE SPECIAL MESSAGES' TO WS-FILE-HD-FILE-NAME
084060       PERFORM 3320-REPORT-I663P-RECORD
084070         WITH TEST AFTER
084080         UNTIL END-I663P-FILE
084090               OR (I663P-BC GREATER WS-IPARM-BC).
084100*
084110   3310-READ-I663P-FILE.
084120     READ I663P-FILE
084130       AT END
084140         MOVE 'E' TO WS-I663P-FILE-FLAG
084150       NOT AT END
084160         IF I663P-BC NOT LESS WS-I663P-BC
084170           MOVE I663P-BC TO WS-I663P-BC
084180         ELSE
084190           DISPLAY '* I663P SEQUENCE ERROR "' WS-I663P-BC '" "'
084200                 I663P-BC '" *' UPON SYSOUT
084210           GO TO 9900-DISPLAY-ABORT
084220         END-IF
084230       END-READ.
084240*
084250   3320-REPORT-I663P-RECORD.
084260     IF PRINT-COLUMN-HEAD
084270       MOVE +3 TO WS-LINES-NEEDED
084280     ELSE
084290       MOVE +1 TO WS-LINES-NEEDED.
084300     PERFORM 0500-CHECK-FOR-HEADINGS.
084310     IF PRINT-COLUMN-HEAD
084320       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
084330       MOVE WS-663P-C1 TO PRINTER1-RECORD
084340       PERFORM 0600-WRITE-PRINTER1-RECORD
084350       MOVE WS-663P-D1 TO PRINTER1-RECORD
084360       PERFORM 0600-WRITE-PRINTER1-RECORD.
084370     MOVE I663P-BC TO WS-663P-P1-BC.
084380     MOVE I663P-PRI-BR TO WS-663P-P1-PRI-BR.
084390     MOVE I663P-SEC-BR TO WS-663P-P1-SEC-BR.
084400     MOVE I663P-BILL-TYPE TO WS-663P-P1-BILL-TYPE.
084410     MOVE I663P-SEP-INV-CD TO WS-663P-P1-SEP-INV-CD.
084420     MOVE I663P-MSG-TYPE TO WS-663P-P1-MSG-TYP.
084430     MOVE I663P-LINE-SEQ TO WS-663P-P1-LINE-SEQ.
084440     MOVE I663P-MESSAGE TO WS-663P-P1-MESSAGE.
084450     MOVE WS-663P-P1 TO PRINTER1-RECORD.
084460     PERFORM 0600-WRITE-PRINTER1-RECORD.
084470     PERFORM 3310-READ-I663P-FILE.
084480*
084490   3400-CHECK-I660P-FILE.
084500     PERFORM 3410-READ-I660P-FILE
084510       WITH TEST BEFORE
084520       UNTIL END-I660P-FILE
084530             OR (I660P-BC NOT LESS WS-IPARM-BC).
084540     IF (NOT END-I660P-FILE)
084550         AND (I660P-BC EQUAL WS-IPARM-BC)
084560       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
084570       MOVE '660C FILE: ' TO WS-FILE-HD-FILE-NBR
084580       MOVE 'DEBIT / ORDER DETAIL INSTRUCTIONS' TO
084590             WS-FILE-HD-FILE-NAME
084600       PERFORM 3420-REPORT-I660P-RECORD
084610         WITH TEST AFTER
084620         UNTIL END-I660P-FILE
084630               OR (I660P-BC GREATER WS-IPARM-BC).
084640*
084650   3410-READ-I660P-FILE.
084660     READ I660P-FILE
084670       AT END
084680         MOVE 'E' TO WS-I660P-FILE-FLAG
084690       NOT AT END
084700         IF I660P-BC NOT LESS WS-I660P-BC
084710           MOVE I660P-BC TO WS-I660P-BC
084720         ELSE
084730           DISPLAY '* I660P SEQUENCE ERROR "' WS-I660P-BC '" "'
084740                 I660P-BC '" *' UPON SYSOUT
084750           GO TO 9900-DISPLAY-ABORT
084760         END-IF
084770       END-READ.
084780*
084790   3420-REPORT-I660P-RECORD.
084800     IF PRINT-COLUMN-HEAD
084810       MOVE +3 TO WS-LINES-NEEDED
084820     ELSE
084830       MOVE +1 TO WS-LINES-NEEDED.
084840     PERFORM 0500-CHECK-FOR-HEADINGS.
084850     IF PRINT-COLUMN-HEAD
084860       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
084870       MOVE WS-660P-C1 TO PRINTER1-RECORD
084880       PERFORM 0600-WRITE-PRINTER1-RECORD
084890       MOVE WS-660P-D1 TO PRINTER1-RECORD
084900       PERFORM 0600-WRITE-PRINTER1-RECORD.
084910     MOVE I660P-BC TO WS-660P-P1-BC.
084920     MOVE I660P-MATCH-PRI-BR TO WS-660P-P1-M-PRI-BR.
084930     MOVE I660P-MATCH-SEC-BR TO WS-660P-P1-M-SEC-BR.
084940     MOVE I660P-MATCH-BILL-TYPE TO WS-660P-P1-M-BILL-TYPE.
084950     MOVE I660P-MATCH-BILL-MED TO WS-660P-P1-M-BILL-MED.
084960     MOVE I660P-MATCH-PROD-CODE TO WS-660P-P1-M-PROD-CODE.
084970     MOVE I660P-MATCH-SEP-INV-CD TO WS-660P-P1-M-SEP-INV-CD.
084980     MOVE I660P-MATCH-CREDIT-FLG TO WS-660P-P1-M-CREDIT-FLG.
084990     MOVE I660P-ORD-DTL-PRT-FLG TO WS-660P-P1-ORD-PRT-FLG.
085000     MOVE I660P-EXTRA-WORK-FLAG TO WS-660P-P1-XW-FLAG.
085010     MOVE I660P-SEQ-NBR TO WS-660P-P1-SEQ-NBR.
085020     MOVE WS-660P-P1 TO PRINTER1-RECORD.
085030     PERFORM 0600-WRITE-PRINTER1-RECORD.
085040     PERFORM 3410-READ-I660P-FILE.
085050*
085060   3500-CHECK-I662P-FILE.
085070     PERFORM 3510-READ-I662P-FILE
085080       WITH TEST BEFORE
085090       UNTIL END-I662P-FILE
085100             OR (I662P-BC NOT LESS WS-IPARM-BC).
085110     IF (NOT END-I662P-FILE)
085120         AND (I662P-BC EQUAL WS-IPARM-BC)
085130       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
085140       MOVE '662C FILE: ' TO WS-FILE-HD-FILE-NBR
085150       MOVE 'EXPENSE CODE DESCRIPTIONS' TO WS-FILE-HD-FILE-NAME
085160       PERFORM 3520-REPORT-I662P-RECORD
085170         WITH TEST AFTER
085180         UNTIL END-I662P-FILE
085190               OR (I662P-BC GREATER WS-IPARM-BC).
085200*
085210   3510-READ-I662P-FILE.
085220     READ I662P-FILE
085230       AT END
085240         MOVE 'E' TO WS-I662P-FILE-FLAG
085250       NOT AT END
085260         IF I662P-BC NOT LESS WS-I662P-BC
085270           MOVE I662P-BC TO WS-I662P-BC
085280         ELSE
085290           DISPLAY '* I662P SEQUENCE ERROR "' WS-I662P-BC '" "'
085300                 I662P-BC '" *' UPON SYSOUT
085310           GO TO 9900-DISPLAY-ABORT
085320         END-IF
085330       END-READ.
085340*
085350   3520-REPORT-I662P-RECORD.
085360     IF PRINT-COLUMN-HEAD
085370       MOVE +3 TO WS-LINES-NEEDED
085380     ELSE
085390       MOVE +1 TO WS-LINES-NEEDED.
085400     PERFORM 0500-CHECK-FOR-HEADINGS.
085410     IF PRINT-COLUMN-HEAD
085420       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
085430       MOVE WS-662P-C1 TO PRINTER1-RECORD
085440       PERFORM 0600-WRITE-PRINTER1-RECORD
085450       MOVE WS-662P-D1 TO PRINTER1-RECORD
085460       PERFORM 0600-WRITE-PRINTER1-RECORD.
085470     MOVE I662P-BC TO WS-662P-P1-BC.
085480     MOVE I662P-PRI-BR TO WS-662P-P1-PRI-BR.
085490     MOVE I662P-SEC-BR TO WS-662P-P1-SEC-BR.
085500     MOVE I662P-BILL-TYPE TO WS-662P-P1-BILL-TYPE.
085510     MOVE I662P-EXP-CODE TO WS-662P-P1-EXP-CODE.
085520     MOVE I662P-EXP-CODE-DESCR TO WS-662P-P1-EXP-CD-DESCR.
085530     MOVE WS-662P-P1 TO PRINTER1-RECORD.
085540     PERFORM 0600-WRITE-PRINTER1-RECORD.
085550     IF (SPACE EQUAL I662P-PRI-BR AND
085560           I662P-SEC-BR AND I662P-BILL-TYPE)
085570         AND (I662P-EXP-CODE (1:1) NOT EQUAL '*')
085580         AND (I662P-EXP-CODE (2:1) NOT EQUAL '*')
085590         AND (WS-662P-BC-ENT-CT LESS 300)
085600       ADD 1 TO WS-662P-BC-ENT-CT
085610       MOVE I662P-EXP-CODE TO
085620             WS-662P-BC-TBL-EXP-CD (WS-662P-BC-ENT-CT)
085630       MOVE I662P-EXP-CODE-DESCR TO
085640             WS-662P-BC-TBL-DESCR (WS-662P-BC-ENT-CT).
085650     PERFORM 3510-READ-I662P-FILE.
085660*
085670   3600-CHECK-I1122P-FILE.
085680     PERFORM 3610-READ-I1122P-FILE
085690       WITH TEST BEFORE
085700       UNTIL END-I1122P-FILE
085710             OR (I1122P-BC NOT LESS WS-IPARM-BC).
085720     IF (NOT END-I1122P-FILE)
085730         AND (I1122P-BC EQUAL WS-IPARM-BC)
085740       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
085750       MOVE '1122C FILE:' TO WS-FILE-HD-FILE-NBR
085760       MOVE 'INSTITUTIONS NOT WANTING PRODUCT DETAIL' TO
085770             WS-FILE-HD-FILE-NAME
085780       PERFORM 3620-REPORT-I1122P-RECORD
085790         WITH TEST AFTER
085800         UNTIL END-I1122P-FILE
085810               OR (I1122P-BC GREATER WS-IPARM-BC).
085820*
085830   3610-READ-I1122P-FILE.
085840     READ I1122P-FILE
085850       AT END
085860         MOVE 'E' TO WS-I1122P-FILE-FLAG
085870       NOT AT END
085880         IF I1122P-BC NOT LESS WS-I1122P-BC
085890           MOVE I1122P-BC TO WS-I1122P-BC
085900         ELSE
085910           DISPLAY '* I1122P SEQUENCE ERROR "' WS-I1122P-BC '" "'
085920                 I1122P-BC '" *' UPON SYSOUT
085930           GO TO 9900-DISPLAY-ABORT
085940         END-IF
085950       END-READ.
085960*
085970   3620-REPORT-I1122P-RECORD.
085980     IF PRINT-COLUMN-HEAD
085990       MOVE +3 TO WS-LINES-NEEDED
086000     ELSE
086010       MOVE +1 TO WS-LINES-NEEDED.
086020     PERFORM 0500-CHECK-FOR-HEADINGS.
086030     IF PRINT-COLUMN-HEAD
086040       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
086050       MOVE WS-1122P-C1 TO PRINTER1-RECORD
086060       PERFORM 0600-WRITE-PRINTER1-RECORD
086070       MOVE WS-1122P-D1 TO PRINTER1-RECORD
086080       PERFORM 0600-WRITE-PRINTER1-RECORD.
086090     MOVE I1122P-BC TO WS-1122P-P1-BC.
086100     MOVE I1122P-PRI-BR TO WS-1122P-P1-PRI-BR.
086110     MOVE I1122P-SEC-BR TO WS-1122P-P1-SEC-BR.
086120     MOVE I1122P-BILL-TYPE TO WS-1122P-P1-BILL-TYPE.
086130     MOVE I1122P-SEP-INV-CD TO WS-1122P-P1-SEP-INV-CD.
086140     MOVE WS-1122P-P1 TO PRINTER1-RECORD.
086150     PERFORM 0600-WRITE-PRINTER1-RECORD.
086160     PERFORM 3610-READ-I1122P-FILE.
086170*
086180*
086190   3800-CHECK-575-TABLE.
086200     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
086210     MOVE SPACE TO WS-PREV-RECORD-TYPE.
086220     MOVE '575 FILE:  ' TO WS-FILE-HD-FILE-NBR.
086230     MOVE 'NACHA PARAMETERS FILE' TO WS-FILE-HD-FILE-NAME.
086240     SET IX-WS-575-TBL IX-WS-NACHA-CODE-CURR TO +1.
086250     PERFORM
086260         WITH TEST AFTER
086270         UNTIL IX-WS-NACHA-CODE-CURR NOT LESS
086280               IX-WS-NACHA-CODE-EMPTY
086290       MOVE WS-TBL-NACHA-CODE (IX-WS-NACHA-CODE-CURR) TO
086300             WS-NACHA-CODE
086310       SET IX-WS-NACHA-CODE-CURR UP BY +1
086320       PERFORM
086330           WITH TEST BEFORE
086340           UNTIL (IX-WS-575-TBL GREATER WS-575-ENTRY-COUNT)
086350               OR (WS-575-TBL-NACHA-CODE (IX-WS-575-TBL)
086360                     GREATER WS-NACHA-CODE)
086370         IF (WS-575-TBL-TAPE-CODE (IX-WS-575-TBL) EQUAL
086380               WS-NACHA-TAPE)
086390             AND (WS-575-TBL-BATCH-CODE (IX-WS-575-TBL) EQUAL
086400                   SPACE OR WS-NACHA-BATCH)
086410           MOVE WS-575-TBL-ENTRY (IX-WS-575-TBL) TO WS-575-REC
086420           IF WS-575-GENERAL-INFO
086430             PERFORM 3810-REPORT-I575-A-REC
086440           ELSE
086450             IF WS-575-COMMENT-INFO
086460               PERFORM 3820-REPORT-I575-B-REC
086470             ELSE
086480               IF WS-575-MAILING-INFO
086490                 PERFORM 3830-REPORT-I575-C-REC
086500               ELSE
086510                 IF WS-575-DETAIL-INFO
086520                   PERFORM 3840-REPORT-I575-D-REC
086530                 ELSE
086540                   IF WS-575-BATCH-INFO
086550                     PERFORM 3850-REPORT-I575-E-REC
086560                   ELSE
086570                     PERFORM 3860-REPORT-I575-F-REC
086580                   END-IF
086590                 END-IF
086600               END-IF
086610             END-IF
086620           END-IF
086630           PERFORM 0600-WRITE-PRINTER1-RECORD
086640         END-IF
086650         SET IX-WS-575-TBL UP BY 1
086660       END-PERFORM
086670     END-PERFORM.
086680*
086690   3810-REPORT-I575-A-REC.
086700     IF WS-PREV-RECORD-TYPE NOT EQUAL SPACE AND 'A'
086710       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
086720       MOVE +4 TO WS-LINES-NEEDED
086730     ELSE
086740       IF PRINT-COLUMN-HEAD
086750         MOVE +3 TO WS-LINES-NEEDED
086760       ELSE
086770         MOVE +1 TO WS-LINES-NEEDED.
086780     PERFORM 0500-CHECK-FOR-HEADINGS.
086790     IF PRINT-COLUMN-HEAD
086800       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
086810       IF WS-LINE-COUNT GREATER +5
086820         MOVE +2 TO WS-LINE-SPACER
086830       END-IF
086840       MOVE WS-575-C1 TO PRINTER1-RECORD
086850       PERFORM 0600-WRITE-PRINTER1-RECORD
086860       MOVE +1 TO WS-LINE-SPACER
086870       MOVE WS-575-D1 TO PRINTER1-RECORD
086880       PERFORM 0600-WRITE-PRINTER1-RECORD.
086890     MOVE WS-575-NACHA-CODE TO WS-575-P1-NACHA-CODE.
086900     MOVE WS-575-PRI-BR TO WS-575-P1-PRI-BR.
086910     MOVE WS-575-SEC-BR TO WS-575-P1-SEC-BR.
086920     MOVE WS-575-BILLING-TYPE TO WS-575-P1-BILLING-TYPE.
086930     MOVE WS-575-RECORD-TYPE TO WS-575-P1-RECORD-TYPE.
086940     MOVE WS-575-RECORD-NUMBER TO WS-575-P1-RECORD-NUMBER.
086950     MOVE WS-575-A-RUN-CODE TO WS-575-P1-RUN-CODE.
086960     MOVE WS-575-A-TAPE-TYPE TO WS-575-P1-TAPE-TYPE.
086970     MOVE WS-575-A-MERGE-REGION TO WS-575-P1-MERGE-REGION.
086980     MOVE WS-575-A-MERGE-NUMBER TO WS-575-P1-MERGE-NUMBER.
086990     MOVE WS-575-A-RPT-DETAIL-OPT TO WS-575-P1-RPT-DETAIL-OPT.
087000     MOVE WS-575-A-RPT-SUBTOT-OPT TO WS-575-P1-RPT-SUBTOT-OPT.
087010     MOVE WS-575-A-DUP-RPT-OPT TO WS-575-P1-DUP-RPT-OPT.
087020     MOVE WS-575-A-ZERO-AMT-OPT TO WS-575-P1-ZERO-AMT-OPT.
087030     MOVE WS-575-A-PRIORITY-CD TO WS-575-P1-PRIORITY-CD.
087040     MOVE WS-575-A-DEST-ID TO WS-575-P1-DEST-ID.
087050     MOVE WS-575-A-ORIGIN-ID TO WS-575-P1-ORIGIN-ID.
087060     MOVE WS-575-A-TRANS-DATE-OPT TO WS-575-P1-TRANS-DATE-OPT.
087070     MOVE WS-575-A-TRANS-TIME-OPT TO WS-575-P1-TRANS-TIME-OPT.
087080     MOVE WS-575-A-FILE-ID-MOD TO WS-575-P1-FILE-ID-MOD.
087090     MOVE WS-575-A-FORMAT-CODE TO WS-575-P1-FORMAT-CODE.
087100     MOVE WS-575-A-DEST-NAME TO WS-575-P1-DEST-NAME.
087110     MOVE WS-575-A-ORIGIN-NAME TO WS-575-P1-ORIGIN-NAME.
087120     MOVE WS-575-A-REF-CODE TO WS-575-P1-REF-CODE.
087130     MOVE WS-575-A-SPL-EFF-DATE-OPT TO WS-575-P1-SPL-EFF-DT-OPT.
087140     MOVE WS-575-A-PADDING-FALG TO WS-575-P1-PADDING-FALG.
087150     MOVE WS-575-P1 TO PRINTER1-RECORD.
087160     MOVE 'A' TO WS-PREV-RECORD-TYPE.
087170*
087180   3820-REPORT-I575-B-REC.
087190     IF WS-PREV-RECORD-TYPE NOT EQUAL 'B'
087200       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
087210       MOVE +4 TO WS-LINES-NEEDED
087220     ELSE
087230       IF PRINT-COLUMN-HEAD
087240         MOVE +3 TO WS-LINES-NEEDED
087250       ELSE
087260         MOVE +1 TO WS-LINES-NEEDED.
087270     PERFORM 0500-CHECK-FOR-HEADINGS.
087280     IF PRINT-COLUMN-HEAD
087290       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
087300       IF WS-LINE-COUNT GREATER +3
087310         MOVE +2 TO WS-LINE-SPACER
087320       END-IF
087330       MOVE WS-575-C2 TO PRINTER1-RECORD
087340       PERFORM 0600-WRITE-PRINTER1-RECORD
087350       MOVE +1 TO WS-LINE-SPACER
087360       MOVE WS-575-D2 TO PRINTER1-RECORD
087370       PERFORM 0600-WRITE-PRINTER1-RECORD.
087380     MOVE WS-575-NACHA-CODE TO WS-575-P2-NACHA-CODE.
087390     MOVE WS-575-PRI-BR TO WS-575-P2-PRI-BR.
087400     MOVE WS-575-SEC-BR TO WS-575-P2-SEC-BR.
087410     MOVE WS-575-BILLING-TYPE TO WS-575-P2-BILLING-TYPE.
087420     MOVE WS-575-RECORD-TYPE TO WS-575-P2-RECORD-TYPE.
087430     MOVE WS-575-RECORD-NUMBER TO WS-575-P2-RECORD-NUMBER.
087440     MOVE WS-575-B-COMMENT TO WS-575-P2-COMMENT.
087450     MOVE WS-575-P2 TO PRINTER1-RECORD.
087460     MOVE 'B' TO WS-PREV-RECORD-TYPE.
087470*
087480   3830-REPORT-I575-C-REC.
087490     IF WS-PREV-RECORD-TYPE NOT EQUAL 'C'
087500       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
087510       MOVE +4 TO WS-LINES-NEEDED
087520     ELSE
087530       IF PRINT-COLUMN-HEAD
087540         MOVE +3 TO WS-LINES-NEEDED
087550       ELSE
087560         MOVE +1 TO WS-LINES-NEEDED.
087570     PERFORM 0500-CHECK-FOR-HEADINGS.
087580     IF PRINT-COLUMN-HEAD
087590       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
087600       IF WS-LINE-COUNT GREATER +3
087610         MOVE +2 TO WS-LINE-SPACER
087620       END-IF
087630       MOVE WS-575-C3 TO PRINTER1-RECORD
087640       PERFORM 0600-WRITE-PRINTER1-RECORD
087650       MOVE +1 TO WS-LINE-SPACER
087660       MOVE WS-575-D3 TO PRINTER1-RECORD
087670       PERFORM 0600-WRITE-PRINTER1-RECORD.
087680     MOVE WS-575-NACHA-CODE TO WS-575-P3-NACHA-CODE.
087690     MOVE WS-575-PRI-BR TO WS-575-P3-PRI-BR.
087700     MOVE WS-575-SEC-BR TO WS-575-P3-SEC-BR.
087710     MOVE WS-575-BILLING-TYPE TO WS-575-P3-BILLING-TYPE.
087720     MOVE WS-575-RECORD-TYPE TO WS-575-P3-RECORD-TYPE.
087730     MOVE WS-575-RECORD-NUMBER TO WS-575-P3-RECORD-NUMBER.
087740     MOVE WS-575-C-MAIL-LN-1-4 TO WS-575-P3-MAIL-LN-1-4.
087750     MOVE WS-575-C-MAIL-LN-2-5 TO WS-575-P3-MAIL-LN-2-5.
087760     MOVE WS-575-C-MAIL-LN-3-6 TO WS-575-P3-MAIL-LN-3-6.
087770     MOVE WS-575-P3 TO PRINTER1-RECORD.
087780     MOVE 'C' TO WS-PREV-RECORD-TYPE.
087790*
087800   3840-REPORT-I575-D-REC.
087810     IF WS-PREV-RECORD-TYPE NOT EQUAL 'D'
087820       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
087830       MOVE +5 TO WS-LINES-NEEDED
087840     ELSE
087850       IF PRINT-COLUMN-HEAD
087860         MOVE +4 TO WS-LINES-NEEDED
087870       ELSE
087880         MOVE +1 TO WS-LINES-NEEDED.
087890     PERFORM 0500-CHECK-FOR-HEADINGS.
087900     IF PRINT-COLUMN-HEAD
087910       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
087920       IF WS-LINE-COUNT GREATER +3
087930         MOVE +2 TO WS-LINE-SPACER
087940       END-IF
087950       MOVE WS-575-C4A TO PRINTER1-RECORD
087960       PERFORM 0600-WRITE-PRINTER1-RECORD
087970       MOVE +1 TO WS-LINE-SPACER
087980       MOVE WS-575-C4B TO PRINTER1-RECORD
087990       PERFORM 0600-WRITE-PRINTER1-RECORD
088000       MOVE WS-575-D4 TO PRINTER1-RECORD
088010       PERFORM 0600-WRITE-PRINTER1-RECORD.
088020     MOVE WS-575-NACHA-CODE TO WS-575-P4-NACHA-CODE.
088030     MOVE WS-575-PRI-BR TO WS-575-P4-PRI-BR.
088040     MOVE WS-575-SEC-BR TO WS-575-P4-SEC-BR.
088050     MOVE WS-575-BILLING-TYPE TO WS-575-P4-BILLING-TYPE.
088060     MOVE WS-575-RECORD-TYPE TO WS-575-P4-RECORD-TYPE.
088070     MOVE WS-575-RECORD-NUMBER TO WS-575-P4-RECORD-NUMBER.
088080     MOVE WS-575-D-PROD-CD-OPT TO WS-575-P4-PROD-CD-OPT.
088090     MOVE WS-575-D-PROC-AMT-OPT TO WS-575-P4-PROC-AMT-OPT.
088100     MOVE WS-575-D-BILL-DR-TC TO WS-575-P4-BILL-DR-TC.
088110     MOVE WS-575-D-BILL-CR-TC TO WS-575-P4-BILL-CR-TC.
088120     MOVE WS-575-D-BILL-0-TC TO WS-575-P4-BILL-0-TC.
088130     MOVE WS-575-D-PRE-N-DR-TC TO WS-575-P4-PRE-N-DR-TC.
088140     MOVE WS-575-D-PRE-N-CR-TC TO WS-575-P4-PRE-N-CR-TC.
088150     MOVE WS-575-D-PRE-N-0-TC TO WS-575-P4-PRE-N-0-TC.
088160     MOVE WS-575-D-FORCED-BC TO WS-575-P4-FORCED-BC.
088170     MOVE WS-575-D-ACCT-OPT TO WS-575-P4-ACCT-OPT.
088180     MOVE WS-575-D-SPL-REC-DEF TO WS-575-P4-SPL-REC-DEF.
088190     MOVE WS-575-D-IND-ID-OPT TO WS-575-P4-IND-ID-OPT.
088200     MOVE WS-575-D-IND-ID-DATA TO WS-575-P4-IND-ID-DATA.
088210     MOVE WS-575-D-IND-NAME-OPT TO WS-575-P4-IND-NAME-OPT.
088220     MOVE WS-575-D-IND-NAME-DATA TO WS-575-P4-IND-NAME-DATA.
088230     MOVE WS-575-D-DSCR-DATA-OPT TO WS-575-P4-DSCR-DATA-OPT.
088240     MOVE WS-575-D-DSCR-DATA TO WS-575-P4-DSCR-DATA.
088250     MOVE WS-575-D-ACCT-CONSTANT TO WS-575-P4-ACCT-CONSTANT.
088260     MOVE WS-575-D-ADDENDA-OPT TO WS-575-P4-ADDENDA-OPT.
088270     MOVE WS-575-D-ZERO-DTL-OPT TO WS-575-P4-ZERO-DTL-OPT.
088280     MOVE WS-575-D-SAV-TC-OPT TO WS-575-P4-SAV-TC-OPT.
088290     MOVE WS-575-D-RSL-SUM-OPT TO WS-575-P4-RSL-SUM-OPT.
088300     MOVE WS-575-D-EXP-SUM-OPT TO WS-575-P4-EXP-SUM-OPT.
088310     MOVE WS-575-D-TC-OVR-SCOPE TO WS-575-P4-TC-OVR-SCOPE.
088320     MOVE WS-575-D-BC-OVR-SCOPE TO WS-575-P4-BC-OVR-SCOPE.
088330     MOVE WS-575-P4 TO PRINTER1-RECORD.
088340     MOVE 'D' TO WS-PREV-RECORD-TYPE.
088350*
088360   3850-REPORT-I575-E-REC.
088370     IF WS-PREV-RECORD-TYPE NOT EQUAL 'E'
088380       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
088390       MOVE +5 TO WS-LINES-NEEDED
088400     ELSE
088410       IF PRINT-COLUMN-HEAD
088420         MOVE +4 TO WS-LINES-NEEDED
088430       ELSE
088440         MOVE +1 TO WS-LINES-NEEDED.
088450     IF WS-575-E-OVERFLOW NOT EQUAL SPACES
088460       ADD 3 TO WS-LINES-NEEDED.
088470     PERFORM 0500-CHECK-FOR-HEADINGS.
088480     IF PRINT-COLUMN-HEAD
088490       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
088500       IF WS-LINE-COUNT GREATER +3
088510         MOVE +2 TO WS-LINE-SPACER
088520       END-IF
088530       MOVE WS-575-C5A TO PRINTER1-RECORD
088540       PERFORM 0600-WRITE-PRINTER1-RECORD
088550       MOVE +1 TO WS-LINE-SPACER
088560       MOVE WS-575-C5B TO PRINTER1-RECORD
088570       PERFORM 0600-WRITE-PRINTER1-RECORD
088580       MOVE WS-575-D5 TO PRINTER1-RECORD
088590       PERFORM 0600-WRITE-PRINTER1-RECORD.
088600     MOVE WS-575-NACHA-CODE TO WS-575-P5-NACHA-CODE.
088610     MOVE WS-575-PRI-BR TO WS-575-P5-PRI-BR.
088620     MOVE WS-575-SEC-BR TO WS-575-P5-SEC-BR.
088630     MOVE WS-575-BILLING-TYPE TO WS-575-P5-BILLING-TYPE.
088640     MOVE WS-575-RECORD-TYPE TO WS-575-P5-RECORD-TYPE.
088650     MOVE WS-575-RECORD-NUMBER TO WS-575-P5-RECORD-NUMBER.
088660     MOVE WS-575-E-BATCH-PRT-OPT TO WS-575-P5-BATCH-PRT-OPT.
088670     MOVE WS-575-E-BATCH-NAME TO WS-575-P5-BATCH-NAME.
088680     MOVE WS-575-E-SERVICE-CLASS TO WS-575-P5-SERVICE-CLASS.
088690     MOVE WS-575-E-COMPANY-NAME TO WS-575-P5-COMPANY-NAME.
088700     MOVE WS-575-E-CO-DSCR-DATA TO WS-575-P5-CO-DSCR-DATA.
088710     MOVE WS-575-E-COMPANY-ID TO WS-575-P5-COMPANY-ID.
088720     MOVE WS-575-E-STD-ENT-CLASS TO WS-575-P5-STD-ENT-CLASS.
088730     MOVE WS-575-E-ENTRY-DESCR TO WS-575-P5-ENTRY-DESCR.
088740     MOVE WS-575-E-DESCR-DT-OPT TO WS-575-P5-DESCR-DT-OPT.
088750     MOVE WS-575-E-EFF-DT-OPT TO WS-575-P5-EFF-DT-OPT.
088760     MOVE WS-575-E-ORIG-ST-CD TO WS-575-P5-ORIG-ST-CD.
088770     MOVE WS-575-E-ORIG-DFI-ID TO WS-575-P5-ORIG-DFI-ID.
088780     MOVE WS-575-E-BATCH-NBR-CNS TO WS-575-P5-BATCH-NBR-CNS.
088790     MOVE WS-575-E-GL-BTCH-OPT TO WS-575-P5-GL-BTCH-OPT.
088800     MOVE WS-575-E-SPL-TRLR-OPT TO WS-575-P5-SPL-TRLR-OPT.
088810     MOVE WS-575-P5 TO PRINTER1-RECORD.
088820     IF WS-575-E-OVERFLOW EQUAL SPACES
088830       MOVE 'E' TO WS-PREV-RECORD-TYPE
088840     ELSE
088850       PERFORM 0600-WRITE-PRINTER1-RECORD
088860       MOVE WS-575-E-TRACE-BC-OVER TO WS-575-P5-TRACE-BC-OVER
088870       MOVE WS-575-E-TRACE-SEQ-OPT TO WS-575-P5-TRACE-SEQ-OPT
088880       MOVE WS-575-E-TRACE-SEQ-CNS TO WS-575-P5-TRACE-SEQ-CNS
088890       MOVE WS-575-C5X TO PRINTER1-RECORD
088900       PERFORM 0600-WRITE-PRINTER1-RECORD
088910       MOVE WS-575-D5X TO PRINTER1-RECORD
088920       PERFORM 0600-WRITE-PRINTER1-RECORD
088930       MOVE WS-575-P5X TO PRINTER1-RECORD
088940       MOVE 'X' TO WS-PREV-RECORD-TYPE.
088950*
088960   3860-REPORT-I575-F-REC.
088970     IF WS-PREV-RECORD-TYPE NOT EQUAL 'F'
088980       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
088990       MOVE +5 TO WS-LINES-NEEDED
089000     ELSE
089010       IF PRINT-COLUMN-HEAD
089020         MOVE +4 TO WS-LINES-NEEDED
089030       ELSE
089040         MOVE +1 TO WS-LINES-NEEDED.
089050     IF WS-575-F-ACCT-FMT-WTS NOT EQUAL SPACE
089060       ADD 1 TO WS-LINES-NEEDED.
089070     PERFORM 0500-CHECK-FOR-HEADINGS.
089080     IF PRINT-COLUMN-HEAD
089090       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
089100       IF WS-LINE-COUNT GREATER +3
089110         MOVE +2 TO WS-LINE-SPACER
089120       END-IF
089130       MOVE WS-575-C6A TO PRINTER1-RECORD
089140       PERFORM 0600-WRITE-PRINTER1-RECORD
089150       MOVE +1 TO WS-LINE-SPACER
089160       MOVE WS-575-C6B TO PRINTER1-RECORD
089170       PERFORM 0600-WRITE-PRINTER1-RECORD
089180       MOVE WS-575-D6 TO PRINTER1-RECORD
089190       PERFORM 0600-WRITE-PRINTER1-RECORD.
089200     MOVE WS-575-NACHA-CODE TO WS-575-P6-NACHA-CODE.
089210     MOVE WS-575-PRI-BR TO WS-575-P6-PRI-BR.
089220     MOVE WS-575-SEC-BR TO WS-575-P6-SEC-BR.
089230     MOVE WS-575-BILLING-TYPE TO WS-575-P6-BILLING-TYPE.
089240     MOVE WS-575-RECORD-TYPE TO WS-575-P6-RECORD-TYPE.
089250     MOVE WS-575-RECORD-NUMBER TO WS-575-P6-RECORD-NUMBER.
089260     MOVE WS-575-F-NORM-DR-TC TO WS-575-P6-NORM-DR-TC.
089270     MOVE WS-575-F-NORM-CR-TC TO WS-575-P6-NORM-CR-TC.
089280     MOVE WS-575-F-NORM-0-TC TO WS-575-P6-NORM-0-TC.
089290     MOVE WS-575-F-PRE-N-DR-TC TO WS-575-P6-PRE-N-DR-TC.
089300     MOVE WS-575-F-PRE-N-CR-TC TO WS-575-P6-PRE-N-CR-TC.
089310     MOVE WS-575-F-PRE-N-0-TC TO WS-575-P6-PRE-N-0-TC.
089320     MOVE WS-575-F-BC TO WS-575-P6-BC.
089330     MOVE WS-575-F-ACCT-NBR TO WS-575-P6-ACCT-NBR.
089340     MOVE WS-575-F-AMT-OPT TO WS-575-P6-AMT-OPT.
089350     MOVE WS-575-F-IND-ID-DATA TO WS-575-P6-IND-ID-DATA.
089360     MOVE WS-575-F-IND-NAME-DATA TO WS-575-P6-IND-NAME-DATA.
089370     MOVE WS-575-F-DSCR-DATA TO WS-575-P6-DSCR-DATA.
089380     MOVE WS-575-F-DEFER-FLG TO WS-575-P6-DEFER-FLG.
089390     MOVE WS-575-F-DIR-DEP-FLG TO WS-575-P6-DIR-DEP-FLG.
089400     MOVE WS-575-F-EACH-BR-FLG TO WS-575-P6-EACH-BR-FLG.
089410     MOVE WS-575-F-ACCT-CALC-FMLA TO WS-575-P6-ACCT-CALC-FMLA.
089420     MOVE WS-575-P6 TO PRINTER1-RECORD.
089430     IF WS-575-F-ACCT-FMT-WTS NOT EQUAL SPACE
089440       PERFORM 0600-WRITE-PRINTER1-RECORD
089450       MOVE SPACE TO WS-575-P6
089460       MOVE WS-575-F-ACCT-FMT-WTS TO WS-575-P6-ACCT-NBR
089470       MOVE WS-575-P6 TO PRINTER1-RECORD.
089480     MOVE 'F' TO WS-PREV-RECORD-TYPE.
089490*
089500   3900-CHECK-I8950-FILE.
089510     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
089520     MOVE '8950 FILE: ' TO WS-FILE-HD-FILE-NBR.
089530     MOVE 'GL/ACH FILE' TO WS-FILE-HD-FILE-NAME.
089540     MOVE WS-IPARM-BC TO I8950-BC.
089550     MOVE LOW-VALUES TO I8950-RECORD-TYPE
089560                        I8950-SEQUENCE-NUMBER.
089570     START I8950-FILE KEY NOT LESS I8950-KEY.
089580     IF WS-I8950-SUCCESSFUL
089590       PERFORM 3910-READ-I8950-FILE-NEXT
089600     ELSE
089610       IF (NOT WS-I8950-NO-SUCH-RECORD)
089620           AND (NOT WS-I8950-END-OF-FILE)
089630         DISPLAY '* VSAM ERROR ON I8950 START FOR BC "'
089640               WS-IPARM-BC '".  FILE STATUS = '
089650               WS-I8950-FILE-STATUS '. *' UPON SYSOUT
089660         GO TO 9900-DISPLAY-ABORT.
089670     PERFORM 3920-REPORT-I8950-RECORD
089680         WITH TEST BEFORE
089690         UNTIL (NOT WS-I8950-SUCCESSFUL)
089700             OR (I8950-BC NOT EQUAL WS-IPARM-BC).
089710*
089720   3910-READ-I8950-FILE-NEXT.
089730     READ I8950-FILE NEXT RECORD.
089740     IF (NOT WS-I8950-SUCCESSFUL)
089750         AND (NOT WS-I8950-END-OF-FILE)
089760       DISPLAY '* VSAM ERROR ON I8950 SEQUENTIAL READ.  FILE STATU
089770-            'S = ' WS-I8950-FILE-STATUS '. *' UPON SYSOUT
089780       GO TO 9900-DISPLAY-ABORT.
089790*
089800   3920-REPORT-I8950-RECORD.
089810     IF PRINT-COLUMN-HEAD
089820       MOVE +3 TO WS-LINES-NEEDED
089830     ELSE
089840       PERFORM 3921-CALCULATE-LINES-NEEDED.
089850     PERFORM 0500-CHECK-FOR-HEADINGS.
089860     IF PRINT-COLUMN-HEAD
089870       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
089880       MOVE WS-8950-C1 TO PRINTER1-RECORD
089890       PERFORM 0600-WRITE-PRINTER1-RECORD
089900       MOVE WS-8950-C2 TO PRINTER1-RECORD
089910       PERFORM 0600-WRITE-PRINTER1-RECORD
089920       MOVE WS-8950-D1 TO PRINTER1-RECORD
089930       PERFORM 0600-WRITE-PRINTER1-RECORD
089940       SET WS-NOT-FIRST-LINE TO TRUE
089950     ELSE
089960       MOVE +2 TO WS-LINE-SPACER
089970       SET WS-FIRST-LINE TO TRUE
089980     END-IF.
089990     EVALUATE TRUE
090000       WHEN I8950-8949-KEY-BY-BC
090010         MOVE I8950-BC TO WS-8950-P1-BC
090020       WHEN I8950-8949-KEY-BY-HC
090030         MOVE I8950-8949-KEY-HOLD-CO TO WS-8950-P1-HC
090040       WHEN I8950-8949-KEY-BY-BOTH
090050         MOVE I8950-8949-KEY-HOLD-CO TO WS-8950-P1-HC
090060         MOVE I8950-BC TO WS-8950-P1-BC
090070     END-EVALUATE.
090080     MOVE I8950-RECORD-TYPE TO WS-8950-P1-T.
090090     MOVE I8950-SEQUENCE-NUMBER TO WS-8950-P1-SEQ.
090100     MOVE I8950-UPCHARGE-USAGE-FLAG TO WS-8950-P1-UPC.
090110     MOVE I8950-REBATES-USAGE-FLAG TO WS-8950-P1-RBT.
090120     MOVE I8950-TAX-USAGE-FLAG TO WS-8950-P1-TAX.
090130     MOVE I8950-BRP-COMM-USAGE-FLAG TO WS-8950-P1-BRP.
090140     MOVE I8950-WAIVED-USAGE-FLAG TO WS-8950-P1-WVE.
090150     MOVE I8950-EXPENSE-USAGE-FLAG TO WS-8950-P1-EXP.
090160     MOVE I8950-RETAIL-USAGE-FLAG TO WS-8950-P1-RTL.
090170     MOVE I8950-MATCH-NACHA-CODE TO WS-8950-P1-M-NACHA.
090180     MOVE I8950-UPDATE-DATE TO WS-8950-P1-U-DATE.
090190     MOVE I8950-UPDATE-USER-ID TO WS-8950-P1-U-USER-ID.
090200     MOVE 'N' TO WS-INSTRUCTIONS-FLAG.
090210     MOVE 'N' TO WS-BRANCH-PRODUCT-E-FLAG.
090220     MOVE 'N' TO WS-BRANCH-PRODUCT-A-FLAG.
090230     MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG.
090240     MOVE ZEROES TO WS-BRANCH-PRODUCT-CTR.
090250     MOVE ZEROES TO WS-INSTRUCTIONS-CTR.
090260     EVALUATE I8950-RECORD-TYPE
090270       WHEN '1'
090280         PERFORM 3931-FMT-ASSIGNMENT-INSTR
090290               UNTIL END-INSTRUCTIONS
090300       WHEN '2'
090310         PERFORM 3932-FMT-DESC-OVERRIDE-INSTR
090320               UNTIL END-INSTRUCTIONS
090330       WHEN '3'
090340         PERFORM 3933-FMT-BATCH-HEADER-INSTR
090350               UNTIL END-INSTRUCTIONS
090360       WHEN '4'
090370         PERFORM 3934-FMT-SUMMARY-INSTR
090380               UNTIL END-INSTRUCTIONS
090390       WHEN '5'
090400         PERFORM 3935-FMT-BC-OVERRIDE-INSTR
090410               UNTIL END-INSTRUCTIONS
090420       WHEN '6'
090430         PERFORM 3936-FMT-SAVINGS-IDEN-INSTR
090440               UNTIL END-INSTRUCTIONS
090450     END-EVALUATE.
090460     PERFORM 3910-READ-I8950-FILE-NEXT.
090470*
090480   3921-CALCULATE-LINES-NEEDED.
090490     MOVE ZEROES TO WS-BRANCH-LINES-COUNT
090500                    WS-PRODUCT-LINES-COUNT
090510                    WS-INSTRUCTIONS-LINES-COUNT.
090520     IF I8950-1ST-LOW-PRI-BRANCH NOT EQUAL SPACES AND
090530        I8950-1ST-HIGH-PRI-BRANCH NOT EQUAL SPACES
090540        ADD 1 TO WS-BRANCH-LINES-COUNT
090550     END-IF.
090560     IF I8950-2ND-LOW-PRI-BRANCH NOT EQUAL SPACES AND
090570        I8950-2ND-HIGH-PRI-BRANCH NOT EQUAL SPACES
090580        ADD 1 TO WS-BRANCH-LINES-COUNT
090590     END-IF.
090600     IF I8950-3RD-LOW-PRI-BRANCH NOT EQUAL SPACES AND
090610        I8950-3RD-HIGH-PRI-BRANCH NOT EQUAL SPACES
090620        ADD 1 TO WS-BRANCH-LINES-COUNT
090630     END-IF.
090640     IF I8950-4TH-LOW-PRI-BRANCH NOT EQUAL SPACES AND
090650        I8950-4TH-HIGH-PRI-BRANCH NOT EQUAL SPACES
090660        ADD 1 TO WS-BRANCH-LINES-COUNT
090670     END-IF.
090680     IF I8950-5TH-LOW-PRI-BRANCH NOT EQUAL SPACES AND
090690        I8950-5TH-HIGH-PRI-BRANCH NOT EQUAL SPACES
090700        ADD 1 TO WS-BRANCH-LINES-COUNT
090710     END-IF.
090720     IF I8950-1ST-MATCH-PRODUCT EQUAL SPACES
090730        ADD 1 TO WS-PRODUCT-LINES-COUNT
090740     END-IF.
090750     IF I8950-2ND-MATCH-PRODUCT EQUAL SPACES
090760        ADD 1 TO WS-PRODUCT-LINES-COUNT
090770     END-IF.
090780     IF I8950-3RD-MATCH-PRODUCT EQUAL SPACES
090790        ADD 1 TO WS-PRODUCT-LINES-COUNT
090800     END-IF.
090810     IF I8950-4TH-MATCH-PRODUCT EQUAL SPACES
090820        ADD 1 TO WS-PRODUCT-LINES-COUNT
090830     END-IF.
090840     IF I8950-5TH-MATCH-PRODUCT EQUAL SPACES
090850        ADD 1 TO WS-PRODUCT-LINES-COUNT
090860     END-IF.
090870     IF I8950-6TH-MATCH-PRODUCT EQUAL SPACES
090880        ADD 1 TO WS-PRODUCT-LINES-COUNT
090890     END-IF.
090900     EVALUATE I8950-RECORD-TYPE
090910       WHEN '1'
090920         IF I8950-1-INSTRUCTIONS EQUAL SPACES
090930           ADD 1 TO WS-INSTRUCTIONS-LINES-COUNT
090940         ELSE
090950           ADD 3 TO WS-INSTRUCTIONS-LINES-COUNT
090960         END-IF
090970       WHEN '2'
090980         IF I8950-1-INSTRUCTIONS EQUAL SPACES
090990           ADD 1 TO WS-INSTRUCTIONS-LINES-COUNT
091000         ELSE
091010           ADD 4 TO WS-INSTRUCTIONS-LINES-COUNT
091020         END-IF
091030       WHEN '3'
091040         IF I8950-1-INSTRUCTIONS EQUAL SPACES
091050           ADD 1 TO WS-INSTRUCTIONS-LINES-COUNT
091060         ELSE
091070           ADD 4 TO WS-INSTRUCTIONS-LINES-COUNT
091080         END-IF
091090       WHEN '4'
091100         IF I8950-1-INSTRUCTIONS EQUAL SPACES
091110           ADD 1 TO WS-INSTRUCTIONS-LINES-COUNT
091120         ELSE
091130           ADD 5 TO WS-INSTRUCTIONS-LINES-COUNT
091140         END-IF
091150       WHEN '5'
091160         ADD 1 TO WS-INSTRUCTIONS-LINES-COUNT
091170       WHEN '6'
091180         ADD 1 TO WS-INSTRUCTIONS-LINES-COUNT
091190     END-EVALUATE.
091200     IF WS-BRANCH-LINES-COUNT EQUAL ZEROES AND
091210        WS-PRODUCT-LINES-COUNT EQUAL ZEROES AND
091220        WS-INSTRUCTIONS-LINES-COUNT EQUAL ZEROES
091230       MOVE 1 TO WS-LINES-NEEDED
091240     ELSE
091250       IF WS-BRANCH-LINES-COUNT > WS-PRODUCT-LINES-COUNT
091260         IF WS-BRANCH-LINES-COUNT > WS-INSTRUCTIONS-LINES-COUNT
091270           MOVE WS-BRANCH-LINES-COUNT TO WS-LINES-NEEDED
091280         ELSE
091290           MOVE WS-INSTRUCTIONS-LINES-COUNT TO WS-LINES-NEEDED
091300         END-IF
091310       ELSE
091320         IF WS-PRODUCT-LINES-COUNT > WS-INSTRUCTIONS-LINES-COUNT
091330           MOVE WS-PRODUCT-LINES-COUNT TO WS-LINES-NEEDED
091340         ELSE
091350           MOVE WS-INSTRUCTIONS-LINES-COUNT TO WS-LINES-NEEDED
091360         END-IF
091370       END-IF
091380     END-IF.
091390*
091400   3931-FMT-ASSIGNMENT-INSTR.
091410     PERFORM 3941-ASSIGNMENT-INSTRUCTIONS UNTIL
091420           INSTRUCTIONS-ASSIGNED OR WS-INSTRUCTIONS-CTR > 3.
091430     PERFORM 3980-BRANCH-PRODUCT-ASSIGNMENT.
091440     IF INSTRUCTIONS-ASSIGNED OR BRANCH-PRODUCT-ASSIGNED
091450       PERFORM 3990-WRITE-8950-REPORT-PARA
091460       MOVE SPACES TO WS-8950-P1
091470       MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG
091480                   WS-BRANCH-PRODUCT-A-FLAG
091490     ELSE
091500       IF WS-INSTRUCTIONS-CTR > 3 AND WS-BRANCH-PRODUCT-CTR = 1
091510         PERFORM 3990-WRITE-8950-REPORT-PARA
091520         MOVE SPACES TO WS-8950-P1
091530         SET END-INSTRUCTIONS TO TRUE
091540       ELSE
091550         IF WS-INSTRUCTIONS-CTR > 3 AND END-BRANCH-PRODUCT
091560           SET END-INSTRUCTIONS TO TRUE
091570         END-IF
091580       END-IF
091590     END-IF.
091600*
091610   3932-FMT-DESC-OVERRIDE-INSTR.
091620     PERFORM 3942-DESC-OVERRIDE-INSTR UNTIL
091630           INSTRUCTIONS-ASSIGNED OR WS-INSTRUCTIONS-CTR > 4.
091640     PERFORM 3980-BRANCH-PRODUCT-ASSIGNMENT.
091650     IF INSTRUCTIONS-ASSIGNED OR BRANCH-PRODUCT-ASSIGNED
091660       PERFORM 3990-WRITE-8950-REPORT-PARA
091670       MOVE SPACES TO WS-8950-P1
091680       MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG
091690                   WS-BRANCH-PRODUCT-A-FLAG
091700     ELSE
091710       IF WS-INSTRUCTIONS-CTR > 4 AND WS-BRANCH-PRODUCT-CTR = 1
091720         PERFORM 3990-WRITE-8950-REPORT-PARA
091730         MOVE SPACES TO WS-8950-P1
091740         SET END-INSTRUCTIONS TO TRUE
091750       ELSE
091760         IF WS-INSTRUCTIONS-CTR > 4 AND END-BRANCH-PRODUCT
091770           SET END-INSTRUCTIONS TO TRUE
091780         END-IF
091790       END-IF
091800     END-IF.
091810*
091820   3933-FMT-BATCH-HEADER-INSTR.
091830     PERFORM 3943-BATCH-HEADER-INSTRUCTIONS UNTIL
091840           INSTRUCTIONS-ASSIGNED OR WS-INSTRUCTIONS-CTR > 4.
091850     PERFORM 3980-BRANCH-PRODUCT-ASSIGNMENT.
091860     IF INSTRUCTIONS-ASSIGNED OR BRANCH-PRODUCT-ASSIGNED
091870       PERFORM 3990-WRITE-8950-REPORT-PARA
091880       MOVE SPACES TO WS-8950-P1
091890       MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG
091900                   WS-BRANCH-PRODUCT-A-FLAG
091910     ELSE
091920       IF WS-INSTRUCTIONS-CTR > 4 AND WS-BRANCH-PRODUCT-CTR = 1
091930         PERFORM 3990-WRITE-8950-REPORT-PARA
091940         MOVE SPACES TO WS-8950-P1
091950         SET END-INSTRUCTIONS TO TRUE
091960       ELSE
091970         IF WS-INSTRUCTIONS-CTR > 4 AND END-BRANCH-PRODUCT
091980           SET END-INSTRUCTIONS TO TRUE
091990         END-IF
092000       END-IF
092010     END-IF.
092020*
092030   3934-FMT-SUMMARY-INSTR.
092040     PERFORM 3944-SUMMARY-INSTRUCTIONS UNTIL
092050           INSTRUCTIONS-ASSIGNED OR WS-INSTRUCTIONS-CTR > 5.
092060     PERFORM 3980-BRANCH-PRODUCT-ASSIGNMENT.
092070     IF INSTRUCTIONS-ASSIGNED OR BRANCH-PRODUCT-ASSIGNED
092080       PERFORM 3990-WRITE-8950-REPORT-PARA
092090       MOVE SPACES TO WS-8950-P1
092100       MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG
092110                   WS-BRANCH-PRODUCT-A-FLAG
092120     ELSE
092130       IF WS-INSTRUCTIONS-CTR > 5 AND WS-BRANCH-PRODUCT-CTR = 1
092140         PERFORM 3990-WRITE-8950-REPORT-PARA
092150         MOVE SPACES TO WS-8950-P1
092160         SET END-INSTRUCTIONS TO TRUE
092170       ELSE
092180         IF WS-INSTRUCTIONS-CTR > 5 AND END-BRANCH-PRODUCT
092190           SET END-INSTRUCTIONS TO TRUE
092200         END-IF
092210       END-IF
092220     END-IF.
092230*
092240   3935-FMT-BC-OVERRIDE-INSTR.
092250     PERFORM 3945-BC-OVERRIDE-INSTRUCTIONS UNTIL
092260           INSTRUCTIONS-ASSIGNED OR WS-INSTRUCTIONS-CTR > 1.
092270     PERFORM 3980-BRANCH-PRODUCT-ASSIGNMENT.
092280     IF INSTRUCTIONS-ASSIGNED OR BRANCH-PRODUCT-ASSIGNED
092290       PERFORM 3990-WRITE-8950-REPORT-PARA
092300       MOVE SPACES TO WS-8950-P1
092310       MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG
092320                   WS-BRANCH-PRODUCT-A-FLAG
092330     ELSE
092340       IF WS-INSTRUCTIONS-CTR > 1 AND WS-BRANCH-PRODUCT-CTR = 1
092350         PERFORM 3990-WRITE-8950-REPORT-PARA
092360         MOVE SPACES TO WS-8950-P1
092370         SET END-INSTRUCTIONS TO TRUE
092380       ELSE
092390         IF WS-INSTRUCTIONS-CTR > 1 AND END-BRANCH-PRODUCT
092400           SET END-INSTRUCTIONS TO TRUE
092410         END-IF
092420       END-IF
092430     END-IF.
092440*
092450   3936-FMT-SAVINGS-IDEN-INSTR.
092460     PERFORM 3946-SAVINGS-IDEN-INSTRUCTIONS UNTIL
092470           INSTRUCTIONS-ASSIGNED OR WS-INSTRUCTIONS-CTR > 1.
092480     PERFORM 3980-BRANCH-PRODUCT-ASSIGNMENT.
092490     IF INSTRUCTIONS-ASSIGNED OR BRANCH-PRODUCT-ASSIGNED
092500       PERFORM 3990-WRITE-8950-REPORT-PARA
092510       MOVE SPACES TO WS-8950-P1
092520       MOVE 'N' TO WS-INSTRUCTIONS-A-FLAG
092530                   WS-BRANCH-PRODUCT-A-FLAG
092540     ELSE
092550       IF WS-INSTRUCTIONS-CTR > 1 AND WS-BRANCH-PRODUCT-CTR = 1
092560         PERFORM 3990-WRITE-8950-REPORT-PARA
092570         MOVE SPACES TO WS-8950-P1
092580         SET END-INSTRUCTIONS TO TRUE
092590       ELSE
092600         IF WS-INSTRUCTIONS-CTR > 1 AND END-BRANCH-PRODUCT
092610           SET END-INSTRUCTIONS TO TRUE
092620         END-IF
092630       END-IF
092640     END-IF.
092650*
092660   3941-ASSIGNMENT-INSTRUCTIONS.
092670     ADD 1 TO WS-INSTRUCTIONS-CTR.
092680     IF WS-INSTRUCTIONS-CTR NOT > 3
092690       EVALUATE WS-INSTRUCTIONS-CTR
092700         WHEN 1
092710           IF I8950-1-ACCOUNT-NUMBER NOT EQUAL SPACES
092720             MOVE I8950-1-ACCOUNT-NUMBER TO
092730                   WS-1-D-ACCOUNT-NUMBER
092740             MOVE WS-1-I-ACCOUNT-NUMBER TO
092750                   WS-8950-P1-INSTRUCTIONS
092760             SET INSTRUCTIONS-ASSIGNED TO TRUE
092770           END-IF
092780         WHEN 2
092790           IF I8950-1-ACCOUNT-TYPE NOT EQUAL SPACES
092800             MOVE I8950-1-ACCOUNT-TYPE TO
092810                   WS-1-D-ACCOUNT-TYPE
092820             MOVE WS-1-I-ACCOUNT-TYPE TO
092830                   WS-8950-P1-INSTRUCTIONS
092840             SET INSTRUCTIONS-ASSIGNED TO TRUE
092850           END-IF
092860         WHEN 3
092870           IF I8950-1-BC NOT EQUAL SPACES
092880             MOVE I8950-1-BC TO WS-1-D-BC
092890             MOVE WS-1-I-BC TO WS-8950-P1-INSTRUCTIONS
092900             SET INSTRUCTIONS-ASSIGNED TO TRUE
092910           END-IF
092920       END-EVALUATE
092930     END-IF.
092940*
092950   3942-DESC-OVERRIDE-INSTR.
092960     ADD 1 TO WS-INSTRUCTIONS-CTR.
092970     IF WS-INSTRUCTIONS-CTR NOT > 4
092980       EVALUATE WS-INSTRUCTIONS-CTR
092990         WHEN 1
093000           IF I8950-2-WVE-EXP-IND-NAME-OPT NOT EQUAL SPACES
093010             MOVE I8950-2-WVE-EXP-IND-NAME-OPT TO
093020                   WS-2-D-WVE-EXP-NAME
093030             MOVE WS-2-I-WVE-EXP-NAME TO
093040                   WS-8950-P1-INSTRUCTIONS
093050             SET INSTRUCTIONS-ASSIGNED TO TRUE
093060           END-IF
093070         WHEN 2
093080           IF I8950-2-CREDITS-IND-NAME-OPT NOT EQUAL SPACES
093090             MOVE I8950-2-CREDITS-IND-NAME-OPT TO
093100                   WS-2-D-CREDITS-NAME
093110             MOVE WS-2-I-CREDITS-NAME TO
093120                   WS-8950-P1-INSTRUCTIONS
093130             SET INSTRUCTIONS-ASSIGNED TO TRUE
093140           END-IF
093150         WHEN 3
093160           IF I8950-2-UPCHARGE-IND-NAME-OPT NOT EQUAL SPACES
093170             MOVE I8950-2-UPCHARGE-IND-NAME-OPT TO
093180                   WS-2-D-UPCHARGE-NAME
093190             MOVE WS-2-I-UPCHARGE-NAME TO
093200                   WS-8950-P1-INSTRUCTIONS
093210             SET INSTRUCTIONS-ASSIGNED TO TRUE
093220           END-IF
093230         WHEN 4
093240           IF I8950-2-TAX-IND-NAME-OPT NOT EQUAL SPACES
093250             MOVE I8950-2-TAX-IND-NAME-OPT TO
093260                   WS-2-D-TAX-NAME
093270             MOVE WS-2-I-TAX-NAME TO
093280                   WS-8950-P1-INSTRUCTIONS
093290             SET INSTRUCTIONS-ASSIGNED TO TRUE
093300           END-IF
093310       END-EVALUATE
093320     END-IF.
093330*
093340   3943-BATCH-HEADER-INSTRUCTIONS.
093350     ADD 1 TO WS-INSTRUCTIONS-CTR.
093360     IF WS-INSTRUCTIONS-CTR NOT > 4
093370       EVALUATE WS-INSTRUCTIONS-CTR
093380         WHEN 1
093390           IF I8950-3-COMPANY-NAME NOT EQUAL SPACES
093400             MOVE I8950-3-COMPANY-NAME TO
093410                   WS-3-D-COMPANY-NAME
093420             MOVE WS-3-I-COMPANY-NAME TO
093430                   WS-8950-P1-INSTRUCTIONS
093440             SET INSTRUCTIONS-ASSIGNED TO TRUE
093450           END-IF
093460         WHEN 2
093470           IF I8950-3-DISCRET-DATA NOT EQUAL SPACES
093480             MOVE I8950-3-DISCRET-DATA TO
093490                   WS-3-D-DISCRET-DATA
093500             MOVE WS-3-I-DISCRET-DATA TO
093510                   WS-8950-P1-INSTRUCTIONS
093520             SET INSTRUCTIONS-ASSIGNED TO TRUE
093530           END-IF
093540         WHEN 3
093550           IF I8950-3-GL-STD-ENT-CCD-FLAG NOT EQUAL SPACES
093560             MOVE I8950-3-GL-STD-ENT-CCD-FLAG TO
093570                   WS-3-D-GL-STD-ENT-CCD-FLAG
093580             MOVE WS-3-I-GL-STD-ENT-CCD-FLAG TO
093590                   WS-8950-P1-INSTRUCTIONS
093600             SET INSTRUCTIONS-ASSIGNED TO TRUE
093610           END-IF
093620         WHEN 4
093630           IF I8950-3-ENTRY-DESCRIPTION NOT EQUAL SPACES
093640             MOVE I8950-3-ENTRY-DESCRIPTION TO
093650                   WS-3-D-ENTRY-DESCRIPTION
093660             MOVE WS-3-I-ENTRY-DESCRIPTION TO
093670                   WS-8950-P1-INSTRUCTIONS
093680             SET INSTRUCTIONS-ASSIGNED TO TRUE
093690           END-IF
093700       END-EVALUATE
093710     END-IF.
093720*
093730   3944-SUMMARY-INSTRUCTIONS.
093740     ADD 1 TO WS-INSTRUCTIONS-CTR.
093750     IF WS-INSTRUCTIONS-CTR NOT > 5
093760       EVALUATE WS-INSTRUCTIONS-CTR
093770         WHEN 1
093780           IF I8950-4-WVE-CHARGE-SUM-INSTR NOT EQUAL SPACES
093790             MOVE I8950-4-WVE-CHARGE-SUM-INSTR TO
093800                   WS-4-D-WVE-CHARGE-SUM-INSTR
093810             MOVE WS-4-I-WVE-CHARGE-SUM-INSTR TO
093820                   WS-8950-P1-INSTRUCTIONS
093830             SET INSTRUCTIONS-ASSIGNED TO TRUE
093840           END-IF
093850         WHEN 2
093860           IF I8950-4-EXP-CHARGE-SUM-INSTR NOT EQUAL SPACES
093870             MOVE I8950-4-EXP-CHARGE-SUM-INSTR TO
093880                   WS-4-D-EXP-CHARGE-SUM-INSTR
093890             MOVE WS-4-I-EXP-CHARGE-SUM-INSTR TO
093900                   WS-8950-P1-INSTRUCTIONS
093910             SET INSTRUCTIONS-ASSIGNED TO TRUE
093920           END-IF
093930         WHEN 3
093940           IF I8950-4-RETAIL-CRED-SUM-INSTR NOT EQUAL SPACES
093950             MOVE I8950-4-RETAIL-CRED-SUM-INSTR TO
093960                   WS-4-D-RETAIL-CRED-SUM-INSTR
093970             MOVE WS-4-I-RETAIL-CRED-SUM-INSTR TO
093980                   WS-8950-P1-INSTRUCTIONS
093990             SET INSTRUCTIONS-ASSIGNED TO TRUE
094000           END-IF
094010         WHEN 4
094020           IF I8950-4-WVE-CREDIT-SUM-INSTR NOT EQUAL SPACES
094030             MOVE I8950-4-WVE-CREDIT-SUM-INSTR TO
094040                   WS-4-D-WVE-CREDIT-SUM-INSTR
094050             MOVE WS-4-I-WVE-CREDIT-SUM-INSTR TO
094060                   WS-8950-P1-INSTRUCTIONS
094070             SET INSTRUCTIONS-ASSIGNED TO TRUE
094080           END-IF
094090         WHEN 5
094100           IF I8950-4-EXP-CREDIT-SUM-INSTR NOT EQUAL SPACES
094110             MOVE I8950-4-EXP-CREDIT-SUM-INSTR TO
094120                   WS-4-D-EXP-CREDIT-SUM-INSTR
094130             MOVE WS-4-I-EXP-CREDIT-SUM-INSTR TO
094140                   WS-8950-P1-INSTRUCTIONS
094150             SET INSTRUCTIONS-ASSIGNED TO TRUE
094160           END-IF
094170       END-EVALUATE
094180     END-IF.
094190*
094200   3945-BC-OVERRIDE-INSTRUCTIONS.
094210     ADD 1 TO WS-INSTRUCTIONS-CTR.
094220     IF WS-INSTRUCTIONS-CTR NOT > 1
094230       EVALUATE WS-INSTRUCTIONS-CTR
094240         WHEN 1
094250           IF I8950-5-RETAIL-BC-OVERRIDE NOT EQUAL SPACES
094260             MOVE I8950-5-RETAIL-BC-OVERRIDE TO
094270                   WS-5-D-RETAIL-BC-OVERRIDE
094280             MOVE WS-5-I-RETAIL-BC-OVERRIDE TO
094290                   WS-8950-P1-INSTRUCTIONS
094300             SET INSTRUCTIONS-ASSIGNED TO TRUE
094310           END-IF
094320       END-EVALUATE
094330     END-IF.
094340*
094350   3946-SAVINGS-IDEN-INSTRUCTIONS.
094360     ADD 1 TO WS-INSTRUCTIONS-CTR.
094370     IF WS-INSTRUCTIONS-CTR NOT > 1
094380       EVALUATE WS-INSTRUCTIONS-CTR
094390         WHEN 1
094400           IF I8950-6-RETAIL-SAVINGS-PRODS NOT EQUAL SPACES
094410             MOVE I8950-6-RETAIL-SAVINGS-PRODS TO
094420                   WS-6-D-RETAIL-SAVINGS-PRODS
094430             MOVE WS-6-I-RETAIL-SAVINGS-PRODS TO
094440                   WS-8950-P1-INSTRUCTIONS
094450             SET INSTRUCTIONS-ASSIGNED TO TRUE
094460           END-IF
094470       END-EVALUATE
094480     END-IF.
094490*
094500   3980-BRANCH-PRODUCT-ASSIGNMENT.
094510     ADD 1 TO WS-BRANCH-PRODUCT-CTR.
094520     EVALUATE WS-BRANCH-PRODUCT-CTR
094530       WHEN 1
094540         IF I8950-1ST-LOW-PRI-BRANCH NOT EQUAL SPACES OR
094550           I8950-1ST-HIGH-PRI-BRANCH NOT EQUAL SPACES
094560           IF I8950-1ST-LOW-PRI-BRANCH EQUAL SPACES
094570             MOVE ZEROES TO WS-8950-P1-M-LOW-BRANCH
094580           ELSE
094590             MOVE I8950-1ST-LOW-PRI-BRANCH TO
094600                   WS-8950-P1-M-LOW-BRANCH
094610           END-IF
094620           IF I8950-1ST-HIGH-PRI-BRANCH EQUAL SPACES
094630             MOVE ZEROES TO WS-8950-P1-M-HIGH-BRANCH
094640           ELSE
094650             MOVE I8950-1ST-HIGH-PRI-BRANCH TO
094660                   WS-8950-P1-M-HIGH-BRANCH
094670           END-IF
094680           MOVE '-' TO WS-BRANCH-FILLER
094690           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
094700         END-IF
094710         IF I8950-1ST-MATCH-PRODUCT NOT EQUAL SPACES
094720           MOVE I8950-1ST-MATCH-PRODUCT TO
094730                 WS-8950-P1-M-PRODUCT
094740           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
094750         END-IF
094760         IF SPACES EQUAL I8950-1ST-LOW-PRI-BRANCH AND
094770                         I8950-1ST-HIGH-PRI-BRANCH AND
094780                         I8950-1ST-MATCH-PRODUCT
094790           SET END-BRANCH-PRODUCT TO TRUE
094800         END-IF
094810       WHEN 2
094820         IF I8950-2ND-LOW-PRI-BRANCH NOT EQUAL SPACES OR
094830           I8950-2ND-HIGH-PRI-BRANCH NOT EQUAL SPACES
094840           IF I8950-2ND-LOW-PRI-BRANCH EQUAL SPACES
094850             MOVE ZEROES TO WS-8950-P1-M-LOW-BRANCH
094860           ELSE
094870             MOVE I8950-2ND-LOW-PRI-BRANCH TO
094880                   WS-8950-P1-M-LOW-BRANCH
094890           END-IF
094900           IF I8950-2ND-HIGH-PRI-BRANCH EQUAL SPACES
094910             MOVE ZEROES TO WS-8950-P1-M-HIGH-BRANCH
094920           ELSE
094930             MOVE I8950-2ND-HIGH-PRI-BRANCH TO
094940                   WS-8950-P1-M-HIGH-BRANCH
094950           END-IF
094960           MOVE '-' TO WS-BRANCH-FILLER
094970           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
094980         END-IF
094990         IF I8950-2ND-MATCH-PRODUCT NOT EQUAL SPACES
095000           MOVE I8950-2ND-MATCH-PRODUCT TO
095010                 WS-8950-P1-M-PRODUCT
095020           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095030         END-IF
095040         IF SPACES EQUAL I8950-2ND-LOW-PRI-BRANCH AND
095050                         I8950-2ND-HIGH-PRI-BRANCH AND
095060                         I8950-2ND-MATCH-PRODUCT
095070           SET END-BRANCH-PRODUCT TO TRUE
095080         END-IF
095090       WHEN 3
095100         IF I8950-3RD-LOW-PRI-BRANCH NOT EQUAL SPACES OR
095110           I8950-3RD-HIGH-PRI-BRANCH NOT EQUAL SPACES
095120           IF I8950-3RD-LOW-PRI-BRANCH EQUAL SPACES
095130             MOVE ZEROES TO WS-8950-P1-M-LOW-BRANCH
095140           ELSE
095150             MOVE I8950-3RD-LOW-PRI-BRANCH TO
095160                   WS-8950-P1-M-LOW-BRANCH
095170           END-IF
095180           IF I8950-3RD-HIGH-PRI-BRANCH EQUAL SPACES
095190             MOVE ZEROES TO WS-8950-P1-M-HIGH-BRANCH
095200           ELSE
095210             MOVE I8950-3RD-HIGH-PRI-BRANCH TO
095220                   WS-8950-P1-M-HIGH-BRANCH
095230           END-IF
095240           MOVE '-' TO WS-BRANCH-FILLER
095250           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095260         END-IF
095270         IF I8950-3RD-MATCH-PRODUCT NOT EQUAL SPACES
095280           MOVE I8950-3RD-MATCH-PRODUCT TO
095290                 WS-8950-P1-M-PRODUCT
095300           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095310         END-IF
095320         IF SPACES EQUAL I8950-3RD-LOW-PRI-BRANCH AND
095330                         I8950-3RD-HIGH-PRI-BRANCH AND
095340                         I8950-3RD-MATCH-PRODUCT
095350           SET END-BRANCH-PRODUCT TO TRUE
095360         END-IF
095370       WHEN 4
095380         IF I8950-4TH-LOW-PRI-BRANCH NOT EQUAL SPACES OR
095390           I8950-4TH-HIGH-PRI-BRANCH NOT EQUAL SPACES
095400           IF I8950-4TH-LOW-PRI-BRANCH EQUAL SPACES
095410             MOVE ZEROES TO WS-8950-P1-M-LOW-BRANCH
095420           ELSE
095430             MOVE I8950-4TH-LOW-PRI-BRANCH TO
095440                   WS-8950-P1-M-LOW-BRANCH
095450           END-IF
095460           IF I8950-4TH-HIGH-PRI-BRANCH EQUAL SPACES
095470             MOVE ZEROES TO WS-8950-P1-M-HIGH-BRANCH
095480           ELSE
095490             MOVE I8950-4TH-HIGH-PRI-BRANCH TO
095500                   WS-8950-P1-M-HIGH-BRANCH
095510           END-IF
095520           MOVE '-' TO WS-BRANCH-FILLER
095530           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095540         END-IF
095550         IF I8950-4TH-MATCH-PRODUCT NOT EQUAL SPACES
095560           MOVE I8950-4TH-MATCH-PRODUCT TO
095570                 WS-8950-P1-M-PRODUCT
095580           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095590         END-IF
095600         IF SPACES EQUAL I8950-4TH-LOW-PRI-BRANCH AND
095610                         I8950-4TH-HIGH-PRI-BRANCH AND
095620                         I8950-4TH-MATCH-PRODUCT
095630           SET END-BRANCH-PRODUCT TO TRUE
095640         END-IF
095650       WHEN 5
095660         IF I8950-5TH-LOW-PRI-BRANCH NOT EQUAL SPACES OR
095670           I8950-5TH-HIGH-PRI-BRANCH NOT EQUAL SPACES
095680           IF I8950-5TH-LOW-PRI-BRANCH EQUAL SPACES
095690             MOVE ZEROES TO WS-8950-P1-M-LOW-BRANCH
095700           ELSE
095710             MOVE I8950-5TH-LOW-PRI-BRANCH TO
095720                   WS-8950-P1-M-LOW-BRANCH
095730           END-IF
095740           IF I8950-5TH-HIGH-PRI-BRANCH EQUAL SPACES
095750             MOVE ZEROES TO WS-8950-P1-M-HIGH-BRANCH
095760           ELSE
095770             MOVE I8950-5TH-HIGH-PRI-BRANCH TO
095780                   WS-8950-P1-M-HIGH-BRANCH
095790           END-IF
095800           MOVE '-' TO WS-BRANCH-FILLER
095810           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095820         END-IF
095830         IF I8950-5TH-MATCH-PRODUCT NOT EQUAL SPACES
095840           MOVE I8950-5TH-MATCH-PRODUCT TO
095850                 WS-8950-P1-M-PRODUCT
095860           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095870         END-IF
095880         IF SPACES EQUAL I8950-5TH-LOW-PRI-BRANCH AND
095890                         I8950-5TH-HIGH-PRI-BRANCH AND
095900                         I8950-5TH-MATCH-PRODUCT
095910           SET END-BRANCH-PRODUCT TO TRUE
095920         END-IF
095930       WHEN 6
095940         IF I8950-6TH-MATCH-PRODUCT NOT EQUAL SPACES
095950           MOVE I8950-6TH-MATCH-PRODUCT TO
095960                 WS-8950-P1-M-PRODUCT
095970           SET BRANCH-PRODUCT-ASSIGNED TO TRUE
095980           SET END-INSTRUCTIONS TO TRUE
095990         ELSE
096000           SET END-BRANCH-PRODUCT TO TRUE
096010           SET END-INSTRUCTIONS TO TRUE
096020         END-IF
096030     END-EVALUATE.
096040*
096050   3990-WRITE-8950-REPORT-PARA.
096060     IF WS-FIRST-LINE
096070       SET WS-NOT-FIRST-LINE TO TRUE
096080     ELSE
096090       MOVE +1 TO WS-LINE-SPACER
096100     END-IF.
096110     MOVE WS-8950-P1 TO PRINTER1-RECORD.
096120     PERFORM 0600-WRITE-PRINTER1-RECORD.
096130*
096140   4100-CHECK-I751P-FILE.
096150     PERFORM 4110-READ-I751P-FILE
096160       WITH TEST BEFORE
096170       UNTIL END-I751P-FILE
096180             OR (I751P-BC NOT LESS WS-IPARM-BC).
096190     IF (NOT END-I751P-FILE)
096200         AND (I751P-BC EQUAL WS-IPARM-BC)
096210       MOVE SPACE TO WS-PREV-RECORD-TYPE
096220       MOVE 'Y' TO WS-FILE-HEAD-FLAG
096230       MOVE '751C FILE: ' TO WS-FILE-HD-FILE-NBR
096240       MOVE 'SPLIT/SUMMARIZE NACHA' TO WS-FILE-HD-FILE-NAME
096250       PERFORM
096260           WITH TEST AFTER
096270           UNTIL END-I751P-FILE
096280                 OR (I751P-BC GREATER WS-IPARM-BC)
096290         IF I751P-CARD-CD EQUAL '2'
096300           PERFORM 4130-REPORT-I751P-2-REC
096310         ELSE
096320           PERFORM 4120-REPORT-I751P-1-REC
096330         END-IF
096340         PERFORM 0600-WRITE-PRINTER1-RECORD
096350         PERFORM 4110-READ-I751P-FILE
096360       END-PERFORM.
096370*
096380   4110-READ-I751P-FILE.
096390     READ I751P-FILE
096400       AT END
096410         MOVE 'E' TO WS-I751P-FILE-FLAG
096420       NOT AT END
096430         IF I751P-BC NOT LESS WS-I751P-BC
096440           MOVE I751P-BC TO WS-I751P-BC
096450         ELSE
096460           DISPLAY '* I751P SEQUENCE ERROR "' WS-I751P-BC '" "'
096470                 I751P-BC '" *' UPON SYSOUT
096480           GO TO 9900-DISPLAY-ABORT
096490         END-IF
096500       END-READ.
096510*
096520   4120-REPORT-I751P-1-REC.
096530     IF WS-PREV-RECORD-TYPE NOT EQUAL '1'
096540       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
096550       IF PRINT-FILE-HEAD
096560         MOVE +3 TO WS-LINES-NEEDED
096570       ELSE
096580         MOVE +4 TO WS-LINES-NEEDED
096590     ELSE
096600       MOVE +1 TO WS-LINES-NEEDED.
096610     PERFORM 0500-CHECK-FOR-HEADINGS.
096620     IF PRINT-COLUMN-HEAD
096630       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
096640       IF (WS-LINE-COUNT GREATER +3)
096650           AND (WS-PREV-RECORD-TYPE NOT EQUAL SPACE)
096660         MOVE +2 TO WS-LINE-SPACER
096670       END-IF
096680       MOVE WS-751P-C1 TO PRINTER1-RECORD
096690       PERFORM 0600-WRITE-PRINTER1-RECORD
096700       MOVE +1 TO WS-LINE-SPACER
096710       MOVE WS-751P-D1 TO PRINTER1-RECORD
096720       PERFORM 0600-WRITE-PRINTER1-RECORD.
096730     MOVE I751P-BC TO WS-751P-P1-BC.
096740     MOVE I751P-PRI-BR TO WS-751P-P1-PRI-BR.
096750     MOVE I751P-SEC-BR TO WS-751P-P1-SEC-BR.
096760     MOVE I751P-BILL-TYPE TO WS-751P-P1-BILL-TYPE.
096770     MOVE I751P-CARD-CD TO WS-751P-P1-CARD-CD.
096780     MOVE I751P-A-RSL-INSTR TO WS-751P-P1-RSL-INSTR.
096790     MOVE I751P-A-EXP-INSTR TO WS-751P-P1-EXP-INSTR.
096800     MOVE I751P-A-EXP-NEW-PROD-CD TO WS-751P-P1-EXP-NEW-PROD.
096810     MOVE I751P-A-EXP-PROD-DESCR TO WS-751P-P1-EXP-PROD-DESC.
096820     MOVE I751P-A-EXP-PRI-BR TO WS-751P-P1-EXP-PRI-BR.
096830     MOVE I751P-A-EXP-SEC-BR TO WS-751P-P1-EXP-SEC-BR.
096840     MOVE I751P-A-EXP-BILL-TYPE TO WS-751P-P1-EXP-BILL-TYPE.
096850     MOVE I751P-A-CR-INSTR TO WS-751P-P1-CR-INSTR.
096860     MOVE I751P-A-CR-NEW-PROD-CD TO WS-751P-P1-CR-NEW-PROD.
096870     MOVE I751P-A-CR-PROD-DESCR TO WS-751P-P1-CR-PROD-DESC.
096880     MOVE I751P-A-CR-COST-FLAG TO WS-751P-P1-CR-COST-FLAG.
096890     MOVE I751P-A-EXP-BC TO WS-751P-P1-EXP-BC.
096900     MOVE I751P-A-CR-PRI-BR TO WS-751P-P1-CR-PRI-BR.
096910     MOVE I751P-A-CR-SEC-BR TO WS-751P-P1-CR-SEC-BR.
096920     MOVE I751P-A-CR-BILL-TYPE TO WS-751P-P1-CR-BILL-TYPE.
096930     MOVE WS-751P-P1 TO PRINTER1-RECORD.
096940     MOVE '1' TO WS-PREV-RECORD-TYPE.
096950*
096960   4130-REPORT-I751P-2-REC.
096970     IF WS-PREV-RECORD-TYPE NOT EQUAL '2'
096980       MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
096990       MOVE +4 TO WS-LINES-NEEDED
097000     ELSE
097010       MOVE +1 TO WS-LINES-NEEDED.
097020     PERFORM 0500-CHECK-FOR-HEADINGS.
097030     IF PRINT-COLUMN-HEAD
097040       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
097050       IF WS-LINE-COUNT GREATER +3
097060         MOVE +2 TO WS-LINE-SPACER
097070       END-IF
097080       MOVE WS-751P-C2 TO PRINTER1-RECORD
097090       PERFORM 0600-WRITE-PRINTER1-RECORD
097100       MOVE +1 TO WS-LINE-SPACER
097110       MOVE WS-751P-D2 TO PRINTER1-RECORD
097120       PERFORM 0600-WRITE-PRINTER1-RECORD.
097130     MOVE I751P-BC TO WS-751P-P2-BC.
097140     MOVE I751P-PRI-BR TO WS-751P-P2-PRI-BR.
097150     MOVE I751P-SEC-BR TO WS-751P-P2-SEC-BR.
097160     MOVE I751P-BILL-TYPE TO WS-751P-P2-BILL-TYPE.
097170     MOVE I751P-CARD-CD TO WS-751P-P2-CARD-CD.
097180     MOVE I751P-B-INV-INSTR TO WS-751P-P2-INV-INSTR.
097190     MOVE I751P-B-INV-NEW-PROD-CD TO WS-751P-P2-INV-NEW-PROD.
097200     MOVE I751P-B-INV-PROD-DESCR TO WS-751P-P2-INV-PROD-DESC.
097210     MOVE I751P-B-INV-COST-FLAG TO WS-751P-P2-INV-COST-FLAG.
097220     MOVE WS-751P-P2 TO PRINTER1-RECORD.
097230     MOVE '2' TO WS-PREV-RECORD-TYPE.
097240*
097250   4200-CHECK-I871-FILE.
097260     PERFORM 4210-READ-I871-FILE
097270       WITH TEST BEFORE
097280       UNTIL END-I871-FILE
097290             OR (I871-BC NOT LESS WS-IPARM-BC).
097300     IF (NOT END-I871-FILE)
097310         AND (I871-BC EQUAL WS-IPARM-BC)
097320       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
097330       MOVE '871 FILE:  ' TO WS-FILE-HD-FILE-NBR
097340       MOVE 'SPECIAL ACCOUNT FORMATS FILE' TO WS-FILE-HD-FILE-NAME
097350       PERFORM 4220-REPORT-I871-RECORD
097360         WITH TEST AFTER
097370         UNTIL END-I871-FILE
097380               OR (I871-BC GREATER WS-IPARM-BC).
097390*
097400   4210-READ-I871-FILE.
097410     READ I871-FILE
097420       AT END
097430         MOVE 'E' TO WS-I871-FILE-FLAG
097440       NOT AT END
097450         IF I871-SEQUENCE NOT LESS WS-I871-SEQUENCE
097460           MOVE I871-SEQUENCE TO WS-I871-SEQUENCE
097470         ELSE
097480           DISPLAY '* I871 SEQUENCE ERROR "' WS-I871-SEQUENCE
097490                 '" "' I871-SEQUENCE '" *' UPON SYSOUT
097500           GO TO 9900-DISPLAY-ABORT
097510         END-IF
097520       END-READ.
097530*
097540   4220-REPORT-I871-RECORD.
097550     IF PRINT-COLUMN-HEAD
097560       MOVE +3 TO WS-LINES-NEEDED
097570     ELSE
097580       MOVE +1 TO WS-LINES-NEEDED.
097590     PERFORM 0500-CHECK-FOR-HEADINGS.
097600     IF PRINT-COLUMN-HEAD
097610       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
097620       MOVE WS-871-C1 TO PRINTER1-RECORD
097630       PERFORM 0600-WRITE-PRINTER1-RECORD
097640       MOVE WS-871-D1 TO PRINTER1-RECORD
097650       PERFORM 0600-WRITE-PRINTER1-RECORD.
097660     MOVE I871-BC TO WS-871-P1-BC.
097670     MOVE I871-SEQ-NUMBER TO WS-871-P1-SEQ-NBR.
097680     MOVE I871-DATE-OF-LAST-UPDATE TO WS-871-P1-UPDATED.
097690     MOVE I871-MATCH-BRANCH TO WS-871-P1-BRANCH.
097700     MOVE I871-MATCH-PRODUCT TO WS-871-P1-PROD-CODE.
097710     MOVE I871-MATCH-ACCT-LENGTH TO WS-871-P1-ACCT-LENGTH.
097720     MOVE I871-MATCH-ACCT-NUMBER TO WS-871-P1-ACCT-NBR.
097730     MOVE I871-MATCH-TT-LENGTH TO WS-871-P1-TT-LENGTH.
097740     MOVE I871-FORMAT-INSTRUCTIONS TO WS-871-P1-FORMAT-INSTR.
097750     MOVE WS-871-P1 TO PRINTER1-RECORD.
097760     PERFORM 0600-WRITE-PRINTER1-RECORD.
097770     PERFORM 4210-READ-I871-FILE.
097780*
097790   4700-CHECK-C781-TABLE.
097800     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
097810     MOVE '781C FILE: ' TO WS-FILE-HD-FILE-NBR.
097820     MOVE 'PROFIT REPORT F.I. SELECT' TO WS-FILE-HD-FILE-NAME.
097830     SET IX-WS-C781-TBL TO +1.
097840     PERFORM
097850         WS-C781-ENTRY-COUNT TIMES
097860       IF (WS-C781-BC (IX-WS-C781-TBL) EQUAL WS-IPARM-BC)
097870           OR ((WS-C781-BC (IX-WS-C781-TBL) EQUAL SPACE)
097880               AND ((WS-C781-MASTER-BC (IX-WS-C781-TBL) EQUAL
097890                     WS-FI-MASTER-BC)
097900                   OR ((WS-C781-MASTER-BC (IX-WS-C781-TBL) EQUAL
097910                         SPACE)
097920                       AND (WS-HOLDING-COMPANY NOT EQUAL SPACE)
097930                       AND (WS-C781-HOLDCO (IX-WS-C781-TBL) EQUAL
097940                             WS-HOLDING-COMPANY))))
097950         PERFORM 4710-REPORT-C781-ENTRY
097960       END-IF
097970       SET IX-WS-C781-TBL UP BY 1
097980     END-PERFORM.
097990*
098000   4705-CHECK-C782-TABLE.
098010     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
098020     MOVE '782C FILE: ' TO WS-FILE-HD-FILE-NBR.
098030     MOVE 'PROFIT REPORT F.I. SELECT' TO WS-FILE-HD-FILE-NAME.
098040     SET IX-WS-C782-TBL TO +1.
098050     PERFORM
098060         WS-C782-ENTRY-COUNT TIMES
098070       IF (WS-I782-BC (IX-WS-C782-TBL) EQUAL WS-IPARM-BC)
098080           PERFORM 4706-REPORT-C782-ENTRY
098090       END-IF
098100       SET IX-WS-C782-TBL UP BY 1
098110     END-PERFORM.
098120*
098130   4706-REPORT-C782-ENTRY.
098140     IF PRINT-COLUMN-HEAD
098150       MOVE +3 TO WS-LINES-NEEDED
098160     ELSE
098170       MOVE +1 TO WS-LINES-NEEDED.
098180     PERFORM 0500-CHECK-FOR-HEADINGS.
098190     IF PRINT-COLUMN-HEAD
098200       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
098210       MOVE WS-782P-C1 TO PRINTER1-RECORD
098220       PERFORM 0600-WRITE-PRINTER1-RECORD
098230       MOVE WS-782P-D1 TO PRINTER1-RECORD
098240       PERFORM 0600-WRITE-PRINTER1-RECORD.
098250     INITIALIZE   WS-I782P-ASSIGNMENTS-1
098260                  WS-I782P-ASSIGNMENTS-2
098270                  WS-I782P-ASSIGNMENTS-3.
098280     MOVE WS-I782-CONSID-NBR(IX-WS-C782-TBL)
098290                  TO  WS-I782P-CONSID-NBR
098300     MOVE WS-I782-BC(IX-WS-C782-TBL)
098310                  TO WS-I782P-BC
098320     MOVE WS-I782-PRI-BR(IX-WS-C782-TBL)
098330                  TO WS-I782P-PRI-BR
098340     MOVE WS-I782-SEC-BR(IX-WS-C782-TBL)
098350                  TO WS-I782P-SEC-BR
098360     MOVE WS-I782-BILL-TYPE(IX-WS-C782-TBL)
098370                  TO WS-I782P-BILL-TYPE
098380     MOVE WS-I782-PRODUCT-GROUP(IX-WS-C782-TBL)
098390                  TO WS-I782P-PRODUCT-GROUP
098400     MOVE WS-I782-CARD-CODE(IX-WS-C782-TBL)
098410                  TO WS-I782P-CARD-CODE
098420     EVALUATE TRUE
098430        WHEN
098440           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) EQUAL SPACES
098450           AND
098460           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) EQUAL SPACES
098470           AND
098480           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) NOT EQUAL SPACES
098490             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3)
098500                  TO WS-I782P-ASSIGNMENTS-1
098510             MOVE WS-782P-P1 TO PRINTER1-RECORD
098520             PERFORM 0600-WRITE-PRINTER1-RECORD
098530        WHEN
098540           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) EQUAL SPACES
098550           AND
098560           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) NOT EQUAL SPACES
098570           AND
098580           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) EQUAL SPACES
098590             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2)
098600                  TO WS-I782P-ASSIGNMENTS-1
098610             MOVE WS-782P-P1 TO PRINTER1-RECORD
098620             PERFORM 0600-WRITE-PRINTER1-RECORD
098630        WHEN
098640           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) EQUAL SPACES
098650           AND
098660           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) NOT EQUAL SPACES
098670           AND
098680           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) NOT EQUAL SPACES
098690             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2)
098700                  TO WS-I782P-ASSIGNMENTS-1
098710             MOVE WS-782P-P1 TO PRINTER1-RECORD
098720             PERFORM 0600-WRITE-PRINTER1-RECORD
098730             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3)
098740                  TO WS-I782P-ASSIGNMENTS-2
098750             MOVE WS-782P-P2 TO PRINTER1-RECORD
098760             PERFORM 0600-WRITE-PRINTER1-RECORD
098770        WHEN
098780           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) NOT EQUAL SPACES
098790           AND
098800           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) EQUAL SPACES
098810           AND
098820           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) EQUAL SPACES
098830             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1)
098840                  TO WS-I782P-ASSIGNMENTS-1
098850             MOVE WS-782P-P1 TO PRINTER1-RECORD
098860             PERFORM 0600-WRITE-PRINTER1-RECORD
098870        WHEN
098880           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) NOT EQUAL SPACES
098890           AND
098900           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) EQUAL SPACES
098910           AND
098920           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) NOT EQUAL SPACES
098930             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1)
098940                  TO WS-I782P-ASSIGNMENTS-1
098950             MOVE WS-782P-P1 TO PRINTER1-RECORD
098960             PERFORM 0600-WRITE-PRINTER1-RECORD
098970             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3)
098980                  TO WS-I782P-ASSIGNMENTS-2
098990             MOVE WS-782P-P2 TO PRINTER1-RECORD
099000             PERFORM 0600-WRITE-PRINTER1-RECORD
099010        WHEN
099020           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) NOT EQUAL SPACES
099030           AND
099040           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) NOT EQUAL SPACES
099050           AND
099060           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) EQUAL SPACES
099070             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1)
099080                  TO WS-I782P-ASSIGNMENTS-1
099090             MOVE WS-782P-P1 TO PRINTER1-RECORD
099100             PERFORM 0600-WRITE-PRINTER1-RECORD
099110             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2)
099120                  TO WS-I782P-ASSIGNMENTS-2
099130             MOVE WS-782P-P2 TO PRINTER1-RECORD
099140             PERFORM 0600-WRITE-PRINTER1-RECORD
099150        WHEN
099160           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1) NOT EQUAL SPACES
099170           AND
099180           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2) NOT EQUAL SPACES
099190           AND
099200           WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3) NOT EQUAL SPACES
099210             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 1)
099220                  TO WS-I782P-ASSIGNMENTS-1
099230             MOVE WS-782P-P1 TO PRINTER1-RECORD
099240             PERFORM 0600-WRITE-PRINTER1-RECORD
099250             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 2)
099260                  TO WS-I782P-ASSIGNMENTS-2
099270             MOVE WS-782P-P2 TO PRINTER1-RECORD
099280             PERFORM 0600-WRITE-PRINTER1-RECORD
099290             MOVE WS-I782-ASSIGNMENT(IX-WS-C782-TBL, 3)
099300                  TO WS-I782P-ASSIGNMENTS-3
099310             MOVE WS-782P-P3 TO PRINTER1-RECORD
099320             PERFORM 0600-WRITE-PRINTER1-RECORD
099330     END-EVALUATE.
099340*
099350   4710-REPORT-C781-ENTRY.
099360     IF PRINT-COLUMN-HEAD
099370       MOVE +3 TO WS-LINES-NEEDED
099380     ELSE
099390       MOVE +1 TO WS-LINES-NEEDED.
099400     PERFORM 0500-CHECK-FOR-HEADINGS.
099410     IF PRINT-COLUMN-HEAD
099420       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
099430       MOVE WS-781P-C1 TO PRINTER1-RECORD
099440       PERFORM 0600-WRITE-PRINTER1-RECORD
099450       MOVE WS-781P-D1 TO PRINTER1-RECORD
099460       PERFORM 0600-WRITE-PRINTER1-RECORD.
099470     MOVE WS-C781-HOLDCO (IX-WS-C781-TBL) TO WS-781P-P1-HOLDCO.
099480     MOVE WS-C781-HC-DIV-1 (IX-WS-C781-TBL) TO
099490           WS-781P-P1-HC-DIV-1.
099500     MOVE WS-C781-HC-DIV-2 (IX-WS-C781-TBL) TO
099510           WS-781P-P1-HC-DIV-2.
099520     MOVE WS-C781-HC-DIV-3 (IX-WS-C781-TBL) TO
099530           WS-781P-P1-HC-DIV-3.
099540     MOVE WS-C781-MASTER-BC (IX-WS-C781-TBL) TO
099550           WS-781P-P1-MASTER-BC.
099560     MOVE WS-C781-FI-DIV-1 (IX-WS-C781-TBL) TO
099570           WS-781P-P1-FI-DIV-1.
099580     MOVE WS-C781-FI-DIV-2 (IX-WS-C781-TBL) TO
099590           WS-781P-P1-FI-DIV-2.
099600     MOVE WS-C781-FI-DIV-3 (IX-WS-C781-TBL) TO
099610           WS-781P-P1-FI-DIV-3.
099620     MOVE WS-C781-BC (IX-WS-C781-TBL) TO WS-781P-P1-BC.
099630     MOVE WS-C781-PRI-BR (IX-WS-C781-TBL) TO WS-781P-P1-PRI-BR.
099640     MOVE WS-C781-SEC-BR (IX-WS-C781-TBL) TO WS-781P-P1-SEC-BR.
099650     MOVE WS-C781-BILL-TYPE (IX-WS-C781-TBL) TO
099660           WS-781P-P1-BILL-TYPE.
099670     MOVE WS-C781-CARD-CODE (IX-WS-C781-TBL) TO
099680           WS-781P-P1-CARD-CODE.
099690     MOVE WS-C781-RPT-NBR-1 (IX-WS-C781-TBL) TO
099700           WS-781P-P1-RPT-NBR-1.
099710     MOVE WS-C781-NC-INCL-1 (IX-WS-C781-TBL) TO
099720           WS-781P-P1-NC-INCL-1.
099730     MOVE WS-C781-REB-FLAG-1 (IX-WS-C781-TBL) TO
099740           WS-781P-P1-REB-FLAG-1.
099750     MOVE WS-C781-RPT-NBR-2 (IX-WS-C781-TBL) TO
099760           WS-781P-P1-RPT-NBR-2.
099770     MOVE WS-C781-NC-INCL-2 (IX-WS-C781-TBL) TO
099780           WS-781P-P1-NC-INCL-2.
099790     MOVE WS-C781-REB-FLAG-2 (IX-WS-C781-TBL) TO
099800           WS-781P-P1-REB-FLAG-2.
099810     MOVE WS-C781-RPT-NBR-3 (IX-WS-C781-TBL) TO
099820           WS-781P-P1-RPT-NBR-3.
099830     MOVE WS-C781-NC-INCL-3 (IX-WS-C781-TBL) TO
099840           WS-781P-P1-NC-INCL-3.
099850     MOVE WS-C781-REB-FLAG-3 (IX-WS-C781-TBL) TO
099860           WS-781P-P1-REB-FLAG-3.
099870     MOVE WS-C781-RPT-NBR-4 (IX-WS-C781-TBL) TO
099880           WS-781P-P1-RPT-NBR-4.
099890     MOVE WS-C781-NC-INCL-4 (IX-WS-C781-TBL) TO
099900           WS-781P-P1-NC-INCL-4.
099910     MOVE WS-C781-REB-FLAG-4 (IX-WS-C781-TBL) TO
099920           WS-781P-P1-REB-FLAG-4.
099930     MOVE WS-C781-COMMENT (IX-WS-C781-TBL) TO
099940           WS-781P-P1-COMMENT.
099950     IF WS-781P-P1-RPT-NBR-1 NOT EQUAL SPACE
099960       MOVE WS-781P-P1-RPT-NBR-1 TO WS-PROFIT-RPT-NBR
099970       PERFORM 4720-STORE-PROFIT-RPT-NBR.
099980     IF WS-781P-P1-RPT-NBR-2 NOT EQUAL SPACE
099990       MOVE WS-781P-P1-RPT-NBR-2 TO WS-PROFIT-RPT-NBR
100000       PERFORM 4720-STORE-PROFIT-RPT-NBR.
100010     IF WS-781P-P1-RPT-NBR-3 NOT EQUAL SPACE
100020       MOVE WS-781P-P1-RPT-NBR-3 TO WS-PROFIT-RPT-NBR
100030       PERFORM 4720-STORE-PROFIT-RPT-NBR.
100040     IF WS-781P-P1-RPT-NBR-4 NOT EQUAL SPACE
100050       MOVE WS-781P-P1-RPT-NBR-4 TO WS-PROFIT-RPT-NBR
100060       PERFORM 4720-STORE-PROFIT-RPT-NBR.
100070     MOVE WS-781P-P1 TO PRINTER1-RECORD.
100080     PERFORM 0600-WRITE-PRINTER1-RECORD.
100090*
100100   4720-STORE-PROFIT-RPT-NBR.
100110     SET IX-WS-PROFIT-RPT-CURR TO +1.
100120     PERFORM
100130         WITH TEST BEFORE
100140         UNTIL (IX-WS-PROFIT-RPT-CURR NOT LESS
100150               IX-WS-PROFIT-RPT-EMPTY)
100160             OR (WS-TBL-PROFIT-RPT-NBR (IX-WS-PROFIT-RPT-CURR)
100170                   NOT LESS WS-PROFIT-RPT-NBR)
100180       SET IX-WS-PROFIT-RPT-CURR UP BY 1
100190     END-PERFORM.
100200     IF (IX-WS-PROFIT-RPT-CURR NOT LESS IX-WS-PROFIT-RPT-EMPTY)
100210         OR (WS-TBL-PROFIT-RPT-NBR (IX-WS-PROFIT-RPT-CURR)
100220               NOT EQUAL WS-PROFIT-RPT-NBR)
100230*                * REPORT NBR NOT YET IN TABLE *
100240       IF IX-WS-PROFIT-RPT-EMPTY NOT GREATER +200
100250*                * TABLE HAS ROOM FOR NEW REPORT NBR *
100260         IF IX-WS-PROFIT-RPT-CURR LESS IX-WS-PROFIT-RPT-EMPTY
100270*                * NEW REPORT NBR BELONGS OTHER THAN AT THE END,
100280*                 SHIFT EXISTING ENTRIES TO MAKE ROOM FOR IT *
100290           SET IX-WS-PROFIT-RPT-FROM TO IX-WS-PROFIT-RPT-EMPTY
100300           PERFORM
100310               WITH TEST AFTER
100320               UNTIL IX-WS-PROFIT-RPT-FROM NOT GREATER
100330                     IX-WS-PROFIT-RPT-CURR
100340             SET IX-WS-PROFIT-RPT-TO TO IX-WS-PROFIT-RPT-FROM
100350             SET IX-WS-PROFIT-RPT-FROM DOWN BY 1
100360             MOVE WS-TBL-PROFIT-RPT-NBR (IX-WS-PROFIT-RPT-FROM) TO
100370                   WS-TBL-PROFIT-RPT-NBR (IX-WS-PROFIT-RPT-TO)
100380           END-PERFORM
100390         END-IF
100400         MOVE WS-PROFIT-RPT-NBR TO
100410               WS-TBL-PROFIT-RPT-NBR (IX-WS-PROFIT-RPT-CURR)
100420         SET IX-WS-PROFIT-RPT-EMPTY UP BY 1
100430       ELSE
100440         DISPLAY '* PROFIT REPORT NBR TABLE OVERFLOWED FOR BC "'
100450               WS-IPARM-BC '" *' UPON SYSOUT
100460         GO TO 9900-DISPLAY-ABORT.
100470*
100480   4730-CHECK-C1712-TABLE.
100490     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
100500     MOVE '1712C FILE:' TO WS-FILE-HD-FILE-NBR.
100510     MOVE 'CUSTOM REPORT F.I. SELECT' TO WS-FILE-HD-FILE-NAME.
100520     SET IX-WS-C1712-TBL TO +1.
100530     PERFORM
100540         WS-C1712-ENTRY-COUNT TIMES
100550       IF (WS-C1712-BC (IX-WS-C1712-TBL) EQUAL WS-IPARM-BC)
100560         PERFORM 4740-REPORT-C1712-ENTRY
100570       END-IF
100580       SET IX-WS-C1712-TBL UP BY 1
100590     END-PERFORM.
100600*
100610   4740-REPORT-C1712-ENTRY.
100620     IF PRINT-COLUMN-HEAD
100630       MOVE +3 TO WS-LINES-NEEDED
100640     ELSE
100650       MOVE +1 TO WS-LINES-NEEDED.
100660     PERFORM 0500-CHECK-FOR-HEADINGS.
100670     IF PRINT-COLUMN-HEAD
100680       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
100690       MOVE WS-1712P-C1 TO PRINTER1-RECORD
100700       PERFORM 0600-WRITE-PRINTER1-RECORD
100710       MOVE WS-1712P-C1A TO PRINTER1-RECORD
100720       PERFORM 0600-WRITE-PRINTER1-RECORD
100730       MOVE WS-1712P-D1 TO PRINTER1-RECORD
100740       PERFORM 0600-WRITE-PRINTER1-RECORD.
100750     MOVE WS-C1712-REPORT-NUMBER (IX-WS-C1712-TBL) TO
100760           WS-1712P-REPORT-NUMBER.
100770     MOVE WS-C1712-DATE-FIRST-BILL (IX-WS-C1712-TBL) TO
100780           WS-1712P-DATE-FIRST-BILL.
100790     MOVE WS-C1712-DATE-FINAL-BILL (IX-WS-C1712-TBL) TO
100800           WS-1712P-DATE-FINAL-BILL.
100810     MOVE WS-C1712-BC (IX-WS-C1712-TBL) TO
100820           WS-1712P-BILL-TO-BC.
100830     MOVE WS-C1712-PRI-BR (IX-WS-C1712-TBL) TO
100840           WS-1712P-BILL-TO-BRANCH.
100850     MOVE WS-C1712-FREQUENCY (IX-WS-C1712-TBL) TO
100860           WS-1712P-FREQUENCY.
100870     MOVE WS-C1712-DISK (IX-WS-C1712-TBL) TO
100880           WS-1712P-DISK.
100890     MOVE WS-C1712-SHIPPING (IX-WS-C1712-TBL) TO
100900           WS-1712P-SHIPPING.
100910     MOVE WS-C1712-HOURS (IX-WS-C1712-TBL) TO
100920           WS-1712P-HOURS.
100930     MOVE WS-C1712-SET-UP-TIME (IX-WS-C1712-TBL) TO
100940           WS-1712P-SET-UP-TIME.
100950     MOVE WS-C1712-RUSH-DEVELOPE (IX-WS-C1712-TBL) TO
100960           WS-1712P-RUSH-DEVELOPE.
100970     MOVE WS-C1712-PAGE-COUNT (IX-WS-C1712-TBL) TO
100980           WS-1712P-PAGE-COUNT.
100990     MOVE WS-1712P-P1 TO PRINTER1-RECORD.
101000     PERFORM 0600-WRITE-PRINTER1-RECORD.
101010*
101020   4800-CHECK-896-TABLE.
101030     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
101040     MOVE SPACE TO WS-PREV-RECORD-TYPE.
101050     MOVE '896 FILE:  ' TO WS-FILE-HD-FILE-NBR.
101060     MOVE 'PROFIT TRACKING CONTROL' TO WS-FILE-HD-FILE-NAME.
101070     SET IX-WS-896-TBL IX-WS-PROFIT-RPT-CURR TO +1.
101080     PERFORM
101090         WITH TEST AFTER
101100         UNTIL IX-WS-PROFIT-RPT-CURR NOT LESS
101110               IX-WS-PROFIT-RPT-EMPTY
101120       MOVE WS-TBL-PROFIT-RPT-NBR (IX-WS-PROFIT-RPT-CURR) TO
101130             WS-PROFIT-RPT-NBR
101140       SET IX-WS-PROFIT-RPT-CURR UP BY 1
101150       PERFORM
101160           WITH TEST BEFORE
101170           UNTIL (IX-WS-896-TBL GREATER WS-896-ENTRY-COUNT)
101180               OR (WS-896-TBL-REPORT-NBR (IX-WS-896-TBL) NOT LESS
101190                     WS-PROFIT-RPT-NBR)
101200         SET IX-WS-896-TBL UP BY 1
101210       END-PERFORM
101220       PERFORM
101230           WITH TEST BEFORE
101240           UNTIL (IX-WS-896-TBL GREATER WS-896-ENTRY-COUNT)
101250               OR (WS-896-TBL-REPORT-NBR (IX-WS-896-TBL) GREATER
101260                     WS-PROFIT-RPT-NBR)
101270         MOVE WS-896-TBL-ENTRY (IX-WS-896-TBL) TO WS-896-REC
101280         SET IX-WS-896-TBL UP BY 1
101290         IF WS-896-RECORD-TYPE NOT EQUAL WS-PREV-RECORD-TYPE
101300           MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
101310         END-IF
101320         IF WS-896-RECORD-TYPE LESS 'I'
101330           IF WS-896-RECORD-TYPE LESS 'E'
101340             IF WS-896-RECORD-TYPE LESS 'C'
101350               IF WS-896-RECORD-TYPE LESS 'B'
101360                 PERFORM 4805-FORMAT-896-A-REC
101370                 PERFORM 4805B-FORMAT-896-A-REC
101380               ELSE
101390                 PERFORM 4810-FORMAT-896-B-REC
101400               END-IF
101410             ELSE
101420               IF WS-896-RECORD-TYPE LESS 'D'
101430                 PERFORM 4815-FORMAT-896-C-REC
101440               ELSE
101450                 PERFORM 4820-FORMAT-896-D-REC
101460               END-IF
101470             END-IF
101480           ELSE
101490             IF WS-896-RECORD-TYPE LESS 'G'
101500               IF WS-896-RECORD-TYPE LESS 'F'
101510                 PERFORM 4825-FORMAT-896-E-REC
101520               ELSE
101530                 PERFORM 4830-FORMAT-896-F-REC
101540               END-IF
101550             ELSE
101560               IF WS-896-RECORD-TYPE LESS 'H'
101570                 PERFORM 4835-FORMAT-896-G-REC
101580               ELSE
101590                 PERFORM 4840-FORMAT-896-H-REC
101600               END-IF
101610             END-IF
101620           END-IF
101630         ELSE
101640           IF WS-896-RECORD-TYPE LESS 'J'
101650             PERFORM 4845-FORMAT-896-I-REC
101660           ELSE
101670             PERFORM 4850-FORMAT-896-J-REC
101680           END-IF
101690         END-IF
101700         PERFORM 0600-WRITE-PRINTER1-RECORD
101710         MOVE WS-896-RECORD-TYPE TO WS-PREV-RECORD-TYPE
101720       END-PERFORM
101730     END-PERFORM.
101740*
101750   4805-FORMAT-896-A-REC.
101760     IF PRINT-COLUMN-HEAD
101770       IF WS-PREV-RECORD-TYPE EQUAL SPACE
101780         MOVE +4 TO WS-LINES-NEEDED
101790       ELSE
101800         MOVE +5 TO WS-LINES-NEEDED
101810     ELSE
101820       MOVE +1 TO WS-LINES-NEEDED.
101830     PERFORM 0500-CHECK-FOR-HEADINGS.
101840     IF PRINT-COLUMN-HEAD
101850       IF (WS-PREV-RECORD-TYPE NOT EQUAL SPACE)
101860             AND (WS-LINE-COUNT GREATER +3)
101870         MOVE +2 TO WS-LINE-SPACER
101880       END-IF
101890       MOVE WS-896-C1A TO PRINTER1-RECORD
101900       PERFORM 0600-WRITE-PRINTER1-RECORD
101910       MOVE +1 TO WS-LINE-SPACER
101920       MOVE WS-896-C1B TO PRINTER1-RECORD
101930       PERFORM 0600-WRITE-PRINTER1-RECORD
101940       MOVE WS-896-D1 TO PRINTER1-RECORD
101950       PERFORM 0600-WRITE-PRINTER1-RECORD.
101960     MOVE WS-896-REPORT-NBR TO WS-896-P1-REPORT-NBR.
101970     MOVE WS-896-REPORT-NBR TO WS-896-P12-REPORT-NBR.
101980     MOVE WS-896-RECORD-TYPE TO WS-896-P1-RECORD-TYPE.
101990     MOVE WS-896-RECORD-TYPE TO WS-896-P12-RECORD-TYPE.
102000     MOVE WS-896-UPDATE-DATE TO WS-896-P1-UPDATE-DATE.
102010     MOVE WS-896-A-REPORT-NAME TO WS-896-P1-REPORT-NAME.
102020     MOVE WS-896-A-RPT-PERIOD TO WS-896-P1-RPT-PERIOD.
102030     MOVE WS-896-A-LST-WK-FI-YR TO WS-896-P1-LST-WK-FI-YR.
102040     MOVE WS-896-A-PROD-TRNC-FLG TO WS-896-P1-PROD-TRNC-FLG.
102050     MOVE WS-896-A-NAME-LENGTH TO WS-896-P1-NAME-LENGTH.
102060     MOVE WS-896-A-ACCT-LENGTH TO WS-896-P1-ACCT-LENGTH.
102070     MOVE WS-896-A-PO-NBR-LENGTH TO WS-896-P1-PO-NBR-LENGTH.
102080     MOVE WS-896-A-RPT-MEDIUM TO WS-896-P1-RPT-MEDIUM.
102090     MOVE WS-896-A-RPT-COPIES TO WS-896-P1-RPT-COPIES.
102100     MOVE WS-896-A-HC-GRP-SUPRS TO WS-896-P1-HC-GRP-SUPRS.
102110     MOVE WS-896-A-MBC-GRP-SUPRS TO WS-896-P1-MBC-GRP-SUPRS.
102120     MOVE WS-896-A-NP-CUT-TYPE-F TO WS-896-P1-NP-CUT-TYPE-F.
102130     MOVE WS-896-A-NP-CVR-ETC-FL TO WS-896-P1-NP-CVR-ETC-FL.
102140     MOVE WS-896-A-NP-BUS-DEP-FL TO WS-896-P1-NP-BUS-DEP-FL.
102150     MOVE WS-896-A-NP-OTHER-FLAG TO WS-896-P1-NP-OTHER-FLAG.
102160     MOVE WS-896-A-PC-OUTPUT-FLG TO WS-896-P1-PC-OUTPUT-FLG.
102170     MOVE WS-896-A-MAIL-TO-RPT TO WS-896-P1-MAIL-TO-RPT.
102180     MOVE WS-896-A-MANUAL-RPT TO WS-896-P1-MANUAL-RPT.
102190     MOVE WS-896-A-MAIL-BY-BR TO WS-896-P1-MAIL-BY-BR.
102200     MOVE WS-896-A-CHARGEABLE-FLAG TO WS-896-P12-CHARGE-FLAG.
102210     MOVE WS-896-A-BILL-TO-BC      TO WS-896-P12-BILL-TO-BC.
102220     MOVE WS-896-A-MANUAL-HOURS    TO WS-896-P12-MANUAL-HOURS.
102230     MOVE WS-896-A-SHIPPING-CD     TO WS-896-P12-SHIPPING-CD.
102240     MOVE WS-896-P1 TO PRINTER1-RECORD.
102250     PERFORM 0600-WRITE-PRINTER1-RECORD.
102260*
102270   4805B-FORMAT-896-A-REC.
102280     IF PRINT-COLUMN-HEAD
102290       IF WS-PREV-RECORD-TYPE EQUAL SPACE
102300         MOVE +4 TO WS-LINES-NEEDED
102310       ELSE
102320         MOVE +5 TO WS-LINES-NEEDED
102330     ELSE
102340       MOVE +1 TO WS-LINES-NEEDED.
102350     PERFORM 0500-CHECK-FOR-HEADINGS.
102360     IF PRINT-COLUMN-HEAD
102370       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
102380       MOVE +2 TO WS-LINE-SPACER
102390       MOVE WS-896-C1A2 TO PRINTER1-RECORD
102400       PERFORM 0600-WRITE-PRINTER1-RECORD
102410       MOVE +1 TO WS-LINE-SPACER
102420       MOVE WS-896-C1B2 TO PRINTER1-RECORD
102430       PERFORM 0600-WRITE-PRINTER1-RECORD
102440       MOVE WS-896-D12 TO PRINTER1-RECORD
102450       PERFORM 0600-WRITE-PRINTER1-RECORD.
102460     MOVE WS-896-REPORT-NBR TO WS-896-P1-REPORT-NBR.
102470     MOVE WS-896-REPORT-NBR TO WS-896-P12-REPORT-NBR.
102480     MOVE WS-896-RECORD-TYPE TO WS-896-P1-RECORD-TYPE.
102490     MOVE WS-896-RECORD-TYPE TO WS-896-P12-RECORD-TYPE.
102500     MOVE WS-896-UPDATE-DATE TO WS-896-P1-UPDATE-DATE.
102510     MOVE WS-896-A-REPORT-NAME TO WS-896-P1-REPORT-NAME.
102520     MOVE WS-896-A-RPT-PERIOD TO WS-896-P1-RPT-PERIOD.
102530     MOVE WS-896-A-LST-WK-FI-YR TO WS-896-P1-LST-WK-FI-YR.
102540     MOVE WS-896-A-PROD-TRNC-FLG TO WS-896-P1-PROD-TRNC-FLG.
102550     MOVE WS-896-A-NAME-LENGTH TO WS-896-P1-NAME-LENGTH.
102560     MOVE WS-896-A-ACCT-LENGTH TO WS-896-P1-ACCT-LENGTH.
102570     MOVE WS-896-A-PO-NBR-LENGTH TO WS-896-P1-PO-NBR-LENGTH.
102580     MOVE WS-896-A-RPT-MEDIUM TO WS-896-P1-RPT-MEDIUM.
102590     MOVE WS-896-A-RPT-COPIES TO WS-896-P1-RPT-COPIES.
102600     MOVE WS-896-A-HC-GRP-SUPRS TO WS-896-P1-HC-GRP-SUPRS.
102610     MOVE WS-896-A-MBC-GRP-SUPRS TO WS-896-P1-MBC-GRP-SUPRS.
102620     MOVE WS-896-A-NP-CUT-TYPE-F TO WS-896-P1-NP-CUT-TYPE-F.
102630     MOVE WS-896-A-NP-CVR-ETC-FL TO WS-896-P1-NP-CVR-ETC-FL.
102640     MOVE WS-896-A-NP-BUS-DEP-FL TO WS-896-P1-NP-BUS-DEP-FL.
102650     MOVE WS-896-A-NP-OTHER-FLAG TO WS-896-P1-NP-OTHER-FLAG.
102660     MOVE WS-896-A-PC-OUTPUT-FLG TO WS-896-P1-PC-OUTPUT-FLG.
102670     MOVE WS-896-A-MAIL-TO-RPT TO WS-896-P1-MAIL-TO-RPT.
102680     MOVE WS-896-A-MANUAL-RPT TO WS-896-P1-MANUAL-RPT.
102690     MOVE WS-896-A-MAIL-BY-BR TO WS-896-P1-MAIL-BY-BR.
102700     MOVE WS-896-A-CHARGEABLE-FLAG TO WS-896-P12-CHARGE-FLAG.
102710     MOVE WS-896-A-BILL-TO-BC      TO WS-896-P12-BILL-TO-BC.
102720     MOVE WS-896-A-MANUAL-HOURS    TO WS-896-P12-MANUAL-HOURS.
102730     MOVE WS-896-A-SHIPPING-CD     TO WS-896-P12-SHIPPING-CD.
102740     MOVE WS-896-P12 TO PRINTER1-RECORD.
102750*
102760   4810-FORMAT-896-B-REC.
102770     IF PRINT-COLUMN-HEAD
102780       MOVE +4 TO WS-LINES-NEEDED
102790     ELSE
102800       MOVE +1 TO WS-LINES-NEEDED.
102810     PERFORM 0500-CHECK-FOR-HEADINGS.
102820     IF PRINT-COLUMN-HEAD
102830       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
102840       IF WS-LINE-COUNT GREATER +3
102850         MOVE +2 TO WS-LINE-SPACER
102860       END-IF
102870       MOVE WS-896-C2 TO PRINTER1-RECORD
102880       PERFORM 0600-WRITE-PRINTER1-RECORD
102890       MOVE +1 TO WS-LINE-SPACER
102900       MOVE WS-896-D2 TO PRINTER1-RECORD
102910       PERFORM 0600-WRITE-PRINTER1-RECORD.
102920     MOVE WS-896-REPORT-NBR TO WS-896-P2-REPORT-NBR.
102930     MOVE WS-896-RECORD-TYPE TO WS-896-P2-RECORD-TYPE.
102940     MOVE WS-896-B-D-REC-NBR TO WS-896-P2-REC-NBR.
102950     MOVE WS-896-UPDATE-DATE TO WS-896-P2-UPDATE-DATE.
102960     MOVE WS-896-B-COMMENT-LINE TO WS-896-P2-COMMENT-LINE.
102970     MOVE WS-896-P2 TO PRINTER1-RECORD.
102980*
102990   4815-FORMAT-896-C-REC.
103000     IF PRINT-COLUMN-HEAD
103010       MOVE +4 TO WS-LINES-NEEDED
103020     ELSE
103030       MOVE +1 TO WS-LINES-NEEDED.
103040     PERFORM 0500-CHECK-FOR-HEADINGS.
103050     IF PRINT-COLUMN-HEAD
103060       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
103070       IF WS-LINE-COUNT GREATER +3
103080         MOVE +2 TO WS-LINE-SPACER
103090       END-IF
103100       MOVE WS-896-C3 TO PRINTER1-RECORD
103110       PERFORM 0600-WRITE-PRINTER1-RECORD
103120       MOVE +1 TO WS-LINE-SPACER
103130       MOVE WS-896-D3 TO PRINTER1-RECORD
103140       PERFORM 0600-WRITE-PRINTER1-RECORD.
103150     MOVE WS-896-REPORT-NBR TO WS-896-P3-REPORT-NBR.
103160     MOVE WS-896-RECORD-TYPE TO WS-896-P3-RECORD-TYPE.
103170     MOVE WS-896-C-J-REC-NBR TO WS-896-P3-REC-NBR.
103180     MOVE WS-896-UPDATE-DATE TO WS-896-P3-UPDATE-DATE.
103190     MOVE WS-896-C-ALT-ADDR-FLG TO WS-896-P3-ALT-ADDR-FLG.
103200     MOVE WS-896-C-BRANCH-NBR TO WS-896-P3-BRANCH-NBR.
103210     MOVE WS-896-C-LBL-LN-1-OR-4 TO WS-896-P3-LBL-LN-1-OR-4.
103220     MOVE WS-896-C-LBL-LN-2-OR-5 TO WS-896-P3-LBL-LN-2-OR-5.
103230     MOVE WS-896-C-LBL-LN-3-OR-6 TO WS-896-P3-LBL-LN-3-OR-6.
103240     MOVE WS-896-C-BARCODE-ZIP TO WS-896-P3-BARCODE-ZIP.
103250     MOVE WS-896-P3 TO PRINTER1-RECORD.
103260*
103270   4820-FORMAT-896-D-REC.
103280     IF PRINT-COLUMN-HEAD
103290       MOVE +4 TO WS-LINES-NEEDED
103300     ELSE
103310       MOVE +1 TO WS-LINES-NEEDED.
103320     PERFORM 0500-CHECK-FOR-HEADINGS.
103330     IF PRINT-COLUMN-HEAD
103340       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
103350       IF WS-LINE-COUNT GREATER +3
103360         MOVE +2 TO WS-LINE-SPACER
103370       END-IF
103380       MOVE WS-896-C4 TO PRINTER1-RECORD
103390       PERFORM 0600-WRITE-PRINTER1-RECORD
103400       MOVE +1 TO WS-LINE-SPACER
103410       MOVE WS-896-D4 TO PRINTER1-RECORD
103420       PERFORM 0600-WRITE-PRINTER1-RECORD.
103430     MOVE WS-896-REPORT-NBR TO WS-896-P4-REPORT-NBR.
103440     MOVE WS-896-RECORD-TYPE TO WS-896-P4-RECORD-TYPE.
103450     MOVE WS-896-B-D-REC-NBR TO WS-896-P4-REC-NBR.
103460     MOVE WS-896-UPDATE-DATE TO WS-896-P4-UPDATE-DATE.
103470     MOVE WS-896-D-HEADING-TEXT TO WS-896-P4-HEADING-TEXT.
103480     MOVE WS-896-P4 TO PRINTER1-RECORD.
103490*
103500   4825-FORMAT-896-E-REC.
103510     IF PRINT-COLUMN-HEAD
103520       MOVE +4 TO WS-LINES-NEEDED
103530     ELSE
103540       MOVE +1 TO WS-LINES-NEEDED.
103550     PERFORM 0500-CHECK-FOR-HEADINGS.
103560     IF PRINT-COLUMN-HEAD
103570       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
103580       IF WS-LINE-COUNT GREATER +3
103590         MOVE +2 TO WS-LINE-SPACER
103600       END-IF
103610       MOVE WS-896-C5 TO PRINTER1-RECORD
103620       PERFORM 0600-WRITE-PRINTER1-RECORD
103630       MOVE +1 TO WS-LINE-SPACER
103640       MOVE WS-896-D5 TO PRINTER1-RECORD
103650       PERFORM 0600-WRITE-PRINTER1-RECORD.
103660     MOVE WS-896-REPORT-NBR TO WS-896-P5-REPORT-NBR.
103670     MOVE WS-896-RECORD-TYPE TO WS-896-P5-RECORD-TYPE.
103680     MOVE WS-896-UPDATE-DATE TO WS-896-P5-UPDATE-DATE.
103690     MOVE WS-896-E-DTL-COL-01 TO WS-896-P5-DTL-COL-01.
103700     MOVE WS-896-E-DTL-COL-02 TO WS-896-P5-DTL-COL-02.
103710     MOVE WS-896-E-DTL-COL-03 TO WS-896-P5-DTL-COL-03.
103720     MOVE WS-896-E-DTL-COL-04 TO WS-896-P5-DTL-COL-04.
103730     MOVE WS-896-E-DTL-COL-05 TO WS-896-P5-DTL-COL-05.
103740     MOVE WS-896-E-DTL-COL-06 TO WS-896-P5-DTL-COL-06.
103750     MOVE WS-896-E-DTL-COL-07 TO WS-896-P5-DTL-COL-07.
103760     MOVE WS-896-E-DTL-COL-08 TO WS-896-P5-DTL-COL-08.
103770     MOVE WS-896-E-DTL-COL-09 TO WS-896-P5-DTL-COL-09.
103780     MOVE WS-896-E-DTL-COL-10 TO WS-896-P5-DTL-COL-10.
103790     MOVE WS-896-E-DTL-COL-11 TO WS-896-P5-DTL-COL-11.
103800     MOVE WS-896-E-DTL-COL-12 TO WS-896-P5-DTL-COL-12.
103810     MOVE WS-896-E-DTL-COL-13 TO WS-896-P5-DTL-COL-13.
103820     MOVE WS-896-E-SUM-COL-01 TO WS-896-P5-SUM-COL-01.
103830     MOVE WS-896-E-SUM-COL-02 TO WS-896-P5-SUM-COL-02.
103840     MOVE WS-896-E-SUM-COL-03 TO WS-896-P5-SUM-COL-03.
103850     MOVE WS-896-E-SUM-COL-04 TO WS-896-P5-SUM-COL-04.
103860     MOVE WS-896-E-SUM-COL-05 TO WS-896-P5-SUM-COL-05.
103870     MOVE WS-896-E-SUM-COL-06 TO WS-896-P5-SUM-COL-06.
103880     MOVE WS-896-E-SUM-COL-07 TO WS-896-P5-SUM-COL-07.
103890     MOVE WS-896-E-SUM-COL-08 TO WS-896-P5-SUM-COL-08.
103900     MOVE WS-896-E-SUM-COL-09 TO WS-896-P5-SUM-COL-09.
103910     MOVE WS-896-E-SUM-COL-10 TO WS-896-P5-SUM-COL-10.
103920     MOVE WS-896-E-SUM-COL-11 TO WS-896-P5-SUM-COL-11.
103930     MOVE WS-896-E-SUM-COL-12 TO WS-896-P5-SUM-COL-12.
103940     MOVE WS-896-E-SUM-COL-13 TO WS-896-P5-SUM-COL-13.
103950     MOVE WS-896-P5 TO PRINTER1-RECORD.
103960*
103970   4830-FORMAT-896-F-REC.
103980     IF PRINT-COLUMN-HEAD
103990       MOVE +4 TO WS-LINES-NEEDED
104000     ELSE
104010       MOVE +1 TO WS-LINES-NEEDED.
104020     PERFORM 0500-CHECK-FOR-HEADINGS.
104030     IF PRINT-COLUMN-HEAD
104040       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
104050       IF WS-LINE-COUNT GREATER +3
104060         MOVE +2 TO WS-LINE-SPACER
104070       END-IF
104080       MOVE WS-896-C6 TO PRINTER1-RECORD
104090       PERFORM 0600-WRITE-PRINTER1-RECORD
104100       MOVE +1 TO WS-LINE-SPACER
104110       MOVE WS-896-D6 TO PRINTER1-RECORD
104120       PERFORM 0600-WRITE-PRINTER1-RECORD.
104130     MOVE WS-896-REPORT-NBR TO WS-896-P6-REPORT-NBR.
104140     MOVE WS-896-RECORD-TYPE TO WS-896-P6-RECORD-TYPE.
104150     MOVE WS-896-F-COL-CD TO WS-896-P6-COL-CD.
104160     MOVE WS-896-UPDATE-DATE TO WS-896-P6-UPDATE-DATE.
104170     MOVE WS-896-F-HD-1-OVERRIDE TO WS-896-P6-HD-1-OVERRIDE.
104180     MOVE WS-896-F-HD-2-OVERRIDE TO WS-896-P6-HD-2-OVERRIDE.
104190     MOVE WS-896-F-HD-3-OVERRIDE TO WS-896-P6-HD-3-OVERRIDE.
104200     MOVE WS-896-P6 TO PRINTER1-RECORD.
104210*
104220   4835-FORMAT-896-G-REC.
104230     IF PRINT-COLUMN-HEAD
104240       MOVE +4 TO WS-LINES-NEEDED
104250     ELSE
104260       MOVE +1 TO WS-LINES-NEEDED.
104270     PERFORM 0500-CHECK-FOR-HEADINGS.
104280     IF PRINT-COLUMN-HEAD
104290       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
104300       IF WS-LINE-COUNT GREATER +3
104310         MOVE +2 TO WS-LINE-SPACER
104320       END-IF
104330       MOVE WS-896-C7 TO PRINTER1-RECORD
104340       PERFORM 0600-WRITE-PRINTER1-RECORD
104350       MOVE +1 TO WS-LINE-SPACER
104360       MOVE WS-896-D7 TO PRINTER1-RECORD
104370       PERFORM 0600-WRITE-PRINTER1-RECORD.
104380     MOVE WS-896-REPORT-NBR TO WS-896-P7-REPORT-NBR.
104390     MOVE WS-896-RECORD-TYPE TO WS-896-P7-RECORD-TYPE.
104400     MOVE WS-896-UPDATE-DATE TO WS-896-P7-UPDATE-DATE.
104410     MOVE WS-896-G-SUM-FTNOTE TO WS-896-P7-SUM-FTNOTE.
104420     MOVE WS-896-P7 TO PRINTER1-RECORD.
104430*
104440   4840-FORMAT-896-H-REC.
104450     IF PRINT-COLUMN-HEAD
104460       MOVE +4 TO WS-LINES-NEEDED
104470     ELSE
104480       MOVE +1 TO WS-LINES-NEEDED.
104490     PERFORM 0500-CHECK-FOR-HEADINGS.
104500     IF PRINT-COLUMN-HEAD
104510       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
104520       IF WS-LINE-COUNT GREATER +3
104530         MOVE +2 TO WS-LINE-SPACER
104540       END-IF
104550       MOVE WS-896-C8 TO PRINTER1-RECORD
104560       PERFORM 0600-WRITE-PRINTER1-RECORD
104570       MOVE +1 TO WS-LINE-SPACER
104580       MOVE WS-896-D8 TO PRINTER1-RECORD
104590       PERFORM 0600-WRITE-PRINTER1-RECORD.
104600     MOVE WS-896-REPORT-NBR TO WS-896-P8-REPORT-NBR.
104610     MOVE WS-896-RECORD-TYPE TO WS-896-P8-RECORD-TYPE.
104620     MOVE WS-896-H-CAT-CD TO WS-896-P8-CAT-CD.
104630     MOVE WS-896-UPDATE-DATE TO WS-896-P8-UPDATE-DATE.
104640     MOVE WS-896-H-CAT-TITLE TO WS-896-P8-CAT-TITLE.
104650     MOVE WS-896-P8 TO PRINTER1-RECORD.
104660*
104670   4845-FORMAT-896-I-REC.
104680     IF PRINT-COLUMN-HEAD
104690       MOVE +5 TO WS-LINES-NEEDED
104700     ELSE
104710       MOVE +1 TO WS-LINES-NEEDED.
104720     PERFORM 0500-CHECK-FOR-HEADINGS.
104730     IF PRINT-COLUMN-HEAD
104740       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
104750       IF WS-LINE-COUNT GREATER +3
104760         MOVE +2 TO WS-LINE-SPACER
104770       END-IF
104780       MOVE WS-896-C9A TO PRINTER1-RECORD
104790       PERFORM 0600-WRITE-PRINTER1-RECORD
104800       MOVE +1 TO WS-LINE-SPACER
104810       MOVE WS-896-C9B TO PRINTER1-RECORD
104820       PERFORM 0600-WRITE-PRINTER1-RECORD
104830       MOVE WS-896-D9 TO PRINTER1-RECORD
104840       PERFORM 0600-WRITE-PRINTER1-RECORD.
104850     MOVE WS-896-REPORT-NBR TO WS-896-P9-REPORT-NBR.
104860     MOVE WS-896-RECORD-TYPE TO WS-896-P9-RECORD-TYPE.
104870     MOVE WS-896-I-RP-LV TO WS-896-P9-RP-LV.
104880     MOVE WS-896-UPDATE-DATE TO WS-896-P9-UPDATE-DATE.
104890     MOVE WS-896-I-RPT-SEL TO WS-896-P9-RPT-SEL.
104900     MOVE WS-896-I-DTL-PROD-TOT TO WS-896-P9-DTL-PROD-TOT.
104910     MOVE WS-896-I-DTL-CAT-TOT TO WS-896-P9-DTL-CAT-TOT.
104920     MOVE WS-896-I-DTL-FI-TOT TO WS-896-P9-DTL-FI-TOT.
104930     MOVE WS-896-I-SUM-TOT-OPT TO WS-896-P9-SUM-TOT-OPT.
104940     MOVE WS-896-I-SUM-RECAP-LVL TO WS-896-P9-SUM-RECAP-LVL.
104950     MOVE WS-896-I-RECAP-TOT-OPT TO WS-896-P9-RECAP-TOT-OPT.
104960     MOVE WS-896-I-RECAP-PG-BRK TO WS-896-P9-RECAP-PG-BRK.
104970     MOVE WS-896-I-OMIT-INSTR TO WS-896-P9-OMIT-INSTR.
104980     MOVE WS-896-I-OMIT-CATS TO WS-896-P9-OMIT-CATS.
104990     MOVE WS-896-P9 TO PRINTER1-RECORD.
105000*
105010   4850-FORMAT-896-J-REC.
105020     IF PRINT-COLUMN-HEAD
105030       MOVE +5 TO WS-LINES-NEEDED
105040     ELSE
105050       MOVE +1 TO WS-LINES-NEEDED.
105060     PERFORM 0500-CHECK-FOR-HEADINGS.
105070     IF PRINT-COLUMN-HEAD
105080       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
105090       IF WS-LINE-COUNT GREATER +3
105100         MOVE +2 TO WS-LINE-SPACER
105110       END-IF
105120       MOVE WS-896-C10A TO PRINTER1-RECORD
105130       PERFORM 0600-WRITE-PRINTER1-RECORD
105140       MOVE +1 TO WS-LINE-SPACER
105150       MOVE WS-896-C10B TO PRINTER1-RECORD
105160       PERFORM 0600-WRITE-PRINTER1-RECORD
105170       MOVE WS-896-D10 TO PRINTER1-RECORD
105180       PERFORM 0600-WRITE-PRINTER1-RECORD.
105190     MOVE WS-896-REPORT-NBR TO WS-896-P10-REPORT-NBR.
105200     MOVE WS-896-RECORD-TYPE TO WS-896-P10-RECORD-TYPE.
105210     MOVE WS-896-C-J-REC-NBR TO WS-896-P10-REC-NBR.
105220     MOVE WS-896-UPDATE-DATE TO WS-896-P10-UPDATE-DATE.
105230     MOVE WS-896-J-ASSIGN-CAT TO WS-896-P10-ASSIGN-CAT.
105240     MOVE WS-896-J-MATCH-BC TO WS-896-P10-M-BC.
105250     MOVE WS-896-J-MATCH-PRI-BR TO WS-896-P10-M-PRI-BR.
105260     MOVE WS-896-J-MATCH-SEC-BR TO WS-896-P10-M-SEC-BR.
105270     MOVE WS-896-J-MATCH-BIL-TYP TO WS-896-P10-M-BIL-TYP.
105280     MOVE WS-896-J-MATCH-PROD-CD TO WS-896-P10-M-PROD-CD.
105290     MOVE WS-896-J-MATCH-BL-ACCT TO WS-896-P10-M-BL-ACCT.
105300     MOVE WS-896-J-MATCH-PR-ACCT TO WS-896-P10-M-PR-ACCT.
105310     MOVE WS-896-J-MATCH-PUR-ORD TO WS-896-P10-M-PUR-ORD.
105320     MOVE WS-896-J-MATCH-BIL-MED TO WS-896-P10-M-BIL-MED.
105330     MOVE WS-896-J-MATCH-AOE-FLG TO WS-896-P10-M-AOE-FLG.
105340     MOVE WS-896-J-MATCH-REORDER TO WS-896-P10-M-REORDER.
105350     MOVE WS-896-J-MATCH-NACHA TO WS-896-P10-M-NACHA.
105360     MOVE WS-896-J-MATCH-CR-FLAG TO WS-896-P10-M-CR-FLAG.
105370     MOVE WS-896-J-MATCH-SEP-INV TO WS-896-P10-M-SEP-INV.
105380     MOVE WS-896-J-MATCH-DW-FLAG TO WS-896-P10-M-D-WV-FLG.
105390     MOVE WS-896-P10 TO PRINTER1-RECORD.
105400*
105410   4860-CHECK-CPO-C850-TABLES.
105420     MOVE SPACE TO WS-C850-INST-TYP.
105430     IF WS-C850-BC-ENTRY-COUNT NOT EQUAL +0
105440       SEARCH ALL WS-C850-BC-TBL-ENTRY
105450         WHEN WS-C850-BC-TBL-BC (IX-WS-C850-BC-TBL)
105460               EQUAL WS-IPARM-BC
105470           MOVE WS-C850-BC-TBL-ENTRY (IX-WS-C850-BC-TBL)
105480                 TO WS-C850-ENTRY.
105490     IF (WS-C850-HC-ENTRY-COUNT NOT EQUAL +0)
105500         AND (WS-C850-INST-TYP EQUAL SPACE)
105510         AND (WS-HOLDING-COMPANY NOT EQUAL SPACE)
105520       SEARCH ALL WS-C850-HC-TBL-ENTRY
105530         WHEN WS-C850-HC-TBL-HC (IX-WS-C850-HC-TBL)
105540               EQUAL WS-HOLDING-COMPANY
105550           MOVE WS-C850-HC-TBL-ENTRY (IX-WS-C850-HC-TBL)
105560                 TO WS-C850-ENTRY.
105570     IF WS-C850-INST-TYP NOT EQUAL SPACE
105580       PERFORM 4861-REPORT-C850-CARD
105590       IF (WS-C850-CONSID-NBR NOT EQUAL SPACE)
105600           AND (WS-C851-ENTRY-COUNT NOT EQUAL +0)
105610         SEARCH ALL WS-C851-TBL-ENTRY
105620           WHEN WS-C851-TBL-CONSID-NBR (IX-WS-C851-TBL)
105630                 EQUAL WS-C850-CONSID-NBR
105640             MOVE WS-C851-TBL-ENTRY (IX-WS-C851-TBL)
105650                   TO WS-C851-ENTRY
105660             PERFORM 4862-REPORT-C851-CARD.
105670*
105680   4861-REPORT-C850-CARD.
105690     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
105700     MOVE '850C FILE: ' TO WS-FILE-HD-FILE-NBR.
105710     MOVE 'CPO - CONSID NUMBER ASSIGNMENT'
105720           TO WS-FILE-HD-FILE-NAME.
105730     MOVE +3 TO WS-LINES-NEEDED.
105740     PERFORM 0500-CHECK-FOR-HEADINGS.
105750     MOVE SPACE TO WS-COLUMN-HEAD-FLAG.
105760     MOVE WS-850P-C1 TO PRINTER1-RECORD.
105770     PERFORM 0600-WRITE-PRINTER1-RECORD.
105780     MOVE WS-850P-D1 TO PRINTER1-RECORD.
105790     PERFORM 0600-WRITE-PRINTER1-RECORD.
105800     MOVE WS-C850-INST-TYP TO WS-850P-P1-INST-TYP.
105810     MOVE WS-C850-INST-BC TO WS-850P-P1-INST-BC.
105820     MOVE WS-C850-CONSID-NBR TO WS-850P-P1-CONSID-NBR.
105830     MOVE WS-850P-P1 TO PRINTER1-RECORD.
105840     PERFORM 0600-WRITE-PRINTER1-RECORD.
105850*
105860   4862-REPORT-C851-CARD.
105870     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
105880     MOVE '851C FILE: ' TO WS-FILE-HD-FILE-NBR.
105890     MOVE 'CPO - CONTROL' TO WS-FILE-HD-FILE-NAME.
105900     MOVE +3 TO WS-LINES-NEEDED.
105910     PERFORM 0500-CHECK-FOR-HEADINGS.
105920     MOVE SPACE TO WS-COLUMN-HEAD-FLAG.
105930     MOVE WS-851P-C1 TO PRINTER1-RECORD.
105940     PERFORM 0600-WRITE-PRINTER1-RECORD.
105950     MOVE WS-851P-D1 TO PRINTER1-RECORD.
105960     PERFORM 0600-WRITE-PRINTER1-RECORD.
105970     MOVE WS-C851-CONSID-NBR TO WS-851P-P1-CONSID-NBR.
105980     MOVE WS-C851-CLIENT-SHR-PCT TO WS-851P-P1-CLI-SHR-PCT.
105990     MOVE WS-C851-SETTLEMENT-FREQ TO WS-851P-P1-FREQ.
106000     MOVE WS-C851-HOLD-DAYS TO WS-851P-P1-HOLD-DAYS.
106010     MOVE WS-851P-P1 TO PRINTER1-RECORD.
106020     PERFORM 0600-WRITE-PRINTER1-RECORD.
106030*
106040   4900-CHECK-C761-TABLE.
106050     MOVE 'C761C ' TO WS-761P-P1-MEMBER.
106060     SET IX-WS-C761-TBL TO +1.
106070     PERFORM
106080         WS-C761-ENTRY-COUNT TIMES
106090       IF ((WS-C761-BC (IX-WS-C761-TBL) EQUAL WS-IPARM-BC)
106100           OR ((WS-C761-BC (IX-WS-C761-TBL) EQUAL SPACE)
106110               AND (((WS-C761-MASTER-BC (IX-WS-C761-TBL) EQUAL
106120                     WS-FI-MASTER-BC) AND
106130                     (WS-C761-HOLDCO (IX-WS-C761-TBL) EQUAL
106140                       SPACE OR WS-HOLDING-COMPANY))
106150                   OR ((WS-C761-MASTER-BC (IX-WS-C761-TBL) EQUAL
106160                         SPACE)
106170                       AND (WS-HOLDING-COMPANY NOT EQUAL SPACE)
106180                       AND (WS-C761-HOLDCO (IX-WS-C761-TBL) EQUAL
106190                             WS-HOLDING-COMPANY)))))
106200         PERFORM 4910-REPORT-C761-ENTRY
106210       END-IF
106220       SET IX-WS-C761-TBL UP BY 1
106230     END-PERFORM.
106240*
106250   4910-REPORT-C761-ENTRY.
106260     IF PRINT-COLUMN-HEAD
106270       MOVE +3 TO WS-LINES-NEEDED
106280     ELSE
106290       MOVE +1 TO WS-LINES-NEEDED.
106300     PERFORM 0500-CHECK-FOR-HEADINGS.
106310     IF PRINT-COLUMN-HEAD
106320       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
106330       MOVE WS-761P-C1 TO PRINTER1-RECORD
106340       PERFORM 0600-WRITE-PRINTER1-RECORD
106350       MOVE WS-761P-D1 TO PRINTER1-RECORD
106360       PERFORM 0600-WRITE-PRINTER1-RECORD.
106370     MOVE WS-C761-HOLDCO (IX-WS-C761-TBL) TO WS-761P-P1-HOLDCO.
106380     MOVE WS-C761-HC-DIV-1 (IX-WS-C761-TBL) TO
106390           WS-761P-P1-HC-DIV-1.
106400     MOVE WS-C761-HC-DIV-2 (IX-WS-C761-TBL) TO
106410           WS-761P-P1-HC-DIV-2.
106420     MOVE WS-C761-HC-DIV-3 (IX-WS-C761-TBL) TO
106430           WS-761P-P1-HC-DIV-3.
106440     MOVE WS-C761-MASTER-BC (IX-WS-C761-TBL) TO
106450           WS-761P-P1-MASTER-BC.
106460     MOVE WS-C761-FI-DIV-1 (IX-WS-C761-TBL) TO
106470           WS-761P-P1-FI-DIV-1.
106480     MOVE WS-C761-FI-DIV-2 (IX-WS-C761-TBL) TO
106490           WS-761P-P1-FI-DIV-2.
106500     MOVE WS-C761-FI-DIV-3 (IX-WS-C761-TBL) TO
106510           WS-761P-P1-FI-DIV-3.
106520     MOVE WS-C761-BC (IX-WS-C761-TBL) TO WS-761P-P1-BC.
106530     MOVE WS-C761-PRI-BR (IX-WS-C761-TBL) TO WS-761P-P1-PRI-BR.
106540     MOVE WS-C761-SEC-BR (IX-WS-C761-TBL) TO WS-761P-P1-SEC-BR.
106550     MOVE WS-C761-BILL-TYPE (IX-WS-C761-TBL) TO
106560           WS-761P-P1-BILL-TYPE.
106570     MOVE WS-C761-CONSID-NBR-1 (IX-WS-C761-TBL) TO
106580           WS-761P-P1-CONSID-NBR-1.
106590     MOVE WS-C761-CONSID-NBR-2 (IX-WS-C761-TBL) TO
106600           WS-761P-P1-CONSID-NBR-2.
106610     MOVE WS-C761-CONSID-NBR-3 (IX-WS-C761-TBL) TO
106620           WS-761P-P1-CONSID-NBR-3.
106630     MOVE WS-C761-CONSID-NBR-4 (IX-WS-C761-TBL) TO
106640           WS-761P-P1-CONSID-NBR-4.
106650     MOVE WS-C761-CONSID-NBR-5 (IX-WS-C761-TBL) TO
106660           WS-761P-P1-CONSID-NBR-5.
106670     MOVE WS-C761-CONSID-NBR-6 (IX-WS-C761-TBL) TO
106680           WS-761P-P1-CONSID-NBR-6.
106690     MOVE WS-C761-CONSID-NBR-7 (IX-WS-C761-TBL) TO
106700           WS-761P-P1-CONSID-NBR-7.
106710     IF WS-761P-P1-CONSID-NBR-1 NOT EQUAL SPACE
106720       MOVE WS-761P-P1-CONSID-NBR-1 TO WS-CONSID-NBR
106730       PERFORM 4920-STORE-CONSID-NBR.
106740     IF WS-761P-P1-CONSID-NBR-2 NOT EQUAL SPACE
106750       MOVE WS-761P-P1-CONSID-NBR-2 TO WS-CONSID-NBR
106760       PERFORM 4920-STORE-CONSID-NBR.
106770     IF WS-761P-P1-CONSID-NBR-3 NOT EQUAL SPACE
106780       MOVE WS-761P-P1-CONSID-NBR-3 TO WS-CONSID-NBR
106790       PERFORM 4920-STORE-CONSID-NBR.
106800     IF WS-761P-P1-CONSID-NBR-4 NOT EQUAL SPACE
106810       MOVE WS-761P-P1-CONSID-NBR-4 TO WS-CONSID-NBR
106820       PERFORM 4920-STORE-CONSID-NBR.
106830     IF WS-761P-P1-CONSID-NBR-5 NOT EQUAL SPACE
106840       MOVE WS-761P-P1-CONSID-NBR-5 TO WS-CONSID-NBR
106850       PERFORM 4920-STORE-CONSID-NBR.
106860     IF WS-761P-P1-CONSID-NBR-6 NOT EQUAL SPACE
106870       MOVE WS-761P-P1-CONSID-NBR-6 TO WS-CONSID-NBR
106880       PERFORM 4920-STORE-CONSID-NBR.
106890     IF WS-761P-P1-CONSID-NBR-7 NOT EQUAL SPACE
106900       MOVE WS-761P-P1-CONSID-NBR-7 TO WS-CONSID-NBR
106910       PERFORM 4920-STORE-CONSID-NBR.
106920     MOVE WS-761P-P1 TO PRINTER1-RECORD.
106930     PERFORM 0600-WRITE-PRINTER1-RECORD.
106940*
106950   4920-STORE-CONSID-NBR.
106960     SET IX-WS-CONSID-NBR-CURR TO +1.
106970     PERFORM
106980         WITH TEST BEFORE
106990         UNTIL (IX-WS-CONSID-NBR-CURR NOT LESS
107000               IX-WS-CONSID-NBR-EMPTY)
107010             OR (WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-CURR)
107020                   NOT LESS WS-CONSID-NBR)
107030       SET IX-WS-CONSID-NBR-CURR UP BY 1
107040     END-PERFORM.
107050     IF (IX-WS-CONSID-NBR-CURR NOT LESS IX-WS-CONSID-NBR-EMPTY)
107060         OR (WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-CURR)
107070               NOT EQUAL WS-CONSID-NBR)
107080*                * REPORT NBR NOT YET IN TABLE *
107090       IF IX-WS-CONSID-NBR-EMPTY NOT GREATER +40
107100*                * TABLE HAS ROOM FOR NEW REPORT NBR *
107110         IF IX-WS-CONSID-NBR-CURR LESS IX-WS-CONSID-NBR-EMPTY
107120*                * NEW REPORT NBR BELONGS OTHER THAN AT THE END,
107130*                 SHIFT EXISTING ENTRIES TO MAKE ROOM FOR IT *
107140           SET IX-WS-CONSID-NBR-FROM TO IX-WS-CONSID-NBR-EMPTY
107150           PERFORM
107160               WITH TEST AFTER
107170               UNTIL IX-WS-CONSID-NBR-FROM NOT GREATER
107180                     IX-WS-CONSID-NBR-CURR
107190             SET IX-WS-CONSID-NBR-TO TO IX-WS-CONSID-NBR-FROM
107200             SET IX-WS-CONSID-NBR-FROM DOWN BY 1
107210             MOVE WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-FROM) TO
107220                   WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-TO)
107230           END-PERFORM
107240         END-IF
107250         MOVE WS-CONSID-NBR TO
107260               WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-CURR)
107270         SET IX-WS-CONSID-NBR-EMPTY UP BY 1
107280         ADD +1 TO WS-CONSID-TABLE-COUNT
107290       ELSE
107300         DISPLAY '* CONSID NUMBER TABLE OVERFLOWED FOR BC# '
107310               WS-IPARM-BC '" *' UPON SYSOUT
107320         GO TO 9900-DISPLAY-ABORT.
107330*
107340   4950-CHECK-C761A-TABLE.
107350     MOVE 'C761C2' TO WS-761P-P1-MEMBER.
107360     SET IX-WS-C761A-TBL TO +1.
107370     PERFORM
107380         WS-C761A-ENTRY-COUNT TIMES
107390       IF ((WS-C761A-BC (IX-WS-C761A-TBL) EQUAL WS-IPARM-BC)
107400           OR ((WS-C761A-BC (IX-WS-C761A-TBL) EQUAL SPACE)
107410               AND (((WS-C761A-MASTER-BC (IX-WS-C761A-TBL) EQUAL
107420                     WS-FI-MASTER-BC) AND
107430                     (WS-C761A-HOLDCO (IX-WS-C761A-TBL) EQUAL
107440                       SPACE OR WS-HOLDING-COMPANY))
107450                   OR ((WS-C761A-MASTER-BC (IX-WS-C761A-TBL) EQUAL
107460                         SPACE)
107470                       AND (WS-HOLDING-COMPANY NOT EQUAL SPACE)
107480                       AND (WS-C761A-HOLDCO (IX-WS-C761A-TBL)
107490                             EQUAL WS-HOLDING-COMPANY)))))
107500         PERFORM 4960-REPORT-C761A-ENTRY
107510       END-IF
107520       SET IX-WS-C761A-TBL UP BY 1
107530     END-PERFORM.
107540*
107550   4960-REPORT-C761A-ENTRY.
107560     IF PRINT-COLUMN-HEAD
107570       MOVE +3 TO WS-LINES-NEEDED
107580     ELSE
107590       MOVE +1 TO WS-LINES-NEEDED.
107600     PERFORM 0500-CHECK-FOR-HEADINGS.
107610     IF PRINT-COLUMN-HEAD
107620       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
107630       MOVE WS-761P-C1 TO PRINTER1-RECORD
107640       PERFORM 0600-WRITE-PRINTER1-RECORD
107650       MOVE WS-761P-D1 TO PRINTER1-RECORD
107660       PERFORM 0600-WRITE-PRINTER1-RECORD.
107670     MOVE WS-C761A-HOLDCO (IX-WS-C761A-TBL) TO WS-761P-P1-HOLDCO.
107680     MOVE WS-C761A-HC-DIV-1 (IX-WS-C761A-TBL) TO
107690           WS-761P-P1-HC-DIV-1.
107700     MOVE WS-C761A-HC-DIV-2 (IX-WS-C761A-TBL) TO
107710           WS-761P-P1-HC-DIV-2.
107720     MOVE WS-C761A-HC-DIV-3 (IX-WS-C761A-TBL) TO
107730           WS-761P-P1-HC-DIV-3.
107740     MOVE WS-C761A-MASTER-BC (IX-WS-C761A-TBL) TO
107750           WS-761P-P1-MASTER-BC.
107760     MOVE WS-C761A-FI-DIV-1 (IX-WS-C761A-TBL) TO
107770           WS-761P-P1-FI-DIV-1.
107780     MOVE WS-C761A-FI-DIV-2 (IX-WS-C761A-TBL) TO
107790           WS-761P-P1-FI-DIV-2.
107800     MOVE WS-C761A-FI-DIV-3 (IX-WS-C761A-TBL) TO
107810           WS-761P-P1-FI-DIV-3.
107820     MOVE WS-C761A-BC (IX-WS-C761A-TBL) TO WS-761P-P1-BC.
107830     MOVE WS-C761A-PRI-BR (IX-WS-C761A-TBL) TO WS-761P-P1-PRI-BR.
107840     MOVE WS-C761A-SEC-BR (IX-WS-C761A-TBL) TO WS-761P-P1-SEC-BR.
107850     MOVE WS-C761A-BILL-TYPE (IX-WS-C761A-TBL) TO
107860           WS-761P-P1-BILL-TYPE.
107870     MOVE WS-C761A-CONSID-NBR-1 (IX-WS-C761A-TBL) TO
107880           WS-761P-P1-CONSID-NBR-1.
107890     MOVE WS-C761A-CONSID-NBR-2 (IX-WS-C761A-TBL) TO
107900           WS-761P-P1-CONSID-NBR-2.
107910     MOVE WS-C761A-CONSID-NBR-3 (IX-WS-C761A-TBL) TO
107920           WS-761P-P1-CONSID-NBR-3.
107930     MOVE WS-C761A-CONSID-NBR-4 (IX-WS-C761A-TBL) TO
107940           WS-761P-P1-CONSID-NBR-4.
107950     MOVE WS-C761A-CONSID-NBR-5 (IX-WS-C761A-TBL) TO
107960           WS-761P-P1-CONSID-NBR-5.
107970     MOVE WS-C761A-CONSID-NBR-6 (IX-WS-C761A-TBL) TO
107980           WS-761P-P1-CONSID-NBR-6.
107990     MOVE WS-C761A-CONSID-NBR-7 (IX-WS-C761A-TBL) TO
108000           WS-761P-P1-CONSID-NBR-7.
108010     IF WS-761P-P1-CONSID-NBR-1 NOT EQUAL SPACE
108020       MOVE WS-761P-P1-CONSID-NBR-1 TO WS-CONSID-NBR
108030       PERFORM 4920-STORE-CONSID-NBR.
108040     IF WS-761P-P1-CONSID-NBR-2 NOT EQUAL SPACE
108050       MOVE WS-761P-P1-CONSID-NBR-2 TO WS-CONSID-NBR
108060       PERFORM 4920-STORE-CONSID-NBR.
108070     IF WS-761P-P1-CONSID-NBR-3 NOT EQUAL SPACE
108080       MOVE WS-761P-P1-CONSID-NBR-3 TO WS-CONSID-NBR
108090       PERFORM 4920-STORE-CONSID-NBR.
108100     IF WS-761P-P1-CONSID-NBR-4 NOT EQUAL SPACE
108110       MOVE WS-761P-P1-CONSID-NBR-4 TO WS-CONSID-NBR
108120       PERFORM 4920-STORE-CONSID-NBR.
108130     IF WS-761P-P1-CONSID-NBR-5 NOT EQUAL SPACE
108140       MOVE WS-761P-P1-CONSID-NBR-5 TO WS-CONSID-NBR
108150       PERFORM 4920-STORE-CONSID-NBR.
108160     IF WS-761P-P1-CONSID-NBR-6 NOT EQUAL SPACE
108170       MOVE WS-761P-P1-CONSID-NBR-6 TO WS-CONSID-NBR
108180       PERFORM 4920-STORE-CONSID-NBR.
108190     IF WS-761P-P1-CONSID-NBR-7 NOT EQUAL SPACE
108200       MOVE WS-761P-P1-CONSID-NBR-7 TO WS-CONSID-NBR
108210       PERFORM 4920-STORE-CONSID-NBR.
108220     MOVE WS-761P-P1 TO PRINTER1-RECORD.
108230     PERFORM 0600-WRITE-PRINTER1-RECORD.
108240*
108250*
108260   5000-CHECK-877-TABLE.
108270     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
108280     MOVE SPACE TO WS-PREV-RECORD-TYPE.
108290     MOVE '877 FILE:  ' TO WS-FILE-HD-FILE-NBR.
108300     MOVE 'CONSIDERATION CONTROL FILE' TO WS-FILE-HD-FILE-NAME.
108310     SET IX-WS-877-TBL IX-WS-CONSID-NBR-CURR TO +1.
108320     PERFORM
108330         WITH TEST AFTER
108340         UNTIL IX-WS-CONSID-NBR-CURR NOT LESS
108350               IX-WS-CONSID-NBR-EMPTY
108360       MOVE WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-CURR) TO
108370             WS-CONSID-NBR
108380       SET IX-WS-CONSID-NBR-CURR UP BY 1
108390       PERFORM
108400           WITH TEST BEFORE
108410           UNTIL (IX-WS-877-TBL GREATER WS-877-ENTRY-COUNT)
108420               OR (WS-877-TBL-CONSID-NBR (IX-WS-877-TBL) NOT LESS
108430                     WS-CONSID-NBR)
108440         SET IX-WS-877-TBL UP BY 1
108450       END-PERFORM
108460       PERFORM
108470           WITH TEST BEFORE
108480           UNTIL (IX-WS-877-TBL GREATER WS-877-ENTRY-COUNT)
108490               OR (WS-877-TBL-CONSID-NBR (IX-WS-877-TBL) GREATER
108500                     WS-CONSID-NBR)
108510         MOVE WS-877-TBL-ENTRY (IX-WS-877-TBL) TO WS-877-REC
108520         SET IX-WS-877-TBL UP BY 1
108530         IF WS-877-REC-TYPE NOT EQUAL '4'
108540           IF WS-877-REC-TYPE NOT EQUAL WS-PREV-RECORD-TYPE
108550             MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
108560           END-IF
108570           IF WS-877-REC-TYPE LESS '3'
108580             IF WS-877-REC-TYPE LESS '2'
108590               PERFORM 5010-FORMAT-877-1-REC
108600             ELSE
108610               PERFORM 5020-FORMAT-877-2-REC
108620           ELSE
108630             IF WS-877-REC-TYPE LESS '5'
108640               PERFORM 5030-FORMAT-877-3-REC
108650             ELSE
108660               PERFORM 5050-FORMAT-877-5-REC
108670             END-IF
108680           END-IF
108690           MOVE WS-877-REC-TYPE TO WS-PREV-RECORD-TYPE
108700         ELSE
108710           IF WS-877-4-CONSID-TYPE NOT EQUAL WS-PREV-RECORD-TYPE
108720             MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
108730           END-IF
108740           IF WS-877-4-CONSID-TYPE EQUAL 'F'
108750             PERFORM 5040-FORMAT-877-4F-REC
108760           ELSE
108770             IF WS-877-4-CONSID-TYPE EQUAL 'G'
108780               PERFORM 5043-FORMAT-877-4G-REC
108790             ELSE
108800               PERFORM 5046-FORMAT-877-4T-REC
108810             END-IF
108820           END-IF
108830           MOVE WS-877-4-CONSID-TYPE TO WS-PREV-RECORD-TYPE
108840         END-IF
108850         PERFORM 0600-WRITE-PRINTER1-RECORD
108860       END-PERFORM
108870     END-PERFORM.
108880*
108890   5010-FORMAT-877-1-REC.
108900     IF PRINT-COLUMN-HEAD
108910       MOVE +5 TO WS-LINES-NEEDED
108920     ELSE
108930       MOVE +1 TO WS-LINES-NEEDED.
108940     PERFORM 0500-CHECK-FOR-HEADINGS.
108950     IF PRINT-COLUMN-HEAD
108960       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
108970       IF (WS-PREV-RECORD-TYPE NOT EQUAL SPACE)
108980             AND (WS-LINE-COUNT GREATER +3)
108990         MOVE +2 TO WS-LINE-SPACER
109000       END-IF
109010       MOVE WS-877-C1A TO PRINTER1-RECORD
109020       PERFORM 0600-WRITE-PRINTER1-RECORD
109030       MOVE +1 TO WS-LINE-SPACER
109040       MOVE WS-877-C1B TO PRINTER1-RECORD
109050       PERFORM 0600-WRITE-PRINTER1-RECORD
109060       MOVE WS-877-D1 TO PRINTER1-RECORD
109070       PERFORM 0600-WRITE-PRINTER1-RECORD.
109080     MOVE WS-877-CONSID-NBR TO WS-877-P1-CONSID-NBR.
109090     MOVE WS-877-REC-TYPE TO WS-877-P1-REC-TYPE.
109100     MOVE WS-877-RECORD-NBR TO WS-877-P1-RECORD-NBR.
109110     MOVE WS-877-UPDATE-DATE TO WS-877-P1-UPDATE-DATE.
109120     MOVE WS-877-1-CONSID-METH TO WS-877-P1-CONSID-METH.
109130     MOVE WS-877-1-CONSID-PERIOD TO WS-877-P1-CONSID-PERIOD.
109140     MOVE WS-877-1-YEAR-END-WK TO WS-877-P1-YEAR-END-WK.
109150     MOVE WS-877-1-CHECK-LEVEL TO WS-877-P1-CHECK-LEVEL.
109160     MOVE WS-877-1-CR-BC TO WS-877-P1-CR-BC.
109170     MOVE WS-877-1-CR-PRI-BR TO WS-877-P1-CR-PRI-BR.
109180     MOVE WS-877-1-CR-SEC-BR TO WS-877-P1-CR-SEC-BR.
109190     MOVE WS-877-1-CR-BILL-TYPE TO WS-877-P1-CR-BILL-TYPE.
109200     MOVE WS-877-1-CR-BILL-ACCT TO WS-877-P1-CR-BILL-ACCT.
109210     MOVE WS-877-1-ORG-NAME TO WS-877-P1-ORG-NAME.
109220     MOVE WS-877-1-PROG-START-DT TO WS-877-P1-PROG-START-DT.
109230     MOVE WS-877-1-PROG-END-DATE TO WS-877-P1-PROG-END-DATE.
109240     MOVE WS-877-1-PR-BKDWN-OPT TO WS-877-P1-PR-BKDWN-OPT.
109250     MOVE WS-877-1-PRICE-DESIG TO WS-877-P1-PRICE-DESIG.
109260     MOVE WS-877-1-LDGR-ACCT-2 TO WS-877-P1-LDGR-ACCT-2.
109270     MOVE WS-877-1-RPT-SEL TO WS-877-P1-RPT-SEL.
109280     MOVE WS-877-1-HC-GRP-OVER TO WS-877-P1-HC-GRP-OVER.
109290     MOVE WS-877-1-MBC-GRP-OVER TO WS-877-P1-MBC-GRP-OVER.
109300     MOVE WS-877-1-USE-PR-UNITS TO WS-877-P1-USE-PR-UNITS.
109310     MOVE WS-877-P1 TO PRINTER1-RECORD.
109320*
109330   5020-FORMAT-877-2-REC.
109340     IF PRINT-COLUMN-HEAD
109350       MOVE +5 TO WS-LINES-NEEDED
109360     ELSE
109370       MOVE +1 TO WS-LINES-NEEDED.
109380     PERFORM 0500-CHECK-FOR-HEADINGS.
109390     IF PRINT-COLUMN-HEAD
109400       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
109410       IF WS-LINE-COUNT GREATER +3
109420         MOVE +2 TO WS-LINE-SPACER
109430       END-IF
109440       MOVE WS-877-C2A TO PRINTER1-RECORD
109450       PERFORM 0600-WRITE-PRINTER1-RECORD
109460       MOVE +1 TO WS-LINE-SPACER
109470       MOVE WS-877-C2B TO PRINTER1-RECORD
109480       PERFORM 0600-WRITE-PRINTER1-RECORD
109490       MOVE WS-877-D2 TO PRINTER1-RECORD
109500       PERFORM 0600-WRITE-PRINTER1-RECORD.
109510     MOVE WS-877-CONSID-NBR TO WS-877-P2-CONSID-NBR.
109520     MOVE WS-877-REC-TYPE TO WS-877-P2-REC-TYPE.
109530     MOVE WS-877-RECORD-NBR TO WS-877-P2-RECORD-NBR.
109540     MOVE WS-877-UPDATE-DATE TO WS-877-P2-UPDATE-DATE.
109550     MOVE WS-877-2-CAT-SEL TO WS-877-P2-CAT-SEL.
109560     MOVE WS-877-2-ORDS-SEL TO WS-877-P2-ORDS-SEL.
109570     MOVE WS-877-2-UNITS-SEL TO WS-877-P2-UNITS-SEL.
109580     MOVE WS-877-2-NET-SLS-SEL TO WS-877-P2-NET-SLS-SEL.
109590     MOVE WS-877-2-DELIV-SEL TO WS-877-P2-DELIV-SEL.
109600     MOVE WS-877-2-BASE-SEL TO WS-877-P2-BASE-SEL.
109610     MOVE WS-877-2-PR-ADJ-SEL TO WS-877-P2-PR-ADJ-SEL.
109620     MOVE WS-877-2-OTH-ADJ-SEL TO WS-877-P2-OTH-ADJ-SEL.
109630     MOVE WS-877-2-ADJ-BASE-SEL TO WS-877-P2-ADJ-BASE-SEL.
109640     MOVE WS-877-2-ANNUAL-SEL TO WS-877-P2-ANNUAL-SEL.
109650     MOVE WS-877-2-RATE-SEL TO WS-877-P2-RATE-SEL.
109660     MOVE WS-877-2-CN-CD-LVL-SEL TO WS-877-P2-CN-CD-LVL-SEL.
109670     MOVE WS-877-2-HLDCO-LVL-SEL TO WS-877-P2-HLDCO-LVL-SEL.
109680     MOVE WS-877-2-HC-D1-LVL-SEL TO WS-877-P2-HC-D1-LVL-SEL.
109690     MOVE WS-877-2-HC-D2-LVL-SEL TO WS-877-P2-HC-D2-LVL-SEL.
109700     MOVE WS-877-2-HC-D3-LVL-SEL TO WS-877-P2-HC-D3-LVL-SEL.
109710     MOVE WS-877-2-MBC-LVL-SEL TO WS-877-P2-MBC-LVL-SEL.
109720     MOVE WS-877-2-MBC-1-LVL-SEL TO WS-877-P2-MBC-D1-LVL-SEL.
109730     MOVE WS-877-2-MBC-2-LVL-SEL TO WS-877-P2-MBC-D2-LVL-SEL.
109740     MOVE WS-877-2-MBC-3-LVL-SEL TO WS-877-P2-MBC-D3-LVL-SEL.
109750     MOVE WS-877-2-BC-LVL-SEL TO WS-877-P2-BC-LVL-SEL.
109760     MOVE WS-877-2-PRI-B-LVL-SEL TO WS-877-P2-PRI-B-LVL-SEL.
109770     MOVE WS-877-2-SEC-B-LVL-SEL TO WS-877-P2-SEC-B-LVL-SEL.
109780     MOVE WS-877-2-B-TYP-LVL-SEL TO WS-877-P2-B-TYP-LVL-SEL.
109790     MOVE WS-877-2-PG-BK-FLG TO WS-877-P2-PG-BK-FLG.
109800     MOVE WS-877-2-R7-RP-LVL-SEL TO WS-877-P2-R7-RP-LVL-SEL.
109810     MOVE WS-877-2-R7-BC-LVL-SEL TO WS-877-P2-R7-BC-LVL-SEL.
109820     MOVE WS-877-2-R7-PB-LVL-SEL TO WS-877-P2-R7-PB-LVL-SEL.
109830     MOVE WS-877-2-R7-TY-LVL-SEL TO WS-877-P2-R7-TY-LVL-SEL.
109840     MOVE WS-877-2-R7-BC-PG-OPT TO WS-877-P2-R7-BC-PG-OPT.
109850     MOVE WS-877-2-R7-CAT-31-36 TO WS-877-P2-R7-CAT-31-36.
109860     MOVE WS-877-2-R7-CTY-ST-OPT TO WS-877-P2-R7-CTY-ST-OPT.
109870     MOVE WS-877-P2 TO PRINTER1-RECORD.
109880*
109890   5030-FORMAT-877-3-REC.
109900     IF PRINT-COLUMN-HEAD
109910       MOVE +5 TO WS-LINES-NEEDED
109920     ELSE
109930       MOVE +2 TO WS-LINES-NEEDED.
109940     PERFORM 0500-CHECK-FOR-HEADINGS.
109950     IF PRINT-COLUMN-HEAD
109960       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
109970       IF WS-LINE-COUNT GREATER +3
109980         MOVE +2 TO WS-LINE-SPACER
109990       END-IF
110000       MOVE WS-877-C3 TO PRINTER1-RECORD
110010       PERFORM 0600-WRITE-PRINTER1-RECORD
110020       MOVE +1 TO WS-LINE-SPACER
110030       MOVE WS-877-D3 TO PRINTER1-RECORD
110040       PERFORM 0600-WRITE-PRINTER1-RECORD.
110050     MOVE WS-877-CONSID-NBR TO WS-877-P3-CONSID-NBR.
110060     MOVE WS-877-REC-TYPE TO WS-877-P3-REC-TYPE.
110070     MOVE WS-877-RECORD-NBR TO WS-877-P3-RECORD-NBR.
110080     MOVE WS-877-UPDATE-DATE TO WS-877-P3-UPDATE-DATE.
110090     MOVE WS-877-3-CATG-HEADING TO WS-877-P3-CATG-HEADING.
110100     MOVE WS-877-3-ORDS-HEADING TO WS-877-P3-ORDS-HEADING.
110110     MOVE WS-877-3-UNITS-HEADING TO WS-877-P3-UNITS-HEADING.
110120     MOVE WS-877-3-B-AND-D-HEAD TO WS-877-P3-B-AND-D-HEAD.
110130     MOVE WS-877-3-DELIV-HEAD TO WS-877-P3-DELIV-HEAD.
110140     MOVE WS-877-3-BASE-HEADING TO WS-877-P3-BASE-HEADING.
110150     MOVE WS-877-3-PR-ADJ-HEAD TO WS-877-P3-PR-ADJ-HEAD.
110160     MOVE WS-877-3-OTH-ADJ-HEAD TO WS-877-P3-OTH-ADJ-HEAD.
110170     MOVE WS-877-3-ADJ-BASE-HEAD TO WS-877-P3-ADJ-BASE-HEAD.
110180     MOVE WS-877-3-ANNUAL-HEAD TO WS-877-P3-ANNUAL-HEAD.
110190     MOVE WS-877-3-RATE-HEADING TO WS-877-P3-RATE-HEADING.
110200     MOVE WS-877-3-CONSID-HEAD TO WS-877-P3-CONSID-HEAD.
110210     MOVE WS-877-P3A TO PRINTER1-RECORD.
110220     PERFORM 0600-WRITE-PRINTER1-RECORD.
110230     MOVE WS-877-P3B TO PRINTER1-RECORD.
110240*
110250   5040-FORMAT-877-4F-REC.
110260     IF PRINT-COLUMN-HEAD
110270       MOVE +5 TO WS-LINES-NEEDED
110280     ELSE
110290       MOVE +1 TO WS-LINES-NEEDED.
110300     PERFORM 0500-CHECK-FOR-HEADINGS.
110310     IF PRINT-COLUMN-HEAD
110320       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
110330       IF WS-LINE-COUNT GREATER +3
110340         MOVE +2 TO WS-LINE-SPACER
110350       END-IF
110360       MOVE WS-877-C4FA TO PRINTER1-RECORD
110370       PERFORM 0600-WRITE-PRINTER1-RECORD
110380       MOVE +1 TO WS-LINE-SPACER
110390       MOVE WS-877-C4FB TO PRINTER1-RECORD
110400       PERFORM 0600-WRITE-PRINTER1-RECORD
110410       MOVE WS-877-D4F TO PRINTER1-RECORD
110420       PERFORM 0600-WRITE-PRINTER1-RECORD.
110430     MOVE WS-877-CONSID-NBR TO WS-877-P4F-CONSID-NBR.
110440     MOVE WS-877-REC-TYPE TO WS-877-P4F-REC-TYPE.
110450     MOVE WS-877-RECORD-NBR TO WS-877-P4F-RECORD-NBR.
110460     MOVE WS-877-UPDATE-DATE TO WS-877-P4F-UPDATE-DATE.
110470     MOVE WS-877-4-CONSID-TYPE TO WS-877-P4F-CONSID-TYPE.
110480     MOVE WS-877-4-CAT-TITLE TO WS-877-P4F-CAT-TITLE.
110490     MOVE WS-877-4F-YRLY-AMT TO WS-877-P4F-YRLY-AMT.
110500     MOVE WS-877-4F-INST-ID TO WS-877-P4F-INST-ID.
110510     IF WS-877-4F-PLT-PCT-1 IS NUMERIC
110520       MOVE WS-877-4F-PLT-NBR-1 TO WS-877-P4F-PLT-NBR-1
110530       MOVE WS-877-4F-PLT-PCT-1 TO WS-877-P4F-PLT-PCT-1
110540       MOVE '%' TO WS-877-P4F-PLT-SGN-1
110550     ELSE
110560       MOVE SPACE TO WS-877-P4F-PLT-INFO-1.
110570     IF WS-877-4F-PLT-PCT-2 IS NUMERIC
110580       MOVE WS-877-4F-PLT-NBR-2 TO WS-877-P4F-PLT-NBR-2
110590       MOVE WS-877-4F-PLT-PCT-2 TO WS-877-P4F-PLT-PCT-2
110600       MOVE '%' TO WS-877-P4F-PLT-SGN-2
110610     ELSE
110620       MOVE SPACE TO WS-877-P4F-PLT-INFO-2.
110630     IF WS-877-4F-PLT-PCT-3 IS NUMERIC
110640       MOVE WS-877-4F-PLT-NBR-3 TO WS-877-P4F-PLT-NBR-3
110650       MOVE WS-877-4F-PLT-PCT-3 TO WS-877-P4F-PLT-PCT-3
110660       MOVE '%' TO WS-877-P4F-PLT-SGN-3
110670     ELSE
110680       MOVE SPACE TO WS-877-P4F-PLT-INFO-3.
110690     IF WS-877-4F-PLT-PCT-4 IS NUMERIC
110700       MOVE WS-877-4F-PLT-NBR-4 TO WS-877-P4F-PLT-NBR-4
110710       MOVE WS-877-4F-PLT-PCT-4 TO WS-877-P4F-PLT-PCT-4
110720       MOVE '%' TO WS-877-P4F-PLT-SGN-4
110730     ELSE
110740       MOVE SPACE TO WS-877-P4F-PLT-INFO-4.
110750     IF WS-877-4F-PLT-PCT-5 IS NUMERIC
110760       MOVE WS-877-4F-PLT-NBR-5 TO WS-877-P4F-PLT-NBR-5
110770       MOVE WS-877-4F-PLT-PCT-5 TO WS-877-P4F-PLT-PCT-5
110780       MOVE '%' TO WS-877-P4F-PLT-SGN-5
110790     ELSE
110800       MOVE SPACE TO WS-877-P4F-PLT-INFO-5.
110810     MOVE WS-877-P4F TO PRINTER1-RECORD.
110820*
110830   5043-FORMAT-877-4G-REC.
110840     IF PRINT-COLUMN-HEAD
110850       MOVE +4 TO WS-LINES-NEEDED
110860     ELSE
110870       MOVE +1 TO WS-LINES-NEEDED.
110880     PERFORM 0500-CHECK-FOR-HEADINGS.
110890     IF PRINT-COLUMN-HEAD
110900       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
110910       IF WS-LINE-COUNT GREATER +3
110920         MOVE +2 TO WS-LINE-SPACER
110930       END-IF
110940       MOVE WS-877-C4G TO PRINTER1-RECORD
110950       PERFORM 0600-WRITE-PRINTER1-RECORD
110960       MOVE +1 TO WS-LINE-SPACER
110970       MOVE WS-877-D4G TO PRINTER1-RECORD
110980       PERFORM 0600-WRITE-PRINTER1-RECORD.
110990     MOVE WS-877-CONSID-NBR TO WS-877-P4G-CONSID-NBR.
111000     MOVE WS-877-REC-TYPE TO WS-877-P4G-REC-TYPE.
111010     MOVE WS-877-RECORD-NBR TO WS-877-P4G-RECORD-NBR.
111020     MOVE WS-877-UPDATE-DATE TO WS-877-P4G-UPDATE-DATE.
111030     MOVE WS-877-4-CONSID-TYPE TO WS-877-P4G-CONSID-TYPE.
111040     MOVE WS-877-4-CAT-TITLE TO WS-877-P4G-CAT-TITLE.
111050     MOVE WS-877-4G-BASIS-CD TO WS-877-P4G-BASIS-CD.
111060     IF WS-877-4G-PCT NOT NUMERIC
111070       MOVE SPACE TO WS-877-P4G-RATE
111080     ELSE
111090       IF WS-877-4G-BASIS-CD IS ALPHABETIC
111100         MOVE WS-877-4G-PCT TO WS-877-P4G-PCT
111110         MOVE '%' TO WS-877-P4G-PCT-SGN
111120       ELSE
111130         MOVE WS-877-4G-DLRS TO WS-877-P4G-DLRS.
111140     MOVE WS-877-4G-RED-BASIS TO WS-877-P4G-RED-BASIS.
111150     IF WS-877-4G-RED-PCT NOT NUMERIC
111160       MOVE SPACE TO WS-877-P4G-RED-RATE
111170     ELSE
111180       IF WS-877-4G-RED-BASIS IS ALPHABETIC
111190         MOVE WS-877-4G-RED-PCT TO WS-877-P4G-RED-PCT
111200         MOVE '%' TO WS-877-P4G-RED-PCT-SGN
111210       ELSE
111220         MOVE WS-877-4G-RED-DLRS TO WS-877-P4G-RED-DLRS.
111230     MOVE WS-877-P4G TO PRINTER1-RECORD.
111240*
111250   5046-FORMAT-877-4T-REC.
111260     ADD WS-877-4T-TIER-COUNT +2 GIVING WS-LINES-NEEDED.
111270     DIVIDE +3 INTO WS-LINES-NEEDED.
111280     IF PRINT-COLUMN-HEAD
111290       ADD +4 TO WS-LINES-NEEDED.
111300     PERFORM 0500-CHECK-FOR-HEADINGS.
111310     IF PRINT-COLUMN-HEAD
111320       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
111330       IF WS-LINE-COUNT GREATER +3
111340         MOVE +2 TO WS-LINE-SPACER
111350       END-IF
111360       MOVE WS-877-C4TA TO PRINTER1-RECORD
111370       PERFORM 0600-WRITE-PRINTER1-RECORD
111380       MOVE +1 TO WS-LINE-SPACER
111390       MOVE WS-877-C4TB TO PRINTER1-RECORD
111400       PERFORM 0600-WRITE-PRINTER1-RECORD
111410       MOVE WS-877-D4T TO PRINTER1-RECORD
111420       PERFORM 0600-WRITE-PRINTER1-RECORD.
111430     MOVE WS-877-CONSID-NBR TO WS-877-P4T-CONSID-NBR.
111440     MOVE WS-877-REC-TYPE TO WS-877-P4T-REC-TYPE.
111450     MOVE WS-877-RECORD-NBR TO WS-877-P4T-RECORD-NBR.
111460     MOVE WS-877-UPDATE-DATE TO WS-877-P4T-UPDATE-DATE.
111470     MOVE WS-877-4-CONSID-TYPE TO WS-877-P4T-CONSID-TYPE.
111480     MOVE WS-877-4-CAT-TITLE TO WS-877-P4T-CAT-TITLE.
111490     MOVE WS-877-4T-ANNL-MTHD TO WS-877-P4T-ANNL-MTHD.
111500     MOVE WS-877-4T-OTH-ADJ TO WS-877-P4T-OTH-ADJ.
111510     MOVE WS-877-4T-RED-BASIS TO WS-877-P4T-RED-BASIS.
111520     IF WS-877-4T-RED-DLRS NOT NUMERIC
111530       MOVE SPACE TO WS-877-P4T-RED-RATE
111540     ELSE
111550       IF WS-877-4T-RED-BASIS IS ALPHABETIC
111560         MOVE WS-877-4T-RED-PCT TO WS-877-P4T-RED-PCT
111570         MOVE '%' TO WS-877-P4T-RED-PCT-SGN
111580       ELSE
111590         MOVE WS-877-4T-RED-DLRS TO WS-877-P4T-RED-DLRS.
111600     MOVE WS-877-4T-TIER-COUNT TO WS-877-P4T-TIER-COUNT.
111610     MOVE WS-877-4T-MIN-ANNL (1) TO WS-877-P4TA1-MIN-ANNL.
111620     MOVE WS-877-4T-BASIS-CD (1) TO WS-877-P4TA1-BASIS-CD.
111630     IF WS-877-4T-BASIS-CD (1) IS ALPHABETIC
111640       MOVE WS-877-4T-PCT (1) TO WS-877-P4TA1-PCT
111650       MOVE '%' TO WS-877-P4TA1-PCT-SGN
111660     ELSE
111670       MOVE WS-877-4T-DLRS (1) TO WS-877-P4TA1-DLRS.
111680     IF WS-877-4T-TIER-COUNT NOT GREATER +1
111690       MOVE SPACE TO WS-877-P4TA2-TIER-INFO WS-877-P4TA3-TIER-INFO
111700     ELSE
111710       MOVE WS-877-4T-MIN-ANNL (2) TO WS-877-P4TA2-MIN-ANNL
111720       MOVE WS-877-4T-BASIS-CD (2) TO WS-877-P4TA2-BASIS-CD
111730       IF WS-877-4T-BASIS-CD (2) IS ALPHABETIC
111740         MOVE WS-877-4T-PCT (2) TO WS-877-P4TA2-PCT
111750         MOVE '%' TO WS-877-P4TA2-PCT-SGN
111760       ELSE
111770         MOVE WS-877-4T-DLRS (2) TO WS-877-P4TA2-DLRS
111780       END-IF
111790       IF WS-877-4T-TIER-COUNT NOT GREATER +2
111800         MOVE SPACE TO WS-877-P4TA3-TIER-INFO
111810       ELSE
111820         MOVE WS-877-4T-MIN-ANNL (3) TO WS-877-P4TA3-MIN-ANNL
111830         MOVE WS-877-4T-BASIS-CD (3) TO WS-877-P4TA3-BASIS-CD
111840         IF WS-877-4T-BASIS-CD (3) IS ALPHABETIC
111850           MOVE WS-877-4T-PCT (3) TO WS-877-P4TA3-PCT
111860           MOVE '%' TO WS-877-P4TA3-PCT-SGN
111870         ELSE
111880           MOVE WS-877-4T-DLRS (3) TO WS-877-P4TA3-DLRS.
111890     MOVE WS-877-P4TA TO PRINTER1-RECORD.
111900     IF WS-877-4T-TIER-COUNT GREATER +3
111910       SET WS-877-4T-IX TO +4
111920       PERFORM
111930           WITH TEST AFTER
111940           UNTIL WS-877-4T-IX GREATER WS-877-4T-TIER-COUNT
111950         PERFORM 0600-WRITE-PRINTER1-RECORD
111960         MOVE WS-877-4T-MIN-ANNL (WS-877-4T-IX)
111970               TO WS-877-P4TB1-MIN-ANNL
111980         MOVE WS-877-4T-BASIS-CD (WS-877-4T-IX)
111990               TO WS-877-P4TB1-BASIS-CD
112000         IF WS-877-4T-BASIS-CD (WS-877-4T-IX)
112010               IS ALPHABETIC
112020           MOVE WS-877-4T-PCT (WS-877-4T-IX)
112030                 TO WS-877-P4TB1-PCT
112040           MOVE '%' TO WS-877-P4TB1-PCT-SGN
112050         ELSE
112060           MOVE WS-877-4T-DLRS (WS-877-4T-IX)
112070                 TO WS-877-P4TB1-DLRS
112080         END-IF
112090         SET WS-877-4T-IX UP BY 1
112100         IF WS-877-4T-IX GREATER WS-877-4T-TIER-COUNT
112110           MOVE SPACE TO WS-877-P4TB2-TIER-INFO
112120                 WS-877-P4TB3-TIER-INFO
112130         ELSE
112140           MOVE WS-877-4T-MIN-ANNL (WS-877-4T-IX)
112150                 TO WS-877-P4TB2-MIN-ANNL
112160           MOVE WS-877-4T-BASIS-CD (WS-877-4T-IX)
112170                 TO WS-877-P4TB2-BASIS-CD
112180           IF WS-877-4T-BASIS-CD (WS-877-4T-IX)
112190                 IS ALPHABETIC
112200             MOVE WS-877-4T-PCT (WS-877-4T-IX)
112210                   TO WS-877-P4TB2-PCT
112220             MOVE '%' TO WS-877-P4TB2-PCT-SGN
112230           ELSE
112240             MOVE WS-877-4T-DLRS (WS-877-4T-IX)
112250                   TO WS-877-P4TB2-DLRS
112260           END-IF
112270           SET WS-877-4T-IX UP BY 1
112280           IF WS-877-4T-IX GREATER WS-877-4T-TIER-COUNT
112290             MOVE SPACE TO WS-877-P4TB3-TIER-INFO
112300           ELSE
112310             MOVE WS-877-4T-MIN-ANNL (WS-877-4T-IX)
112320                   TO WS-877-P4TB3-MIN-ANNL
112330             MOVE WS-877-4T-BASIS-CD (WS-877-4T-IX)
112340                   TO WS-877-P4TB3-BASIS-CD
112350             IF WS-877-4T-BASIS-CD (WS-877-4T-IX)
112360                   IS ALPHABETIC
112370               MOVE WS-877-4T-PCT (WS-877-4T-IX)
112380                     TO WS-877-P4TB3-PCT
112390               MOVE '%' TO WS-877-P4TB3-PCT-SGN
112400             ELSE
112410               MOVE WS-877-4T-DLRS (WS-877-4T-IX)
112420                     TO WS-877-P4TB3-DLRS
112430             END-IF
112440             SET WS-877-4T-IX UP BY 1
112450           END-IF
112460         END-IF
112470         MOVE WS-877-P4TB TO PRINTER1-RECORD
112480       END-PERFORM.
112490*
112500   5050-FORMAT-877-5-REC.
112510     IF PRINT-COLUMN-HEAD
112520       MOVE +5 TO WS-LINES-NEEDED
112530     ELSE
112540       MOVE +1 TO WS-LINES-NEEDED.
112550     PERFORM 0500-CHECK-FOR-HEADINGS.
112560     IF PRINT-COLUMN-HEAD
112570       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
112580       IF WS-LINE-COUNT GREATER +3
112590         MOVE +2 TO WS-LINE-SPACER
112600       END-IF
112610       MOVE WS-877-C5A TO PRINTER1-RECORD
112620       PERFORM 0600-WRITE-PRINTER1-RECORD
112630       MOVE +1 TO WS-LINE-SPACER
112640       MOVE WS-877-C5B TO PRINTER1-RECORD
112650       PERFORM 0600-WRITE-PRINTER1-RECORD
112660       MOVE WS-877-D5 TO PRINTER1-RECORD
112670       PERFORM 0600-WRITE-PRINTER1-RECORD.
112680     MOVE WS-877-CONSID-NBR TO WS-877-P5-CONSID-NBR.
112690     MOVE WS-877-REC-TYPE TO WS-877-P5-REC-TYPE.
112700     MOVE WS-877-RECORD-NBR TO WS-877-P5-RECORD-NBR.
112710     MOVE WS-877-UPDATE-DATE TO WS-877-P5-UPDATE-DATE.
112720     MOVE WS-877-5-MATCH-PROD-CD TO WS-877-P5-MATCH-PROD-CD.
112730     MOVE WS-877-5-MATCH-D-Q TO WS-877-P5-MATCH-D-Q.
112740     MOVE WS-877-5-MATCH-UNITS TO WS-877-P5-MATCH-UNITS.
112750     MOVE WS-877-5-MATCH-AOE TO WS-877-P5-MATCH-AOE.
112760     MOVE WS-877-5-MATCH-BIL-MED TO WS-877-P5-MATCH-BIL-MED.
112770     MOVE WS-877-5-MATCH-REORDER TO WS-877-P5-MATCH-REORDER.
112780     MOVE WS-877-5-MATCH-BC TO WS-877-P5-MATCH-BC.
112790     MOVE WS-877-5-MATCH-PRI-BR TO WS-877-P5-MATCH-PRI-BR.
112800     MOVE WS-877-5-GROUP-1-CODE TO WS-877-P5-GROUP-1-CODE.
112810     MOVE WS-877-5-GROUP-1-INCL TO WS-877-P5-GROUP-1-INCL.
112820     MOVE WS-877-5-GROUP-2-CODE TO WS-877-P5-GROUP-2-CODE.
112830     MOVE WS-877-5-GROUP-2-INCL TO WS-877-P5-GROUP-2-INCL.
112840     MOVE WS-877-5-GROUP-3-CODE TO WS-877-P5-GROUP-3-CODE.
112850     MOVE WS-877-5-GROUP-3-INCL TO WS-877-P5-GROUP-3-INCL.
112860     MOVE WS-877-5-GROUP-4-CODE TO WS-877-P5-GROUP-4-CODE.
112870     MOVE WS-877-5-GROUP-4-INCL TO WS-877-P5-GROUP-4-INCL.
112880     MOVE WS-877-5-GROUP-5-CODE TO WS-877-P5-GROUP-5-CODE.
112890     MOVE WS-877-5-GROUP-5-INCL TO WS-877-P5-GROUP-5-INCL.
112900     MOVE WS-877-5-GROUP-6-CODE TO WS-877-P5-GROUP-6-CODE.
112910     MOVE WS-877-5-GROUP-6-INCL TO WS-877-P5-GROUP-6-INCL.
112920     MOVE WS-877-5-GROUP-7-CODE TO WS-877-P5-GROUP-7-CODE.
112930     MOVE WS-877-5-GROUP-7-INCL TO WS-877-P5-GROUP-7-INCL.
112940     MOVE WS-877-5-GROUP-8-CODE TO WS-877-P5-GROUP-8-CODE.
112950     MOVE WS-877-5-GROUP-8-INCL TO WS-877-P5-GROUP-8-INCL.
112960     MOVE WS-877-5-GROUP-9-CODE TO WS-877-P5-GROUP-9-CODE.
112970     MOVE WS-877-5-GROUP-9-INCL TO WS-877-P5-GROUP-9-INCL.
112980     MOVE WS-877-5-GROUP-10-CODE TO WS-877-P5-GROUP-10-CODE.
112990     MOVE WS-877-5-GROUP-10-INCL TO WS-877-P5-GROUP-10-INCL.
113000     MOVE I877-1-CREDIT-HOLD-DAYS TO WS-877-1-CREDIT-HOLD-DAYS.
113010     MOVE WS-877-1-CREDIT-HOLD-DAYS TO WS-877-P5-CR-HOLD-DAYS.
113020     MOVE WS-877-5-MATCH-ORDER-CHANNEL TO WS-877-P5-ORD-CHANNEL.
113030     MOVE WS-877-P5 TO PRINTER1-RECORD.
113040*
113050   5100-CHECK-I589P-FILE.
113060     PERFORM 5110-READ-I589P-FILE
113070       WITH TEST BEFORE
113080       UNTIL END-I589P-FILE
113090             OR (I589P-BC NOT LESS WS-IPARM-BC).
113100     IF (NOT END-I589P-FILE)
113110         AND (I589P-BC EQUAL WS-IPARM-BC)
113120       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
113130       MOVE '589C FILE: ' TO WS-FILE-HD-FILE-NBR
113140       MOVE 'PAYMENT EXCEPTIONS' TO WS-FILE-HD-FILE-NAME
113150       PERFORM 5120-REPORT-I589P-RECORD
113160         WITH TEST AFTER
113170         UNTIL END-I589P-FILE
113180               OR (I589P-BC GREATER WS-IPARM-BC).
113190*
113200   5110-READ-I589P-FILE.
113210     READ I589P-FILE
113220       AT END
113230         MOVE 'E' TO WS-I589P-FILE-FLAG
113240       NOT AT END
113250         IF I589P-BC NOT LESS WS-I589P-BC
113260           MOVE I589P-BC TO WS-I589P-BC
113270         ELSE
113280           DISPLAY '* I589P SEQUENCE ERROR "' WS-I589P-BC '" "'
113290                 I589P-BC '" *' UPON SYSOUT
113300           GO TO 9900-DISPLAY-ABORT
113310         END-IF
113320       END-READ.
113330*
113340   5120-REPORT-I589P-RECORD.
113350     IF PRINT-COLUMN-HEAD
113360       MOVE +3 TO WS-LINES-NEEDED
113370     ELSE
113380       MOVE +1 TO WS-LINES-NEEDED.
113390     PERFORM 0500-CHECK-FOR-HEADINGS.
113400     IF PRINT-COLUMN-HEAD
113410       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
113420       MOVE WS-589P-C1 TO PRINTER1-RECORD
113430       PERFORM 0600-WRITE-PRINTER1-RECORD
113440       MOVE WS-589P-D1 TO PRINTER1-RECORD
113450       PERFORM 0600-WRITE-PRINTER1-RECORD.
113460     MOVE I589P-BC TO WS-589P-P1-BC.
113470     MOVE I589P-CHECK-FLAG TO WS-589P-P1-CK-FLAG.
113480     MOVE I589P-QTRLY-FLAG TO WS-589P-P1-QTRLY-FLAG.
113490     MOVE I589P-CR-TO-TAPE-FLAG TO WS-589P-P1-CR-TO-TAPE.
113500     MOVE I589P-CR-TO-CUST-FLAG TO WS-589P-P1-CR-TO-CUST.
113510     MOVE I589P-RETAIN-ORIG-EXP-CD TO WS-589P-P1-RET-ORIG-XC.
113520     MOVE WS-589P-P1 TO PRINTER1-RECORD.
113530     PERFORM 0600-WRITE-PRINTER1-RECORD.
113540     PERFORM 5110-READ-I589P-FILE.
113550*
113560   5500-CHECK-I1475-FILE.
113570     PERFORM 5510-READ-I1475-FILE
113580       WITH TEST BEFORE
113590       UNTIL END-I1475-FILE
113600             OR (I1475-BC NOT LESS WS-IPARM-BC).
113610     IF (NOT END-I1475-FILE)
113620         AND (I1475-BC EQUAL WS-IPARM-BC)
113630       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
113640       MOVE '1475 FILE: ' TO WS-FILE-HD-FILE-NBR
113650       MOVE 'FI EXCLUSIVES FILE' TO WS-FILE-HD-FILE-NAME
113660       PERFORM 5520-REPORT-I1475-RECORD
113670         WITH TEST AFTER
113680         UNTIL END-I1475-FILE
113690               OR (I1475-BC GREATER WS-IPARM-BC).
113700*
113710   5510-READ-I1475-FILE.
113720     READ I1475-FILE
113730       AT END
113740         MOVE 'E' TO WS-I1475-FILE-FLAG
113750       NOT AT END
113760         IF I1475-BC NOT LESS WS-I1475-BC
113770           MOVE I1475-BC TO WS-I1475-BC
113780         ELSE
113790           DISPLAY '* I1475 SEQUENCE ERROR "' WS-I1475-BC
113800                 '" "' I1475-BC '" *' UPON SYSOUT
113810           GO TO 9900-DISPLAY-ABORT
113820         END-IF
113830     END-READ.
113840*
113850   5520-REPORT-I1475-RECORD.
113860     IF PRINT-COLUMN-HEAD
113870       MOVE +4 TO WS-LINES-NEEDED
113880     ELSE
113890       MOVE +1 TO WS-LINES-NEEDED.
113900     PERFORM 0500-CHECK-FOR-HEADINGS.
113910     IF PRINT-COLUMN-HEAD
113920       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
113930       MOVE WS-1475-C1A TO PRINTER1-RECORD
113940       PERFORM 0600-WRITE-PRINTER1-RECORD
113950       MOVE WS-1475-C1B TO PRINTER1-RECORD
113960       PERFORM 0600-WRITE-PRINTER1-RECORD
113970       MOVE WS-1475-D1 TO PRINTER1-RECORD
113980       PERFORM 0600-WRITE-PRINTER1-RECORD.
113990       MOVE I1475-BC TO WS-1475-P1-BC.
114000       MOVE I1475-PROD-MAJOR TO WS-1475-P1-PRD-MAJ.
114010       MOVE I1475-PROD-MINOR TO WS-1475-P1-PRD-MIN.
114020       MOVE I1475-PROD-NUMBER TO WS-1475-P1-PRD-NBR.
114030       MOVE I1475-PROD-SUFFIX TO WS-1475-P1-PRD-SUF.
114040       MOVE I1475-DESCRIPTIVE-QTY TO WS-1475-P1-PRD-DQ.
114050       MOVE I1475-58-STYLE-CODE TO WS-1475-P1-STYLE.
114060       MOVE I1475-58-ABBREV-DESCR TO WS-1475-P1-DESCR.
114070       MOVE I1475-GENERIC-PR-DESIG TO WS-1475-P1-GEN-PD.
114080       MOVE I1475-SPECIFIC-PR-DESIG TO WS-1475-P1-SPC-PD.
114090       MOVE I1475-UNIT-BASE TO WS-1475-P1-U-BASE.
114100       MOVE I1475-UNIT-DELIVERY TO WS-1475-P1-U-DELIV.
114110       IF I1475-ADDITIONAL-QUANTITY NOT EQUAL +0
114120         MOVE I1475-ADDITIONAL-QUANTITY TO WS-1475-P1-A-QTY
114130         MOVE I1475-ADDL-QTY-BASE TO WS-1475-P1-A-BASE
114140         MOVE I1475-ADDL-QTY-DELIVERY TO WS-1475-P1-A-DELIV
114150       ELSE
114160         MOVE SPACE TO WS-1475-P1-ADDLS.
114170     MOVE WS-1475-P1 TO PRINTER1-RECORD.
114180     PERFORM 0600-WRITE-PRINTER1-RECORD.
114190     PERFORM 5510-READ-I1475-FILE.
114200*
114210   5600-CHECK-I1967P-FILE.
114220     PERFORM 5610-READ-I1967P-FILE
114230       WITH TEST BEFORE
114240       UNTIL END-I1967P-FILE
114250             OR (I1967P-BC NOT LESS WS-IPARM-BC).
114260     IF (NOT END-I1967P-FILE)
114270         AND (I1967P-BC EQUAL WS-IPARM-BC)
114280       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
114290       MOVE '1967C FILE:' TO WS-FILE-HD-FILE-NBR
114300       MOVE 'RUSHMORE EXCLUSIVE FORCED PRODUCTS' TO
114310             WS-FILE-HD-FILE-NAME
114320       PERFORM 5620-REPORT-I1967P-RECORD
114330         WITH TEST AFTER
114340         UNTIL END-I1967P-FILE
114350               OR (I1967P-BC GREATER WS-IPARM-BC).
114360*
114370   5610-READ-I1967P-FILE.
114380     READ I1967P-FILE
114390       AT END
114400         MOVE 'E' TO WS-I1967P-FILE-FLAG
114410       NOT AT END
114420         IF I1967P-BC NOT LESS WS-I1967P-BC
114430           MOVE I1967P-BC TO WS-I1967P-BC
114440         ELSE
114450           DISPLAY '* I1967P SEQUENCE ERROR "' WS-I1967P-BC '" "'
114460                 I1967P-BC '" *' UPON SYSOUT
114470           GO TO 9900-DISPLAY-ABORT
114480         END-IF
114490       END-READ.
114500*
114510   5620-REPORT-I1967P-RECORD.
114520     IF PRINT-COLUMN-HEAD
114530       MOVE +3 TO WS-LINES-NEEDED
114540     ELSE
114550       MOVE +1 TO WS-LINES-NEEDED.
114560     PERFORM 0500-CHECK-FOR-HEADINGS.
114570     IF PRINT-COLUMN-HEAD
114580       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
114590       MOVE WS-1967P-C1 TO PRINTER1-RECORD
114600       PERFORM 0600-WRITE-PRINTER1-RECORD
114610       MOVE WS-1967P-D1 TO PRINTER1-RECORD
114620       PERFORM 0600-WRITE-PRINTER1-RECORD.
114630     MOVE I1967P-FI TO WS-1967P-P1-FI.
114640     MOVE I1967P-PROD TO WS-1967P-P1-PROD.
114650     MOVE I1967P-DQ TO WS-1967P-P1-DQ.
114660     MOVE I1967P-COMMENT TO WS-1967P-P1-COMMENT.
114670     MOVE WS-1967P-P1 TO PRINTER1-RECORD.
114680     PERFORM 0600-WRITE-PRINTER1-RECORD.
114690     PERFORM 5610-READ-I1967P-FILE.
114700*
114710   5830-CHECK-I1961P-FILE.
114720     PERFORM 5835-READ-I1961P-FILE
114730       WITH TEST BEFORE
114740       UNTIL END-I1961P-FILE
114750             OR (I1961P-BC NOT LESS WS-IPARM-BC).
114760     IF (NOT END-I1961P-FILE)
114770         AND (I1961P-BC EQUAL WS-IPARM-BC)
114780       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
114790       MOVE '1961C FILE: ' TO WS-FILE-HD-FILE-NBR
114800       MOVE 'INVOICE DELIVERY                         ' TO
114810             WS-FILE-HD-FILE-NAME
114820       PERFORM 5840-REPORT-I1961P-RECORD
114830         WITH TEST AFTER
114840         UNTIL END-I1961P-FILE
114850               OR (I1961P-BC NOT EQUAL WS-IPARM-BC).
114860*
114870   5835-READ-I1961P-FILE.
114880     READ I1961P-FILE
114890       AT END
114900         MOVE 'E' TO WS-I1961P-FILE-FLAG
114910       NOT AT END
114920         IF I1961P-BC NOT LESS WS-I1961P-BC
114930           MOVE I1961P-BC TO WS-I1961P-BC
114940         ELSE
114950           DISPLAY '* I1961P SEQUENCE ERROR "' WS-I1961P-BC '" "'
114960                 I1961P-BC '" *' UPON SYSOUT
114970           GO TO 9900-DISPLAY-ABORT
114980         END-IF
114990       END-READ.
115000*
115010   5840-REPORT-I1961P-RECORD.
115020     IF PRINT-COLUMN-HEAD
115030       MOVE +3 TO WS-LINES-NEEDED
115040     ELSE
115050       MOVE +1 TO WS-LINES-NEEDED.
115060     PERFORM 0500-CHECK-FOR-HEADINGS.
115070     IF PRINT-COLUMN-HEAD
115080       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
115090       MOVE WS-1961P-C1 TO PRINTER1-RECORD
115100       PERFORM 0600-WRITE-PRINTER1-RECORD
115110       MOVE WS-1961P-D1 TO PRINTER1-RECORD
115120       PERFORM 0600-WRITE-PRINTER1-RECORD.
115130     MOVE I1961P-BC                TO WS-I9161P-P1-BC.
115140     MOVE I1961P-PRI-BR            TO WS-1961P-P1-PRI-BR.
115150     MOVE I1961P-SEC-BR            TO WS-1961P-P1-SEC-BR.
115160     MOVE I1961P-BILL-TYP          TO WS-1961P-P1-BILL-TYPE.
115170     MOVE I1961P-SEP-INV-CODE      TO WS-1961P-P1-SEP-INV-CD.
115180     MOVE I1961P-PROD-DTL-FLAG     TO WS-1961P-P1-PROD-DTL-FL.
115190     MOVE I1961P-ORD-DTL-FLAG      TO WS-1961P-P1-ORD-DTL-FL.
115200     MOVE I1961P-PROD-PRT-FLAG     TO WS-1961P-P1-PROD-PRT-FL.
115210     MOVE I1961P-ORD-PRT-FLAG      TO WS-1961P-P1-ORD-PRT-FL.
115220     MOVE I1961P-SERVICE-FEE-FLAG  TO WS-1961P-P1-SVC-FEE-FL.
115230     MOVE I1961P-EMAIL-FMT         TO WS-1961P-P1-EMAIL-FMT.
115240     MOVE I1961P-ACCESS-KEY        TO WS-1961P-P1-ACCESS-KEY.
115250     MOVE I1961P-EMAIL-ADDR        TO WS-1961P-P1-EMAIL-ADDR.
115260     MOVE I1961P-ENCRYPTION-METHOD TO WS-1961P-P1-ENCRYPTION-METH.
115270     MOVE WS-1961P-P1 TO PRINTER1-RECORD.
115280     PERFORM 0600-WRITE-PRINTER1-RECORD.
115290     PERFORM 5835-READ-I1961P-FILE.
115300*
115310*
115320   6000-CHECK-I554-FILE.
115330     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
115340     MOVE '554 FILE:  ' TO WS-FILE-HD-FILE-NBR.
115350     MOVE 'UPCHARGE FILE' TO WS-FILE-HD-FILE-NAME.
115360     SET IX-WS-UPCH-KEY-CURR TO +1.
115370     PERFORM
115380         WITH TEST AFTER
115390         UNTIL IX-WS-UPCH-KEY-CURR NOT LESS IX-WS-UPCH-KEY-EMPTY
115400       MOVE WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-CURR) TO
115410             W554-SHORT-KEY I554-SHORT-KEY
115420       MOVE SPACE TO W554-RECORD-PART I554-RECORD-PART
115430       READ I554-FILE KEY I554-KEY
115440       IF WS-I554-SUCCESSFUL
115450         MOVE I554-SHORT-RECORD TO W554-SHORT-RECORD
115460         PERFORM 6050-FORMAT-W554-FIXED
115470         MOVE +0 TO WS-PRT-554-552-ENTRY-CT
115480         SET IX-WS-PRT-554-552-IN TO +1
115490         IF I554-ENTRY-COUNT GREATER +0
115500           MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
115510           PERFORM
115520               WITH TEST AFTER
115530               UNTIL WS-I554-END-OF-FILE
115540                   OR (I554-SHORT-KEY NOT EQUAL W554-SHORT-KEY)
115550                   OR (I554-ENTRY-COUNT NOT GREATER +0)
115560             MOVE I554-ENTRY-COUNT TO W554-ENTRY-COUNT
115570             ADD W554-ENTRY-COUNT TO WS-PRT-554-552-ENTRY-CT
115580             MOVE I554-VARIABLE-PORTION-INFO TO
115590                   W554-VARIABLE-PORTION-INFO
115600             PERFORM 6060-FORMAT-W554-ENTRY
115610                 VARYING W554-IX-ENTRY FROM +1 BY +1
115620                 UNTIL W554-IX-ENTRY GREATER W554-ENTRY-COUNT
115630             PERFORM 6010-READ-I554-FILE-NEXT
115640           END-PERFORM
115650         END-IF
115660         PERFORM 6070-PRINT-554-FIXED
115670         IF IX-WS-PRT-554-552-IN GREATER +1
115680           SET IX-WS-PRT-554-552-OUT TO +1
115690           PERFORM 6080-PRINT-554-ENTRY
115700               WITH TEST AFTER
115710               UNTIL IX-WS-PRT-554-552-OUT NOT LESS
115720                     IX-WS-PRT-554-552-IN
115730         END-IF
115740       ELSE
115750         IF NOT WS-I554-NO-SUCH-RECORD
115760           DISPLAY '* VSAM ERROR ON I554 READ. KEY = "'
115770                 W554-KEY '". FILE STATUS = ' WS-I554-FILE-STATUS
115780                 '. *' UPON SYSOUT
115790           GO TO 9900-DISPLAY-ABORT
115800         END-IF
115810       END-IF
115820       SET IX-WS-UPCH-KEY-CURR UP BY 1
115830     END-PERFORM.
115840*
115850   6010-READ-I554-FILE-NEXT.
115860     READ I554-FILE NEXT RECORD.
115870     IF (NOT WS-I554-SUCCESSFUL)
115880         AND (NOT WS-I554-END-OF-FILE)
115890       DISPLAY '* VSAM ERROR ON I554 READ NEXT. FILE STATUS = '
115900             WS-I554-FILE-STATUS '. *' UPON SYSOUT
115910       GO TO 9900-DISPLAY-ABORT.
115920*
115930   6050-FORMAT-W554-FIXED.
115940     MOVE W554-RECORD-TYPE TO WS-554-P1-REC-TYPE.
115950     MOVE W554-HOLDING-COMPANY TO WS-554-P1-HOLDCO.
115960     MOVE W554-HOLD-CO-DIV-LVL1 TO WS-554-P1-HC-DIV-LVL1.
115970     MOVE W554-HOLD-CO-DIV-LVL2 TO WS-554-P1-HC-DIV-LVL2.
115980     MOVE W554-HOLD-CO-DIV-LVL3 TO WS-554-P1-HC-DIV-LVL3.
115990     MOVE W554-MASTER-BC TO WS-554-P1-MASTER-BC.
116000     MOVE W554-MAST-BC-DIV-LVL1 TO WS-554-P1-MBC-DIV-LVL1.
116010     MOVE W554-MAST-BC-DIV-LVL2 TO WS-554-P1-MBC-DIV-LVL2.
116020     MOVE W554-MAST-BC-DIV-LVL3 TO WS-554-P1-MBC-DIV-LVL3.
116030     MOVE W554-BC TO WS-554-P1-BC.
116040     MOVE W554-PRIMARY-BRANCH TO WS-554-P1-PRI-BR.
116050     MOVE W554-SECONDARY-BRANCH TO WS-554-P1-SEC-BR.
116060     MOVE W554-TYPE TO WS-554-P1-TYPE.
116070     MOVE W554-REGION-NUMBER TO WS-554-P1-REGION.
116080     MOVE W554-DATE-OF-LAST-UPDATE TO WS-554-P1-UPDATED.
116090     MOVE W554-INCLUDED-MEDIUM-1 TO WS-554-P1-INCL-MED-1.
116100     MOVE W554-INCLUDED-MEDIUM-2 TO WS-554-P1-INCL-MED-2.
116110     MOVE W554-INCLUDED-MEDIUM-3 TO WS-554-P1-INCL-MED-3.
116120     MOVE W554-COMPONENT-UPCH-FLAG TO WS-554-P1-COMPT-UPCH-FLG.
116130     IF W554-NO-ORDER-UPCHARGE-LIMIT
116140       MOVE SPACE TO WS-554-P1-ORD-UP-LIM-X
116150     ELSE
116160       MOVE W554-ORDER-UPCHARGE-LIMIT TO WS-554-P1-ORD-UP-LIM.
116170     IF W554-NO-ACCT-WEEK-UPCH-LIMIT
116180       MOVE SPACE TO WS-554-P1-A-WK-UP-LIM-X
116190     ELSE
116200       MOVE W554-ACCT-WEEK-UPCH-LIMIT TO WS-554-P1-A-WK-UP-LIM.
116210     MOVE W554-ORDER-DOWNCHG-LIMIT-FLAG TO
116220           WS-554-P1-ORD-DN-LIM-FLG.
116230     MOVE W554-RND-551-UPCH-OPT TO WS-554-P1-RND-551-UP-OPT.
116240     MOVE W554-MSRP-CATALOG-VERSION TO WS-554-P1-MSRP-CAT-VERS.
116250     MOVE W554-MSRP-INTERNET-CAT-VERSION TO
116260           WS-554-P1-INTERNET-CAT-V.
116270     MOVE W554-ORDER-TYPE-INCL-TABLE (1:144) TO
116280           WS-554-P2-ORD-TYP-INCL.
116290     MOVE W554-ORDER-TYPE-INCL-TABLE (145:144) TO
116300           WS-554-P2X-ORD-TYP-INCL.
116310*
116320   6060-FORMAT-W554-ENTRY.
116330     MOVE W554-PRODUCT-CODE (W554-IX-ENTRY) TO
116340           WS-554-P3A-PROD-CODE.
116350     MOVE W554-DESCRIPTIVE-QTY (W554-IX-ENTRY) TO
116360           WS-554-P3A-DESCR-QTY.
116370     MOVE W554-PROD-KEY-UNITS (W554-IX-ENTRY) TO
116380           WS-554-P3A-KEY-UNITS.
116390     MOVE W554-REORDER-FLAG (W554-IX-ENTRY) TO
116400           WS-554-P3A-REORD-FLAG.
116410     MOVE W554-AOE-FLAG (W554-IX-ENTRY) TO WS-554-P3A-AOE-FLAG.
116420     MOVE W554-RESALE-PRICE-BEFORE-UPCH (W554-IX-ENTRY) TO
116430           WS-554-P3A-RSL-B4-UPCH.
116440     MOVE W554-ROUNDING-FLAG (W554-IX-ENTRY) TO
116450           WS-554-P3A-ROUNDING.
116460     MOVE W554-NORMAL-UPCH-1-BASIS (W554-IX-ENTRY) TO
116470           WS-554-P3A-N1-BASIS.
116480     MOVE W554-NORMAL-UPCH-2-BASIS (W554-IX-ENTRY) TO
116490           WS-554-P3A-N2-BASIS.
116500     MOVE W554-NORMAL-UPCH-3-BASIS (W554-IX-ENTRY) TO
116510           WS-554-P3A-N3-BASIS.
116520     MOVE W554-UPCH-CEILING-BASIS (W554-IX-ENTRY) TO
116530           WS-554-P3A-C-BASIS.
116540     MOVE W554-UPCH-FLOOR-BASIS (W554-IX-ENTRY) TO
116550           WS-554-P3A-F-BASIS.
116560     IF WS-554-P3A-N1-BASIS EQUAL SPACE
116570       MOVE SPACE TO WS-554-P3A-N1-RATE-X
116580     ELSE
116590       MOVE W554-NORMAL-UPCH-1-RATE (W554-IX-ENTRY) TO
116600             WS-RATE-WORK-4X
116610       IF WS-554-P3A-N1-BASIS IS ALPHABETIC
116620         MOVE WS-RATE-WORK-4N TO WS-554-P3A-N1-RATE-P
116630         MOVE '%' TO WS-554-P3A-N1-PCT-SGN
116640       ELSE
116650         MOVE WS-RATE-WORK-4N TO WS-554-P3A-N1-RATE-D
116660         MOVE SPACE TO WS-554-P3A-N1-PCT-SGN.
116670     IF WS-554-P3A-N2-BASIS EQUAL SPACE
116680       MOVE SPACE TO WS-554-P3A-N2-RATE-X
116690     ELSE
116700       MOVE W554-NORMAL-UPCH-2-RATE (W554-IX-ENTRY) TO
116710             WS-RATE-WORK-4X
116720       IF WS-554-P3A-N2-BASIS IS ALPHABETIC
116730         MOVE WS-RATE-WORK-4N TO WS-554-P3A-N2-RATE-P
116740         MOVE '%' TO WS-554-P3A-N2-PCT-SGN
116750       ELSE
116760         MOVE WS-RATE-WORK-4N TO WS-554-P3A-N2-RATE-D
116770         MOVE SPACE TO WS-554-P3A-N2-PCT-SGN.
116780     IF WS-554-P3A-N3-BASIS EQUAL SPACE
116790       MOVE SPACE TO WS-554-P3A-N3-RATE-X
116800     ELSE
116810       MOVE W554-NORMAL-UPCH-3-RATE (W554-IX-ENTRY) TO
116820             WS-RATE-WORK-4X
116830       IF WS-554-P3A-N3-BASIS IS ALPHABETIC
116840         MOVE WS-RATE-WORK-4N TO WS-554-P3A-N3-RATE-P
116850         MOVE '%' TO WS-554-P3A-N3-PCT-SGN
116860       ELSE
116870         MOVE WS-RATE-WORK-4N TO WS-554-P3A-N3-RATE-D
116880         MOVE SPACE TO WS-554-P3A-N3-PCT-SGN.
116890     IF WS-554-P3A-C-BASIS EQUAL SPACE
116900       MOVE SPACE TO WS-554-P3A-C-RATE-X
116910     ELSE
116920       MOVE W554-UPCH-CEILING-RATE (W554-IX-ENTRY) TO
116930             WS-RATE-WORK-4X
116940       IF WS-554-P3A-C-BASIS IS ALPHABETIC
116950         MOVE WS-RATE-WORK-4N TO WS-554-P3A-C-RATE-P
116960         MOVE '%' TO WS-554-P3A-C-PCT-SGN
116970       ELSE
116980         MOVE WS-RATE-WORK-4N TO WS-554-P3A-C-RATE-D
116990         MOVE SPACE TO WS-554-P3A-C-PCT-SGN.
117000     IF WS-554-P3A-F-BASIS EQUAL SPACE
117010       MOVE SPACE TO WS-554-P3A-F-RATE-X
117020     ELSE
117030       MOVE W554-UPCH-FLOOR-RATE (W554-IX-ENTRY) TO
117040             WS-RATE-WORK-4X
117050       IF WS-554-P3A-F-BASIS IS ALPHABETIC
117060         MOVE WS-RATE-WORK-4N TO WS-554-P3A-F-RATE-P
117070         MOVE '%' TO WS-554-P3A-F-PCT-SGN
117080       ELSE
117090         MOVE WS-RATE-WORK-4N TO WS-554-P3A-F-RATE-D
117100         MOVE SPACE TO WS-554-P3A-F-PCT-SGN.
117110     MOVE WS-554-P3A TO WS-PRT-554-552-LINE
117120           (IX-WS-PRT-554-552-IN).
117130     SET IX-WS-PRT-554-552-IN UP BY 1.
117140     MOVE W554-INCLUDED-PROMO-GROUPS (W554-IX-ENTRY) TO
117150           WS-UPCH-ATTR-WORK.
117160     IF WS-1637-ENTRY-COUNT NOT GREATER +0
117170       MOVE WS-UPCH-ATTR-WORK TO WS-554-P3B-DESCR (1)
117180     ELSE
117190       MOVE SPACE TO WS-554-P3B-TABLE
117200       SET IX-WS-554-P3B TO +1
117210       IF WS-UPCH-ATTR-BYTE (1) IS ALPHABETIC
117220         SET IX-WS-UPCH-ATTR TO +1
117230         PERFORM
117240             UNTIL (IX-WS-UPCH-ATTR GREATER +5)
117250                 OR (WS-UPCH-ATTR-BYTE (IX-WS-UPCH-ATTR)
117260                       EQUAL SPACE)
117270           SEARCH ALL WS-1637-TBL-ENTRY
117280             AT END
117290               MOVE WS-UPCH-ATTR-BYTE (IX-WS-UPCH-ATTR) TO
117300                     WS-554-P3B-DESCR (IX-WS-554-P3B)
117310             WHEN WS-1637-KEY (IX-WS-1637-TBL) EQUAL
117320                   WS-UPCH-ATTR-BYTE (IX-WS-UPCH-ATTR)
117330               MOVE WS-1637-DESCRIPTION (IX-WS-1637-TBL) TO
117340                     WS-554-P3B-DESCR (IX-WS-554-P3B)
117350           END-SEARCH
117360           SET IX-WS-UPCH-ATTR IX-WS-554-P3B UP BY 1
117370         END-PERFORM
117380       ELSE
117390*                * FIRST IS '*' (MEANING "ALL") OR '-' (MEANING
117400*                 "ALL EXCEPT ..." *
117410         SET IX-WS-1637-TBL TO +1
117420         PERFORM
117430             UNTIL (IX-WS-1637-TBL GREATER WS-1637-ENTRY-COUNT)
117440                 OR (IX-WS-554-P3B GREATER +9)
117450           IF (WS-UPCH-ATTR-BYTE (1) EQUAL '*')
117460               OR (WS-1637-KEY (IX-WS-1637-TBL) NOT EQUAL
117470                     WS-UPCH-ATTR-BYTE (2) AND
117480                     WS-UPCH-ATTR-BYTE (3) AND
117490                     WS-UPCH-ATTR-BYTE (4) AND
117500                     WS-UPCH-ATTR-BYTE (5))
117510             MOVE WS-1637-DESCRIPTION (IX-WS-1637-TBL) TO
117520                   WS-554-P3B-DESCR (IX-WS-554-P3B)
117530             SET IX-WS-554-P3B UP BY 1
117540           END-IF
117550           SET IX-WS-1637-TBL UP BY 1
117560         END-PERFORM.
117570     MOVE WS-554-P3B TO WS-PRT-554-552-LINE
117580           (IX-WS-PRT-554-552-IN).
117590     SET IX-WS-PRT-554-552-IN UP BY 1.
117600*
117610   6070-PRINT-554-FIXED.
117620     MOVE WS-PRT-554-552-ENTRY-CT TO WS-554-P1-ENTRY-COUNT.
117630     MOVE +5 TO WS-LINES-NEEDED.
117640     IF WS-554-P2-ORD-TYP-INCL NOT EQUAL SPACES
117650       ADD 5 TO WS-LINES-NEEDED.
117660     IF WS-554-P2X-ORD-TYP-INCL NOT EQUAL SPACES
117670       ADD 5 TO WS-LINES-NEEDED.
117680     PERFORM 0500-CHECK-FOR-HEADINGS.
117690     IF WS-LINE-COUNT GREATER +3
117700       MOVE +2 TO WS-LINE-SPACER.
117710     MOVE WS-554-C1A TO PRINTER1-RECORD.
117720     PERFORM 0600-WRITE-PRINTER1-RECORD.
117730     MOVE +1 TO WS-LINE-SPACER.
117740     MOVE WS-554-C1B TO PRINTER1-RECORD.
117750     PERFORM 0600-WRITE-PRINTER1-RECORD.
117760     MOVE WS-554-D1 TO PRINTER1-RECORD.
117770     PERFORM 0600-WRITE-PRINTER1-RECORD.
117780     MOVE WS-554-P1 TO PRINTER1-RECORD.
117790     PERFORM 0600-WRITE-PRINTER1-RECORD.
117800     IF WS-554-P2-ORD-TYP-INCL NOT EQUAL SPACES
117810       MOVE +2 TO WS-LINE-SPACER
117820       MOVE WS-554-C2A TO PRINTER1-RECORD
117830       PERFORM 0600-WRITE-PRINTER1-RECORD
117840       MOVE +1 TO WS-LINE-SPACER
117850       MOVE WS-554-C2B TO PRINTER1-RECORD
117860       PERFORM 0600-WRITE-PRINTER1-RECORD
117870       MOVE WS-554-D2 TO PRINTER1-RECORD
117880       PERFORM 0600-WRITE-PRINTER1-RECORD
117890       MOVE WS-554-P2 TO PRINTER1-RECORD
117900       PERFORM 0600-WRITE-PRINTER1-RECORD.
117910     IF WS-554-P2X-ORD-TYP-INCL NOT EQUAL SPACES
117920       MOVE +2 TO WS-LINE-SPACER
117930       MOVE WS-554-C2AX TO PRINTER1-RECORD
117940       PERFORM 0600-WRITE-PRINTER1-RECORD
117950       MOVE +1 TO WS-LINE-SPACER
117960       MOVE WS-554-C2BX TO PRINTER1-RECORD
117970       PERFORM 0600-WRITE-PRINTER1-RECORD
117980       MOVE WS-554-D2 TO PRINTER1-RECORD
117990       PERFORM 0600-WRITE-PRINTER1-RECORD
118000       MOVE WS-554-P2X TO PRINTER1-RECORD
118010       PERFORM 0600-WRITE-PRINTER1-RECORD.
118020*
118030   6080-PRINT-554-ENTRY.
118040     IF PRINT-COLUMN-HEAD
118050       MOVE +5 TO WS-LINES-NEEDED
118060     ELSE
118070       MOVE +2 TO WS-LINES-NEEDED.
118080     PERFORM 0500-CHECK-FOR-HEADINGS.
118090     IF PRINT-COLUMN-HEAD
118100       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
118110       IF WS-LINE-COUNT NOT GREATER +3
118120*                * CONTINUED AFTER PAGE BREAK - REPRINT KEY *
118130         MOVE WS-554-C1B (1:63) TO PRINTER1-RECORD (1:63)
118140         MOVE SPACE TO PRINTER1-RECORD (64:87)
118150         PERFORM 0600-WRITE-PRINTER1-RECORD
118160         MOVE WS-554-D1 (1:63) TO PRINTER1-RECORD (1:63)
118170         MOVE SPACE TO PRINTER1-RECORD (64:87)
118180         PERFORM 0600-WRITE-PRINTER1-RECORD
118190         MOVE WS-554-P1 (1:63) TO PRINTER1-RECORD (1:63)
118200         MOVE SPACE TO PRINTER1-RECORD (64:37)
118210         MOVE '(CONTINUED)' TO PRINTER1-RECORD (101:11)
118220         MOVE SPACE TO PRINTER1-RECORD (112:39)
118230         PERFORM 0600-WRITE-PRINTER1-RECORD
118240       END-IF
118250       MOVE WS-554-C3 TO PRINTER1-RECORD
118260       MOVE +2 TO WS-LINE-SPACER
118270       PERFORM 0600-WRITE-PRINTER1-RECORD
118280       MOVE +1 TO WS-LINE-SPACER
118290       MOVE WS-554-D3 TO PRINTER1-RECORD
118300       PERFORM 0600-WRITE-PRINTER1-RECORD.
118310     MOVE WS-PRT-554-552-LINE (IX-WS-PRT-554-552-OUT) TO
118320           PRINTER1-RECORD.
118330     SET IX-WS-PRT-554-552-OUT UP BY 1.
118340     PERFORM 0600-WRITE-PRINTER1-RECORD.
118350     MOVE WS-PRT-554-552-LINE (IX-WS-PRT-554-552-OUT) TO
118360           PRINTER1-RECORD.
118370     SET IX-WS-PRT-554-552-OUT UP BY 1.
118380     PERFORM 0600-WRITE-PRINTER1-RECORD.
118390*
118400   6100-CHECK-I554T-FILE.
118410     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
118420     MOVE '554T FILE: ' TO WS-FILE-HD-FILE-NBR.
118430     MOVE 'UPCHARGE FILE - TEST RECORDS' TO WS-FILE-HD-FILE-NAME.
118440     SET IX-WS-UPCH-KEY-CURR TO +1.
118450     PERFORM
118460         WITH TEST AFTER
118470         UNTIL IX-WS-UPCH-KEY-CURR NOT LESS IX-WS-UPCH-KEY-EMPTY
118480       MOVE WS-TBL-UPCH-KEY (IX-WS-UPCH-KEY-CURR) TO
118490             W554-SHORT-KEY O554-SHORT-KEY
118500       MOVE SPACE TO W554-RECORD-PART O554-RECORD-PART
118510       READ I554T-FILE KEY O554-KEY
118520       IF WS-I554T-SUCCESSFUL
118530         MOVE O554-SHORT-RECORD TO W554-SHORT-RECORD
118540         PERFORM 6050-FORMAT-W554-FIXED
118550         MOVE +0 TO WS-PRT-554-552-ENTRY-CT
118560         SET IX-WS-PRT-554-552-IN TO +1
118570         IF O554-ENTRY-COUNT GREATER +0
118580           MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
118590           PERFORM
118600               WITH TEST AFTER
118610               UNTIL WS-I554T-END-OF-FILE
118620                   OR (O554-SHORT-KEY NOT EQUAL W554-SHORT-KEY)
118630                   OR (O554-ENTRY-COUNT NOT GREATER +0)
118640             MOVE O554-ENTRY-COUNT TO W554-ENTRY-COUNT
118650             ADD W554-ENTRY-COUNT TO WS-PRT-554-552-ENTRY-CT
118660             MOVE O554-VARIABLE-PORTION-INFO TO
118670                   W554-VARIABLE-PORTION-INFO
118680             PERFORM 6060-FORMAT-W554-ENTRY
118690                 VARYING W554-IX-ENTRY FROM +1 BY +1
118700                 UNTIL W554-IX-ENTRY GREATER W554-ENTRY-COUNT
118710             PERFORM 6110-READ-I554T-FILE-NEXT
118720           END-PERFORM
118730         END-IF
118740         PERFORM 6070-PRINT-554-FIXED
118750         IF IX-WS-PRT-554-552-IN GREATER +1
118760           SET IX-WS-PRT-554-552-OUT TO +1
118770           PERFORM 6080-PRINT-554-ENTRY
118780               WITH TEST AFTER
118790               UNTIL IX-WS-PRT-554-552-OUT NOT LESS
118800                     IX-WS-PRT-554-552-IN
118810         END-IF
118820       ELSE
118830         IF NOT WS-I554T-NO-SUCH-RECORD
118840           DISPLAY '* VSAM ERROR ON I554T READ. KEY = "'
118850                 W554-KEY '". FILE STATUS = ' WS-I554T-FILE-STATUS
118860                 '. *' UPON SYSOUT
118870           GO TO 9900-DISPLAY-ABORT
118880         END-IF
118890       END-IF
118900       SET IX-WS-UPCH-KEY-CURR UP BY 1
118910     END-PERFORM.
118920*
118930   6110-READ-I554T-FILE-NEXT.
118940     READ I554T-FILE NEXT RECORD.
118950     IF (NOT WS-I554T-SUCCESSFUL)
118960         AND (NOT WS-I554T-END-OF-FILE)
118970       DISPLAY '* VSAM ERROR ON I554T READ NEXT. FILE STATUS = '
118980             WS-I554T-FILE-STATUS '. *' UPON SYSOUT
118990       GO TO 9900-DISPLAY-ABORT.
119000*
119010*
119020*
119030   6120-CHECK-I8935-FILE.
119040     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
119050     MOVE '8935 FILE: ' TO WS-FILE-HD-FILE-NBR.
119060     MOVE 'CLUB PROGRAMS - BILLING FILE' TO WS-FILE-HD-FILE-NAME.
119070     MOVE WS-IPARM-BC TO I8935-BC.
119080     MOVE LOW-VALUES TO I8935-EXPENSE-CODE.
119090     START I8935-FILE KEY NOT LESS I8935-KEY.
119100     IF WS-I8935-SUCCESSFUL
119110       PERFORM 6123-READ-I8935-FILE-NEXT
119120     ELSE
119130       IF (NOT WS-I8935-NO-SUCH-RECORD)
119140           AND (NOT WS-I8935-END-OF-FILE)
119150         DISPLAY '* VSAM ERROR ON I8935 START FOR BC "'
119160               WS-IPARM-BC '".  FILE STATUS = '
119170               WS-I8935-FILE-STATUS '. *' UPON SYSOUT
119180         GO TO 9900-DISPLAY-ABORT.
119190     PERFORM 6121-EACH-I8935-REC
119200         WITH TEST BEFORE
119210         UNTIL (NOT WS-I8935-SUCCESSFUL)
119220             OR (I8935-BC NOT EQUAL WS-IPARM-BC).
119230*
119240   6121-EACH-I8935-REC.
119250     IF I8935-ENTRY-COUNT GREATER +2
119260       ADD I8935-ENTRY-COUNT +1 GIVING WS-LINES-NEEDED
119270     ELSE
119280       MOVE +3 TO WS-LINES-NEEDED.
119290     IF PRINT-FILE-HEAD
119300       ADD 4 TO WS-LINES-NEEDED.
119310     PERFORM 0500-CHECK-FOR-HEADINGS.
119320     IF PRINT-COLUMN-HEAD
119330       PERFORM 6124-PRINT-8935-COL-HDGS
119340     ELSE
119350       MOVE +2 TO WS-LINE-SPACER.
119360     MOVE I8935-8934-HOLDING-CO TO WS-8935-P1-8934-KEY-HC.
119370     MOVE I8935-8934-MASTER-BC TO WS-8935-P1-8934-KEY-MBC.
119380     MOVE I8935-8934-BC TO WS-8935-P1-8934-KEY-BC.
119390     MOVE I8935-8934-EXP-CODE TO WS-8935-P1-8934-KEY-EXP.
119400     MOVE I8935-LAST-UPDATE TO WS-8935-P1-LAST-UPDATE.
119410     MOVE I8935-ENTRY-COUNT TO WS-8935-P1-ENTRY-COUNT.
119420     IF I8935-8934-EXP-CODE EQUAL SPACE
119430       MOVE SPACE TO WS-662P-INFO-FOR-8935
119440     ELSE
119450       MOVE I8935-8934-EXP-CODE TO WS-662P-EXP-CD-FOR-8935
119460       PERFORM 6125-GET-662P-INFO-FOR-8935.
119470     IF I8935-ENTRY-COUNT GREATER +0
119480       SET I8935-IX-ENTRY TO +1
119490       PERFORM 6122-EACH-I8935-ENTRY I8935-ENTRY-COUNT TIMES
119500     ELSE
119510       MOVE WS-8935-P1 TO PRINTER1-RECORD
119520       PERFORM 0600-WRITE-PRINTER1-RECORD
119530       MOVE SPACE TO WS-8935-P1.
119540     IF (I8935-ENTRY-COUNT LESS +2)
119550         AND FOUND-662P-FOR-8935
119560       MOVE +1 TO WS-LINE-SPACER
119570       MOVE WS-662P-DESCR-FOR-8935 TO WS-8935-P1-EXP-DESCR
119580       MOVE WS-8935-P1 TO PRINTER1-RECORD
119590       PERFORM 0600-WRITE-PRINTER1-RECORD
119600       MOVE SPACE TO WS-8935-P1.
119610     PERFORM 6123-READ-I8935-FILE-NEXT.
119620*
119630   6122-EACH-I8935-ENTRY.
119640     IF WS-LINE-COUNT GREATER +86
119650       MOVE +1 TO WS-LINES-NEEDED
119660       PERFORM 0500-CHECK-FOR-HEADINGS
119670       PERFORM 6124-PRINT-8935-COL-HDGS.
119680     MOVE I8935-MATCH-PRODUCT (I8935-IX-ENTRY) TO
119690           WS-8935-P1-MATCH-PROD.
119700     IF I8935-MATCH-IMPRINT-QTY-X (I8935-IX-ENTRY) NOT EQUAL
119710           SPACE
119720       MOVE I8935-MATCH-IMPRINT-QTY (I8935-IX-ENTRY) TO
119730             WS-8935-P1-MATCH-IMP-QTY.
119740     MOVE I8935-MATCH-REORDER-FLAG (I8935-IX-ENTRY) TO
119750           WS-8935-P1-MATCH-REORD.
119760     MOVE I8935-MATCH-ORDER-CHANNEL (I8935-IX-ENTRY) TO
119770           WS-8935-P1-MATCH-ORD-CH.
119780     MOVE I8935-PRODUCT-INSTRUCTION (I8935-IX-ENTRY) TO
119790           WS-8935-P1-PROD-INSTR.
119800     MOVE I8935-ENHANCEMENT-INSTRUCTION (I8935-IX-ENTRY) TO
119810           WS-8935-P1-ENH-INSTR.
119820     IF WS-8935-P1-PROD-INSTR EQUAL 'A'
119830       MOVE I8935-DISCT-FEB-PROD-CODE (I8935-IX-ENTRY) TO
119840             WS-8935-P1-DISCT-FEB
119850       MOVE I8935-DISCT-PROD-QTY-X (I8935-IX-ENTRY) TO
119860             WS-8935-P1-DISCT-DQ
119870       MOVE I8935-DISCT-CI-OR-S1-CODE (I8935-IX-ENTRY) TO
119880             WS-8935-P1-DISCT-CI-S1
119890       MOVE I8935-DISCT-PROD-DESCRIPTION (I8935-IX-ENTRY) TO
119900             WS-8935-P1-DISCT-DESCR
119910     ELSE
119920       IF WS-8935-P1-PROD-INSTR EQUAL 'D' OR 'O' OR 'P' OR 'S'
119930         MOVE I8935-DISCOUNT-RATE (I8935-IX-ENTRY) TO
119940               WS-8935-P1-RATE
119950         IF WS-8935-P1-PROD-INSTR EQUAL 'P'
119960           MOVE '%' TO WS-8935-P1-PERCENT-SIGN.
119970     IF I8935-IX-ENTRY EQUAL +2
119980       MOVE WS-662P-DESCR-FOR-8935 TO WS-8935-P1-EXP-DESCR.
119990     SET I8935-IX-ENTRY UP BY 1.
120000     MOVE WS-8935-P1 TO PRINTER1-RECORD.
120010     PERFORM 0600-WRITE-PRINTER1-RECORD.
120020     MOVE SPACE TO WS-8935-P1.
120030     MOVE +1 TO WS-LINE-SPACER.
120040*
120050   6123-READ-I8935-FILE-NEXT.
120060     READ I8935-FILE NEXT RECORD.
120070     IF (NOT WS-I8935-SUCCESSFUL)
120080         AND (NOT WS-I8935-END-OF-FILE)
120090       DISPLAY '* VSAM ERROR ON I8935 SEQUENTIAL READ.  FILE STATU
120100-            'S = ' WS-I8935-FILE-STATUS '. *' UPON SYSOUT
120110       GO TO 9900-DISPLAY-ABORT.
120120*
120130   6124-PRINT-8935-COL-HDGS.
120140     MOVE SPACE TO WS-COLUMN-HEAD-FLAG.
120150     MOVE WS-8935-C1A TO PRINTER1-RECORD.
120160     PERFORM 0600-WRITE-PRINTER1-RECORD.
120170     MOVE WS-8935-C1B TO PRINTER1-RECORD.
120180     PERFORM 0600-WRITE-PRINTER1-RECORD.
120190     MOVE WS-8935-D1 TO PRINTER1-RECORD.
120200     PERFORM 0600-WRITE-PRINTER1-RECORD.
120210*
120220   6125-GET-662P-INFO-FOR-8935.
120230     MOVE SPACE TO WS-662P-DESCR-FOR-8935 WS-662P-FOR-8935-FLAG.
120240     IF WS-662P-BC-ENT-CT GREATER 0
120250       SET IX-WS-662P-BC-TBL TO +1
120260       PERFORM
120270           WITH TEST AFTER
120280           UNTIL FOUND-662P-FOR-8935
120290               OR (IX-WS-662P-BC-TBL GREATER WS-662P-BC-ENT-CT)
120300         IF WS-662P-BC-TBL-EXP-CD (IX-WS-662P-BC-TBL) EQUAL
120310               WS-662P-EXP-CD-FOR-8935
120320           MOVE WS-662P-BC-TBL-DESCR (IX-WS-662P-BC-TBL) TO
120330                 WS-662P-DESCR-FOR-8935
120340           MOVE 'Y' TO WS-662P-FOR-8935-FLAG
120350         ELSE
120360           SET IX-WS-662P-BC-TBL UP BY 1
120370         END-IF
120380       END-PERFORM.
120390     IF (NOT FOUND-662P-FOR-8935)
120400         AND (WS-662P-NBC-ENT-CT GREATER 0)
120410       SET IX-WS-662P-NBC-TBL TO +1
120420       PERFORM
120430           WITH TEST AFTER
120440           UNTIL FOUND-662P-FOR-8935
120450               OR (IX-WS-662P-NBC-TBL GREATER WS-662P-NBC-ENT-CT)
120460         IF WS-662P-NBC-TBL-EXP-CD (IX-WS-662P-NBC-TBL) EQUAL
120470               WS-662P-EXP-CD-FOR-8935
120480           MOVE WS-662P-NBC-TBL-DESCR (IX-WS-662P-NBC-TBL) TO
120490                 WS-662P-DESCR-FOR-8935
120500           MOVE 'Y' TO WS-662P-FOR-8935-FLAG
120510         ELSE
120520           SET IX-WS-662P-NBC-TBL UP BY 1
120530         END-IF
120540       END-PERFORM.
120550*
120560   6130-CHECK-I8935T-FILE.
120570     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
120580     MOVE '8935T FILE:' TO WS-FILE-HD-FILE-NBR.
120590     MOVE 'CLUB PROGRAMS - BILLING FILE - TEST RECORDS'
120600           TO WS-FILE-HD-FILE-NAME.
120610     MOVE WS-IPARM-BC TO O8935-BC.
120620     MOVE LOW-VALUES TO O8935-EXPENSE-CODE.
120630     START I8935T-FILE KEY NOT LESS O8935-KEY.
120640     IF WS-I8935T-SUCCESSFUL
120650       PERFORM 6133-READ-I8935T-FILE-NEXT
120660     ELSE
120670       IF (NOT WS-I8935T-NO-SUCH-RECORD)
120680           AND (NOT WS-I8935T-END-OF-FILE)
120690         DISPLAY '* VSAM ERROR ON I8935T START FOR BC "'
120700               WS-IPARM-BC '".  FILE STATUS = '
120710               WS-I8935T-FILE-STATUS '. *' UPON SYSOUT
120720         GO TO 9900-DISPLAY-ABORT.
120730     PERFORM 6131-EACH-I8935T-REC
120740         WITH TEST BEFORE
120750         UNTIL (NOT WS-I8935T-SUCCESSFUL)
120760             OR (O8935-BC NOT EQUAL WS-IPARM-BC).
120770*
120780   6131-EACH-I8935T-REC.
120790     IF O8935-ENTRY-COUNT GREATER +2
120800       ADD O8935-ENTRY-COUNT +1 GIVING WS-LINES-NEEDED
120810     ELSE
120820       MOVE +3 TO WS-LINES-NEEDED.
120830     IF PRINT-FILE-HEAD
120840       ADD 4 TO WS-LINES-NEEDED.
120850     PERFORM 0500-CHECK-FOR-HEADINGS.
120860     IF PRINT-COLUMN-HEAD
120870       PERFORM 6124-PRINT-8935-COL-HDGS
120880     ELSE
120890       MOVE +2 TO WS-LINE-SPACER.
120900     MOVE O8935-8934-HOLDING-CO TO WS-8935-P1-8934-KEY-HC.
120910     MOVE O8935-8934-MASTER-BC TO WS-8935-P1-8934-KEY-MBC.
120920     MOVE O8935-8934-BC TO WS-8935-P1-8934-KEY-BC.
120930     MOVE O8935-8934-EXP-CODE TO WS-8935-P1-8934-KEY-EXP.
120940     MOVE O8935-LAST-UPDATE TO WS-8935-P1-LAST-UPDATE.
120950     MOVE O8935-ENTRY-COUNT TO WS-8935-P1-ENTRY-COUNT.
120960     IF O8935-8934-EXP-CODE EQUAL SPACE
120970       MOVE SPACE TO WS-662P-INFO-FOR-8935
120980     ELSE
120990       MOVE O8935-8934-EXP-CODE TO WS-662P-EXP-CD-FOR-8935
121000       PERFORM 6125-GET-662P-INFO-FOR-8935.
121010     IF O8935-ENTRY-COUNT GREATER +0
121020       SET O8935-IX-ENTRY TO +1
121030       PERFORM 6132-EACH-I8935T-ENTRY O8935-ENTRY-COUNT TIMES
121040     ELSE
121050       MOVE WS-8935-P1 TO PRINTER1-RECORD
121060       PERFORM 0600-WRITE-PRINTER1-RECORD
121070       MOVE SPACE TO WS-8935-P1.
121080     IF (O8935-ENTRY-COUNT LESS +2)
121090         AND FOUND-662P-FOR-8935
121100       MOVE +1 TO WS-LINE-SPACER
121110       MOVE WS-662P-DESCR-FOR-8935 TO WS-8935-P1-EXP-DESCR
121120       MOVE WS-8935-P1 TO PRINTER1-RECORD
121130       PERFORM 0600-WRITE-PRINTER1-RECORD
121140       MOVE SPACE TO WS-8935-P1.
121150     PERFORM 6133-READ-I8935T-FILE-NEXT.
121160*
121170   6132-EACH-I8935T-ENTRY.
121180     IF WS-LINE-COUNT GREATER +86
121190       MOVE +1 TO WS-LINES-NEEDED
121200       PERFORM 0500-CHECK-FOR-HEADINGS
121210       PERFORM 6124-PRINT-8935-COL-HDGS.
121220     MOVE O8935-MATCH-PRODUCT (O8935-IX-ENTRY) TO
121230           WS-8935-P1-MATCH-PROD.
121240     IF O8935-MATCH-IMPRINT-QTY-X (O8935-IX-ENTRY) NOT EQUAL
121250           SPACE
121260       MOVE O8935-MATCH-IMPRINT-QTY (O8935-IX-ENTRY) TO
121270             WS-8935-P1-MATCH-IMP-QTY.
121280     MOVE O8935-MATCH-REORDER-FLAG (O8935-IX-ENTRY) TO
121290           WS-8935-P1-MATCH-REORD.
121300     MOVE O8935-MATCH-ORDER-CHANNEL (O8935-IX-ENTRY) TO
121310           WS-8935-P1-MATCH-ORD-CH.
121320     MOVE O8935-PRODUCT-INSTRUCTION (O8935-IX-ENTRY) TO
121330           WS-8935-P1-PROD-INSTR.
121340     MOVE O8935-ENHANCEMENT-INSTRUCTION (O8935-IX-ENTRY) TO
121350           WS-8935-P1-ENH-INSTR.
121360     IF WS-8935-P1-PROD-INSTR EQUAL 'A'
121370       MOVE O8935-DISCT-FEB-PROD-CODE (O8935-IX-ENTRY) TO
121380             WS-8935-P1-DISCT-FEB
121390       MOVE O8935-DISCT-PROD-QTY-X (O8935-IX-ENTRY) TO
121400             WS-8935-P1-DISCT-DQ
121410       MOVE O8935-DISCT-CI-OR-S1-CODE (O8935-IX-ENTRY) TO
121420             WS-8935-P1-DISCT-CI-S1
121430       MOVE O8935-DISCT-PROD-DESCRIPTION (O8935-IX-ENTRY) TO
121440             WS-8935-P1-DISCT-DESCR
121450     ELSE
121460       IF WS-8935-P1-PROD-INSTR EQUAL 'D' OR 'O' OR 'P' OR 'S'
121470         MOVE O8935-DISCOUNT-RATE (O8935-IX-ENTRY) TO
121480               WS-8935-P1-RATE
121490         IF WS-8935-P1-PROD-INSTR EQUAL 'P'
121500           MOVE '%' TO WS-8935-P1-PERCENT-SIGN.
121510     IF O8935-IX-ENTRY EQUAL +2
121520       MOVE WS-662P-DESCR-FOR-8935 TO WS-8935-P1-EXP-DESCR.
121530     SET O8935-IX-ENTRY UP BY 1.
121540     MOVE WS-8935-P1 TO PRINTER1-RECORD.
121550     PERFORM 0600-WRITE-PRINTER1-RECORD.
121560     MOVE SPACE TO WS-8935-P1.
121570     MOVE +1 TO WS-LINE-SPACER.
121580*
121590   6133-READ-I8935T-FILE-NEXT.
121600     READ I8935T-FILE NEXT RECORD.
121610     IF (NOT WS-I8935T-SUCCESSFUL)
121620         AND (NOT WS-I8935T-END-OF-FILE)
121630       DISPLAY '* VSAM ERROR ON I8935T SEQUENTIAL READ.  FILE STAT
121640-            'US = ' WS-I8935T-FILE-STATUS '. *' UPON SYSOUT
121650       GO TO 9900-DISPLAY-ABORT.
121660*
121670   6135-CHECK-FOR-C225.
121680     MOVE SPACE TO WS-C225-RPT-FLAG.
121690     IF (WS-C225-TBL-ENT-CT GREATER 0)
121700         AND (WS-HOLDING-COMPANY NOT EQUAL SPACE)
121710       SEARCH ALL WS-C225-TBL-INFO
121720         WHEN WS-C225-TBL-HC (IX-WS-C225-TBL) EQUAL
121730               WS-HOLDING-COMPANY
121740           MOVE WS-C225-TBL-INFO (IX-WS-C225-TBL) TO WS-C225-INFO
121750           MOVE 'H' TO WS-C225-RPT-FLAG.
121760     PERFORM 6136-READ-I225P-FILE
121770         WITH TEST BEFORE
121780         UNTIL END-I225P-FILE
121790             OR (WS-I225P-BC NOT LESS WS-IPARM-BC).
121800     IF WS-I225P-BC EQUAL WS-IPARM-BC
121810       IF WS-C225-RPT-FLAG EQUAL 'H'
121820         MOVE '2' TO WS-C225-RPT-FLAG
121830       ELSE
121840         MOVE 'B' TO WS-C225-RPT-FLAG.
121850     IF REPORT-C225
121860       PERFORM 6137-REPORT-C225.
121870*
121880   6136-READ-I225P-FILE.
121890     READ I225P-FILE
121900       AT END
121910         MOVE 'E' TO WS-I225P-FILE-FLAG
121920       NOT AT END
121930         MOVE WS-I225P-SEQ TO WS-PREV-I225P-SEQ
121940         MOVE I225P-BC TO WS-I225P-BC
121950         MOVE I225P-HC TO WS-I225P-HC
121960         IF WS-I225P-SEQ NOT GREATER WS-PREV-I225P-SEQ
121970           DISPLAY '* I225P SEQUENCE ERROR "' WS-PREV-I225P-SEQ
121980                 '" "' WS-I225P-SEQ '" *' UPON SYSOUT
121990           GO TO 9900-DISPLAY-ABORT
122000         END-IF
122010     END-READ.
122020*
122030   6137-REPORT-C225.
122040     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
122050     MOVE '225C FILE:' TO WS-FILE-HD-FILE-NBR.
122060     MOVE 'OS/BS CLIENT OVERRIDES' TO
122070           WS-FILE-HD-FILE-NAME.
122080     IF REPORT-C225-BOTH
122090       MOVE +4 TO WS-LINES-NEEDED
122100     ELSE
122110       MOVE +3 TO WS-LINES-NEEDED.
122120     PERFORM 0500-CHECK-FOR-HEADINGS.
122130     MOVE WS-225P-C1 TO PRINTER1-RECORD
122140     PERFORM 0600-WRITE-PRINTER1-RECORD
122150     MOVE WS-225P-D1 TO PRINTER1-RECORD
122160     PERFORM 0600-WRITE-PRINTER1-RECORD.
122170     IF REPORT-C225-HC
122180       PERFORM 6138-REPORT-C225-CARD.
122190     IF REPORT-C225-BC
122200       MOVE I225P-INFO TO WS-C225-INFO
122210       PERFORM 6138-REPORT-C225-CARD.
122220*
122230   6138-REPORT-C225-CARD.
122240     MOVE WS-C225-HC TO WS-225P-P1-HC.
122250     MOVE WS-C225-BC TO WS-225P-P1-BC.
122260     IF WS-C225-OS-UNIT-OVR EQUAL SPACE
122270       MOVE WS-C225-TXT-SP TO WS-225P-P1-OS-U-TXT
122280     ELSE
122290       IF WS-C225-OS-UNIT-OVR EQUAL 'Y'
122300         MOVE WS-C225-TXT-Y TO WS-225P-P1-OS-U-TXT
122310       ELSE
122320         MOVE WS-C225-OS-UNIT-OVR TO WS-C225-TXT-UND-VAL
122330         MOVE WS-C225-TXT-UND TO WS-225P-P1-OS-U-TXT.
122340     IF WS-C225-OS-BNDL-OVR EQUAL SPACE
122350       MOVE WS-C225-TXT-SP TO WS-225P-P1-OS-B-TXT
122360     ELSE
122370       IF WS-C225-OS-BNDL-OVR EQUAL 'Y'
122380         MOVE WS-C225-TXT-Y TO WS-225P-P1-OS-B-TXT
122390       ELSE
122400         MOVE WS-C225-OS-BNDL-OVR TO WS-C225-TXT-UND-VAL
122410         MOVE WS-C225-TXT-UND TO WS-225P-P1-OS-B-TXT.
122420     IF WS-C225-BS-BNDL-OVR EQUAL SPACE
122430       MOVE WS-C225-TXT-SP TO WS-225P-P1-BS-B-TXT
122440     ELSE
122450       IF WS-C225-BS-BNDL-OVR EQUAL 'Y'
122460         MOVE WS-C225-TXT-Y TO WS-225P-P1-BS-B-TXT
122470       ELSE
122480         MOVE WS-C225-BS-BNDL-OVR TO WS-C225-TXT-UND-VAL
122490         MOVE WS-C225-TXT-UND TO WS-225P-P1-BS-B-TXT.
122500     MOVE WS-225P-P1 TO PRINTER1-RECORD.
122510     PERFORM 0600-WRITE-PRINTER1-RECORD.
122520*
122530   6140-CHECK-C1921-TABLES.
122540     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
122550     MOVE '1921C FILE:' TO WS-FILE-HD-FILE-NBR.
122560     MOVE 'STANDARD FI EMPLOYEE POLICY EXCEPTIONS' TO
122570           WS-FILE-HD-FILE-NAME.
122580     MOVE +3 TO WS-LINES-NEEDED.
122590     IF WS-C1921-ENTRY-BC-COUNT NOT EQUAL +0
122600       SEARCH ALL WS-C1921-TABLE-BC
122610         WHEN WS-C1921-TABLE-BC (IX-WS-C1921-TBL-BC) EQUAL
122620               WS-IPARM-BC
122630           MOVE 'B' TO WS-1921P-P1-INST-TYPE
122640           MOVE WS-IPARM-BC TO WS-1921P-P1-INST-NBR
122650           PERFORM 6141-REPORT-C1921-ENTRY.
122660     IF WS-C1921-ENTRY-HC-COUNT NOT EQUAL +0
122670       SEARCH ALL WS-C1921-TABLE-HC
122680         WHEN WS-C1921-TABLE-HC (IX-WS-C1921-TBL-HC) EQUAL
122690               WS-HOLDING-COMPANY
122700           MOVE 'H' TO WS-1921P-P1-INST-TYPE
122710           MOVE WS-HOLDING-COMPANY TO WS-1921P-P1-INST-NBR (1:5)
122720           MOVE SPACE TO WS-1921P-P1-INST-NBR (6:3)
122730           PERFORM 6141-REPORT-C1921-ENTRY.
122740*
122750   6141-REPORT-C1921-ENTRY.
122760     PERFORM 0500-CHECK-FOR-HEADINGS.
122770     IF PRINT-COLUMN-HEAD
122780       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
122790       MOVE WS-1921P-C1 TO PRINTER1-RECORD
122800       PERFORM 0600-WRITE-PRINTER1-RECORD
122810       MOVE WS-1921P-D1 TO PRINTER1-RECORD
122820       PERFORM 0600-WRITE-PRINTER1-RECORD
122830       MOVE +1 TO WS-LINES-NEEDED.
122840     MOVE WS-1921P-P1 TO PRINTER1-RECORD.
122850     PERFORM 0600-WRITE-PRINTER1-RECORD.
122860*
122870   6170-CHECK-C506-TABLE.
122880     SET IX-WS-GAS-KEY-CURR TO +1.
122890     PERFORM
122900         WITH TEST BEFORE
122910         UNTIL (IX-WS-GAS-KEY-CURR NOT LESS IX-WS-GAS-KEY-EMPTY)
122920             OR (WS-TBL-GAS-KEY-REC-TYP (IX-WS-GAS-KEY-CURR)
122930                 NOT LESS 'G')
122940       SET IX-WS-GAS-KEY-CURR UP BY 1
122950     END-PERFORM.
122960     IF (IX-WS-GAS-KEY-CURR LESS IX-WS-GAS-KEY-EMPTY)
122970         AND (WS-TBL-GAS-KEY-REC-TYP (IX-WS-GAS-KEY-CURR)
122980               EQUAL 'G')
122990       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
123000       MOVE '506C FILE: ' TO WS-FILE-HD-FILE-NBR
123010       MOVE 'GUARANTEE ADJUSTMENT INCREASE LIMITS' TO
123020             WS-FILE-HD-FILE-NAME
123030       SET IX-WS-C506-TBL-CURR TO +1
123040       PERFORM
123050           WITH TEST AFTER
123060           UNTIL (IX-WS-GAS-KEY-CURR NOT LESS IX-WS-GAS-KEY-EMPTY)
123070               OR (WS-TBL-GAS-KEY-REC-TYP (IX-WS-GAS-KEY-CURR)
123080                     GREATER 'G')
123090               OR (IX-WS-C506-TBL-CURR NOT LESS
123100                     IX-WS-C506-TBL-EMPTY)
123110         PERFORM
123120             WITH TEST BEFORE
123130             UNTIL (IX-WS-C506-TBL-CURR NOT LESS
123140                       IX-WS-C506-TBL-EMPTY)
123150                 OR (WS-C506-TBL-GAS-KEY (IX-WS-C506-TBL-CURR)
123160                       NOT LESS
123170                       WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR))
123180           SET IX-WS-C506-TBL-CURR UP BY 1
123190         END-PERFORM
123200         PERFORM
123210             WITH TEST BEFORE
123220             UNTIL (IX-WS-C506-TBL-CURR NOT LESS
123230                       IX-WS-C506-TBL-EMPTY)
123240                 OR (WS-C506-TBL-GAS-KEY (IX-WS-C506-TBL-CURR)
123250                       GREATER
123260                       WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR))
123270           MOVE WS-C506-TBL-REC (IX-WS-C506-TBL-CURR) TO
123280                 WS-C506-REC
123290           PERFORM 6175-REPORT-C506-REC
123300           SET IX-WS-C506-TBL-CURR UP BY 1
123310         END-PERFORM
123320         SET IX-WS-GAS-KEY-CURR UP BY 1
123330       END-PERFORM.
123340*
123350   6175-REPORT-C506-REC.
123360     IF PRINT-COLUMN-HEAD
123370       MOVE +3 TO WS-LINES-NEEDED
123380     ELSE
123390       MOVE +1 TO WS-LINES-NEEDED.
123400     PERFORM 0500-CHECK-FOR-HEADINGS.
123410     IF PRINT-COLUMN-HEAD
123420       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
123430       MOVE WS-506P-C1 TO PRINTER1-RECORD
123440       PERFORM 0600-WRITE-PRINTER1-RECORD
123450       MOVE WS-506P-D1 TO PRINTER1-RECORD
123460       PERFORM 0600-WRITE-PRINTER1-RECORD.
123470     MOVE WS-C506-HC TO WS-506P-P1-HC.
123480     MOVE WS-C506-HC-DIVS TO WS-506P-P1-HC-DIVS.
123490     MOVE WS-C506-MBC TO WS-506P-P1-MBC.
123500     MOVE WS-C506-MBC-DIVS TO WS-506P-P1-MBC-DIVS.
123510     MOVE WS-C506-BC TO WS-506P-P1-BC.
123520     MOVE WS-C506-PRI-BR TO WS-506P-P1-PRI-BR.
123530     MOVE WS-C506-START-DATE TO WS-506P-P1-START-DATE.
123540     MOVE WS-C506-END-DATE TO WS-506P-P1-END-DATE.
123550     MOVE WS-C506-LIMIT TO WS-506P-P1-LIMIT.
123560     MOVE WS-506P-P1 TO PRINTER1-RECORD.
123570     PERFORM 0600-WRITE-PRINTER1-RECORD.
123580*
123590   6200-CHECK-I552-FILE.
123600     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
123610     MOVE '552 FILE:  ' TO WS-FILE-HD-FILE-NBR.
123620     MOVE 'G.A.S. FILE' TO WS-FILE-HD-FILE-NAME.
123630     SET IX-WS-GAS-KEY-CURR TO +1.
123640     PERFORM
123650         WITH TEST AFTER
123660         UNTIL IX-WS-GAS-KEY-CURR NOT LESS IX-WS-GAS-KEY-EMPTY
123670       MOVE WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR) TO
123680             WS-552-SHORT-KEY I552-SHORT-KEY
123690       MOVE SPACE TO WS-552-REC-PART I552-RECORD-PART
123700       READ I552-FILE KEY I552-KEY
123710       IF WS-I552-SUCCESSFUL
123720         MOVE I552-REC TO WS-552-FIXED-INFO
123730         PERFORM 6250-FORMAT-552-FIXED
123740         MOVE +0 TO WS-PRT-554-552-ENTRY-CT
123750         SET IX-WS-PRT-554-552-IN TO +1
123760         IF I552-ENTRY-COUNT GREATER +0
123770           MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
123780           PERFORM
123790               WITH TEST AFTER
123800               UNTIL WS-I552-END-OF-FILE
123810                   OR (I552-SHORT-KEY NOT EQUAL
123820                         WS-552-SHORT-KEY)
123830                   OR (I552-ENTRY-COUNT NOT GREATER +0)
123840             ADD I552-ENTRY-COUNT TO WS-PRT-554-552-ENTRY-CT
123850             IF WS-552-REC-TYPE EQUAL 'G'
123860               PERFORM
123870                   VARYING I552-IX-G-ENTRY FROM +1 BY +1
123880                   UNTIL I552-IX-G-ENTRY GREATER
123890                         I552-G-ENTRY-COUNT
123900                 MOVE I552-G-ADJUSTMENT-ENTRY (I552-IX-G-ENTRY)
123910                       TO WS-552-G-ENTRY
123920                 PERFORM 6260-FORMAT-552-G-ENTRY
123930               END-PERFORM
123940             ELSE
123950               PERFORM
123960                   VARYING I552-IX-AS-ENTRY FROM +1 BY +1
123970                   UNTIL I552-IX-AS-ENTRY GREATER
123980                         I552-AS-ENTRY-COUNT
123990                 MOVE I552-AS-ADJUSTMENT-ENTRY (I552-IX-AS-ENTRY)
124000                       TO WS-552-AS-ENTRY
124010                 PERFORM 6270-FORMAT-552-AS-ENTRY
124020               END-PERFORM
124030             END-IF
124040             PERFORM 6210-READ-I552-FILE-NEXT
124050           END-PERFORM
124060         END-IF
124070         PERFORM 6280-PRINT-552-FIXED
124080         IF IX-WS-PRT-554-552-IN GREATER +1
124090           SET IX-WS-PRT-554-552-OUT TO +1
124100           PERFORM 6290-PRINT-552-ENTRY
124110               WITH TEST AFTER
124120               UNTIL IX-WS-PRT-554-552-OUT NOT LESS
124130                     IX-WS-PRT-554-552-IN
124140         END-IF
124150       ELSE
124160         IF NOT WS-I552-NO-SUCH-RECORD
124170           DISPLAY '* VSAM ERROR ON I552 READ. KEY = "' WS-552-KEY
124180                 '". FILE STATUS = ' WS-I552-FILE-STATUS '. *'
124190                 UPON SYSOUT
124200           GO TO 9900-DISPLAY-ABORT
124210         END-IF
124220       END-IF
124230       SET IX-WS-GAS-KEY-CURR UP BY 1
124240     END-PERFORM.
124250*
124260   6210-READ-I552-FILE-NEXT.
124270     READ I552-FILE NEXT RECORD.
124280     IF (NOT WS-I552-SUCCESSFUL)
124290         AND (NOT WS-I552-END-OF-FILE)
124300       DISPLAY '* VSAM ERROR ON I552 READ NEXT. FILE STATUS = '
124310             WS-I552-FILE-STATUS '. *' UPON SYSOUT
124320       GO TO 9900-DISPLAY-ABORT.
124330*
124340   6250-FORMAT-552-FIXED.
124350     MOVE WS-552-REC-TYPE TO WS-552-P1-REC-TYPE.
124360     MOVE WS-552-HOLDCO TO WS-552-P1-HOLDCO.
124370     MOVE WS-552-HC-DIV-L1 TO WS-552-P1-HC-DIV-L1.
124380     MOVE WS-552-HC-DIV-L2 TO WS-552-P1-HC-DIV-L2.
124390     MOVE WS-552-HC-DIV-L3 TO WS-552-P1-HC-DIV-L3.
124400     MOVE WS-552-MASTER-BC TO WS-552-P1-MASTER-BC.
124410     MOVE WS-552-MBC-DIV-L1 TO WS-552-P1-MBC-DIV-L1.
124420     MOVE WS-552-MBC-DIV-L2 TO WS-552-P1-MBC-DIV-L2.
124430     MOVE WS-552-MBC-DIV-L3 TO WS-552-P1-MBC-DIV-L3.
124440     MOVE WS-552-BC TO WS-552-P1-BC.
124450     MOVE WS-552-PRI-BR TO WS-552-P1-PRI-BR.
124460     MOVE WS-552-SEC-BR TO WS-552-P1-SEC-BR.
124470     MOVE WS-552-BILL-TYPE TO WS-552-P1-BILL-TYPE.
124480     MOVE WS-552-REGION TO WS-552-P1-REGION.
124490     MOVE WS-552-STD-DISCT-KEY TO WS-552-P1-STD-DISCT-KEY.
124500     MOVE WS-552-SCI-TRADE-KEY TO WS-552-P1-SCI-TRADE-KEY.
124510     MOVE WS-552-UPDATE-DT TO WS-552-P1-UPDATE-DT.
124520*
124530   6260-FORMAT-552-G-ENTRY.
124540     MOVE WS-552-G-ENT-TYP TO WS-552-P2-ENT-TYP.
124550     MOVE WS-552-G-PROD-CODE TO WS-552-P2-PROD-CODE.
124560     MOVE WS-552-G-DESCR-QTY TO WS-552-P2-DESCR-QTY.
124570     MOVE WS-552-G-MAIL-METH TO WS-552-P2-MAIL-METH.
124580     MOVE WS-552-G-PRICE-SRCE TO WS-552-P2-PRICE-SRCE.
124590     MOVE WS-552-G-C1128-OVERRIDE TO WS-552-P2-C1128-OVERRIDE.
124600     MOVE WS-552-G-ADJ-OPT TO WS-552-P2-ADJ-OPT.
124610     MOVE WS-552-G-PR-DESIG TO WS-552-P2-PR-DESIG.
124620     IF WS-552-P2-ADJ-OPT EQUAL SPACE
124630       MOVE SPACE TO WS-552-P2-RATE-X
124640     ELSE
124650       MOVE WS-552-G-RATE-X TO WS-RATE-WORK-3X
124660       IF WS-552-P2-ADJ-OPT EQUAL '1' OR '%' OR 'E'
124670         MOVE WS-RATE-WORK-3N TO WS-552-P2-RATE-P
124680         MOVE '%' TO WS-552-P2-PCT-SGN
124690       ELSE
124700         MOVE WS-RATE-WORK-3N TO WS-552-P2-RATE-D
124710         MOVE SPACE TO WS-552-P2-PCT-SGN.
124720     MOVE WS-552-P2 TO WS-PRT-554-552-LINE (IX-WS-PRT-554-552-IN).
124730     SET IX-WS-PRT-554-552-IN UP BY 1.
124740*
124750   6270-FORMAT-552-AS-ENTRY.
124760     MOVE WS-552-AS-PROD-CODE TO WS-552-P3-PROD-CODE.
124770     MOVE WS-552-AS-DESCR-QTY TO WS-552-P3-DESCR-QTY.
124780     MOVE WS-552-AS-REORD-FLG TO WS-552-P3-REORD-FLG.
124790     MOVE WS-552-AS-UNITS TO WS-552-P3-UNITS.
124800     MOVE WS-552-AS-ORD-CHNL TO WS-552-P3-ORD-CHNL.
124810     MOVE WS-552-AS-C1128-OVERRIDE TO WS-552-P3-C1128-OVERRIDE.
124820     MOVE WS-552-AS-S1-BASIS TO WS-552-P3-S1-BASIS.
124830     MOVE WS-552-AS-S2-BASIS TO WS-552-P3-S2-BASIS.
124840     MOVE WS-552-AS-S3-BASIS TO WS-552-P3-S3-BASIS.
124850     IF WS-552-P3-S1-BASIS EQUAL SPACE
124860       MOVE SPACE TO WS-552-P3-S1-RATE-X
124870     ELSE
124880       MOVE WS-552-AS-S1-RATE-X TO WS-RATE-WORK-3X
124890       IF WS-552-P3-S1-BASIS IS ALPHABETIC
124900         MOVE WS-RATE-WORK-3N TO WS-552-P3-S1-RATE-P
124910         MOVE '%' TO WS-552-P3-S1-PCT-SGN
124920       ELSE
124930         MOVE WS-RATE-WORK-3N TO WS-552-P3-S1-RATE-D
124940         MOVE SPACE TO WS-552-P3-S1-PCT-SGN.
124950     IF WS-552-P3-S2-BASIS EQUAL SPACE
124960       MOVE SPACE TO WS-552-P3-S2-RATE-X
124970     ELSE
124980       MOVE WS-552-AS-S2-RATE-X TO WS-RATE-WORK-3X
124990       IF WS-552-P3-S2-BASIS IS ALPHABETIC
125000         MOVE WS-RATE-WORK-3N TO WS-552-P3-S2-RATE-P
125010         MOVE '%' TO WS-552-P3-S2-PCT-SGN
125020       ELSE
125030         MOVE WS-RATE-WORK-3N TO WS-552-P3-S2-RATE-D
125040         MOVE SPACE TO WS-552-P3-S2-PCT-SGN.
125050     IF WS-552-P3-S3-BASIS EQUAL SPACE
125060       MOVE SPACE TO WS-552-P3-S3-RATE-X
125070     ELSE
125080       MOVE WS-552-AS-S3-RATE-X TO WS-RATE-WORK-3X
125090       IF WS-552-P3-S3-BASIS IS ALPHABETIC
125100         MOVE WS-RATE-WORK-3N TO WS-552-P3-S3-RATE-P
125110         MOVE '%' TO WS-552-P3-S3-PCT-SGN
125120       ELSE
125130         MOVE WS-RATE-WORK-3N TO WS-552-P3-S3-RATE-D
125140         MOVE SPACE TO WS-552-P3-S3-PCT-SGN.
125150     MOVE WS-552-P3 TO WS-PRT-554-552-LINE (IX-WS-PRT-554-552-IN).
125160     SET IX-WS-PRT-554-552-IN UP BY 1.
125170*
125180   6280-PRINT-552-FIXED.
125190     MOVE +4 TO WS-LINES-NEEDED.
125200     PERFORM 0500-CHECK-FOR-HEADINGS.
125210     IF WS-LINE-COUNT GREATER +3
125220       MOVE +2 TO WS-LINE-SPACER.
125230     MOVE WS-552-C1 TO PRINTER1-RECORD.
125240     PERFORM 0600-WRITE-PRINTER1-RECORD.
125250     MOVE +1 TO WS-LINE-SPACER.
125260     MOVE WS-552-D1 TO PRINTER1-RECORD.
125270     PERFORM 0600-WRITE-PRINTER1-RECORD.
125280     MOVE WS-PRT-554-552-ENTRY-CT TO WS-552-P1-ENTRY-CT.
125290     MOVE WS-552-P1 TO PRINTER1-RECORD.
125300     PERFORM 0600-WRITE-PRINTER1-RECORD.
125310*
125320   6290-PRINT-552-ENTRY.
125330     IF PRINT-COLUMN-HEAD
125340       MOVE +4 TO WS-LINES-NEEDED
125350     ELSE
125360       MOVE +1 TO WS-LINES-NEEDED.
125370     PERFORM 0500-CHECK-FOR-HEADINGS.
125380     IF PRINT-COLUMN-HEAD
125390       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
125400       IF WS-LINE-COUNT NOT GREATER +3
125410*                * CONTINUED AFTER PAGE BREAK - REPRINT KEY *
125420         MOVE WS-552-C1 TO PRINTER1-RECORD
125430         PERFORM 0600-WRITE-PRINTER1-RECORD
125440         MOVE WS-552-D1 TO PRINTER1-RECORD
125450         PERFORM 0600-WRITE-PRINTER1-RECORD
125460         MOVE WS-552-P1 TO PRINTER1-RECORD
125470         MOVE '(CONTINUED)' TO PRINTER1-RECORD (120:11)
125480         PERFORM 0600-WRITE-PRINTER1-RECORD
125490       END-IF
125500       MOVE +2 TO WS-LINE-SPACER
125510       IF WS-552-REC-TYPE EQUAL 'G'
125520         MOVE WS-552-C2 TO PRINTER1-RECORD
125530         PERFORM 0600-WRITE-PRINTER1-RECORD
125540         MOVE WS-552-D2 TO PRINTER1-RECORD
125550       ELSE
125560         MOVE WS-552-C3 TO PRINTER1-RECORD
125570         PERFORM 0600-WRITE-PRINTER1-RECORD
125580         MOVE WS-552-D3 TO PRINTER1-RECORD
125590       END-IF
125600       MOVE +1 TO WS-LINE-SPACER
125610       PERFORM 0600-WRITE-PRINTER1-RECORD.
125620     MOVE WS-PRT-554-552-LINE (IX-WS-PRT-554-552-OUT) TO
125630           PRINTER1-RECORD.
125640     SET IX-WS-PRT-554-552-OUT UP BY 1.
125650     PERFORM 0600-WRITE-PRINTER1-RECORD.
125660*
125670   6300-CHECK-I552T-FILE.
125680     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
125690     MOVE '552T FILE: ' TO WS-FILE-HD-FILE-NBR.
125700     MOVE 'G.A.S. FILE - TEST RECORDS' TO WS-FILE-HD-FILE-NAME.
125710     SET IX-WS-GAS-KEY-CURR TO +1.
125720     PERFORM
125730         WITH TEST AFTER
125740         UNTIL IX-WS-GAS-KEY-CURR NOT LESS IX-WS-GAS-KEY-EMPTY
125750       MOVE WS-TBL-GAS-KEY (IX-WS-GAS-KEY-CURR) TO
125760             WS-552-SHORT-KEY O552-SHORT-KEY
125770       MOVE SPACE TO WS-552-REC-PART O552-RECORD-PART
125780       READ I552T-FILE KEY O552-KEY
125790       IF WS-I552T-SUCCESSFUL
125800         MOVE O552-REC TO WS-552-FIXED-INFO
125810         PERFORM 6250-FORMAT-552-FIXED
125820         MOVE +0 TO WS-PRT-554-552-ENTRY-CT
125830         SET IX-WS-PRT-554-552-IN TO +1
125840         IF O552-ENTRY-COUNT GREATER +0
125850           MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
125860           PERFORM
125870               WITH TEST AFTER
125880               UNTIL WS-I552T-END-OF-FILE
125890                   OR (O552-SHORT-KEY NOT EQUAL
125900                         WS-552-SHORT-KEY)
125910                   OR (O552-ENTRY-COUNT NOT GREATER +0)
125920             ADD O552-ENTRY-COUNT TO WS-PRT-554-552-ENTRY-CT
125930             IF WS-552-REC-TYPE EQUAL 'G'
125940               PERFORM
125950                   VARYING O552-IX-G-ENTRY FROM +1 BY +1
125960                   UNTIL O552-IX-G-ENTRY GREATER
125970                         O552-G-ENTRY-COUNT
125980                 MOVE O552-G-ADJUSTMENT-ENTRY (O552-IX-G-ENTRY)
125990                       TO WS-552-G-ENTRY
126000                 PERFORM 6260-FORMAT-552-G-ENTRY
126010               END-PERFORM
126020             ELSE
126030               PERFORM
126040                   VARYING O552-IX-AS-ENTRY FROM +1 BY +1
126050                   UNTIL O552-IX-AS-ENTRY GREATER
126060                         O552-AS-ENTRY-COUNT
126070                 MOVE O552-AS-ADJUSTMENT-ENTRY (O552-IX-AS-ENTRY)
126080                       TO WS-552-AS-ENTRY
126090                 PERFORM 6270-FORMAT-552-AS-ENTRY
126100               END-PERFORM
126110             END-IF
126120             PERFORM 6310-READ-I552T-FILE-NEXT
126130           END-PERFORM
126140         END-IF
126150         PERFORM 6280-PRINT-552-FIXED
126160         IF IX-WS-PRT-554-552-IN GREATER +1
126170           SET IX-WS-PRT-554-552-OUT TO +1
126180           PERFORM 6290-PRINT-552-ENTRY
126190               WITH TEST AFTER
126200               UNTIL IX-WS-PRT-554-552-OUT NOT LESS
126210                     IX-WS-PRT-554-552-IN
126220         END-IF
126230       ELSE
126240         IF NOT WS-I552T-NO-SUCH-RECORD
126250           DISPLAY '* VSAM ERROR ON I552T READ. KEY = "'
126260                 WS-552-KEY '". FILE STATUS = '
126270                 WS-I552T-FILE-STATUS '. *' UPON SYSOUT
126280           GO TO 9900-DISPLAY-ABORT
126290         END-IF
126300       END-IF
126310       SET IX-WS-GAS-KEY-CURR UP BY 1
126320     END-PERFORM.
126330*
126340   6310-READ-I552T-FILE-NEXT.
126350     READ I552T-FILE NEXT RECORD.
126360     IF (NOT WS-I552T-SUCCESSFUL)
126370         AND (NOT WS-I552T-END-OF-FILE)
126380       DISPLAY '* VSAM ERROR ON I552T READ NEXT. FILE STATUS = '
126390             WS-I552T-FILE-STATUS '. *' UPON SYSOUT
126400       GO TO 9900-DISPLAY-ABORT.
126410*
126420*
126430   6500-CHECK-I979-FILE.
126440     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
126450     MOVE SPACE TO WS-PREV-RECORD-TYPE.
126460     MOVE '979 FILE:  ' TO WS-FILE-HD-FILE-NBR.
126470     MOVE 'CAPS CONTROL FILE' TO WS-FILE-HD-FILE-NAME.
126480*
126490     MOVE SPACE TO I979-M-RECORD-KEY.
126500     MOVE WS-IPARM-BC TO I979-M-INST-BC.
126510     PERFORM 6510-START-READ-I979-FILE.
126520     IF I979-M-INST-BC = WS-IPARM-BC
126530       MOVE 'Y' TO WS-I979-BC-HC-FOUND-FLAG.
126540       PERFORM 6530-EACH-I979-REC
126550           WITH TEST BEFORE
126560           UNTIL (NOT WS-I979-SUCCESSFUL)
126570              OR (I979-M-HOLDING-COMPANY NOT EQUAL SPACE)
126580              OR (I979-M-MASTER-BC NOT EQUAL SPACE)
126590              OR (I979-M-INST-BC NOT = WS-IPARM-BC).
126600*
126610     IF WS-I979-BC-HC-FOUND-FLAG NOT = 'Y'
126620       MOVE SPACE TO I979-M-RECORD-KEY
126630       MOVE WS-FI-MASTER-BC TO I979-M-MASTER-BC
126640       PERFORM 6510-START-READ-I979-FILE
126650       IF I979-M-MASTER-BC = WS-FI-MASTER-BC
126660         MOVE 'Y' TO WS-I979-BC-HC-FOUND-FLAG
126670       END-IF
126680       PERFORM 6530-EACH-I979-REC
126690           WITH TEST BEFORE
126700           UNTIL (NOT WS-I979-SUCCESSFUL)
126710               OR (I979-M-HOLDING-COMPANY NOT EQUAL SPACE)
126720               OR (I979-M-MASTER-BC NOT EQUAL WS-FI-MASTER-BC)
126730     END-IF.
126740*
126750     IF (WS-I979-BC-HC-FOUND-FLAG NOT EQUAL 'Y')
126760         AND (WS-HOLDING-COMPANY NOT EQUAL SPACES)
126770       MOVE SPACE TO I979-M-RECORD-KEY
126780       MOVE WS-HOLDING-COMPANY TO I979-M-HOLDING-COMPANY
126790       PERFORM 6510-START-READ-I979-FILE
126800       PERFORM 6530-EACH-I979-REC
126810           WITH TEST BEFORE
126820           UNTIL (NOT WS-I979-SUCCESSFUL)
126830              OR (I979-M-HOLDING-COMPANY NOT EQUAL
126840                    WS-HOLDING-COMPANY)
126850     END-IF.
126860*
126870   6510-START-READ-I979-FILE.
126880     START I979-FILE KEY NOT LESS I979-M-RECORD-KEY.
126890     IF WS-I979-SUCCESSFUL
126900       PERFORM 6520-READ-I979-FILE-NEXT
126910     ELSE
126920       IF (NOT WS-I979-END-OF-FILE)
126930           AND (NOT WS-I979-NO-SUCH-RECORD)
126940         DISPLAY '* VSAM ERROR ON I979 START. KEY NOT LESS "'
126950               I979-M-RECORD-KEY '". FILE STATUS = '
126960               WS-I979-FILE-STATUS '. *' UPON SYSOUT
126970         GO TO 9900-DISPLAY-ABORT.
126980*
126990   6520-READ-I979-FILE-NEXT.
127000     READ I979-FILE NEXT RECORD.
127010     IF (NOT WS-I979-SUCCESSFUL)
127020         AND (NOT WS-I979-END-OF-FILE)
127030       DISPLAY '* VSAM ERROR ON I979 READ NEXT. FILE STATUS = '
127040             WS-I979-FILE-STATUS '. *' UPON SYSOUT
127050       GO TO 9900-DISPLAY-ABORT.
127060*
127070   6530-EACH-I979-REC.
127080     IF (I979-M-HOLDING-COMPANY EQUAL SPACE OR WS-HOLDING-COMPANY)
127090         AND (I979-M-MASTER-BC EQUAL SPACE OR WS-FI-MASTER-BC)
127100         AND (I979-M-INST-BC EQUAL SPACE OR WS-IPARM-BC)
127110     MOVE 'Y' TO WS-COLUMN-HEAD-FLAG
127120     IF I979-M-PROGRAM-CODE EQUAL SPACE
127130       PERFORM 6540-REPORT-I979-MAIN-FIXED
127140       PERFORM 6550-REPORT-I979-MAIN-ENTRY
127150           VARYING I979-M-IX FROM +1 BY +1
127160           UNTIL I979-M-IX GREATER I979-M-ENTRY-COUNT
127170       MOVE 'M' TO WS-PREV-RECORD-TYPE
127180     ELSE
127190       PERFORM 6560-REPORT-I979-PROG-FIXED
127200       PERFORM 6570-REPORT-I979-PROG-ENTRY
127210           VARYING I979-P-IX FROM +1 BY +1
127220           UNTIL I979-P-IX GREATER I979-P-ENTRY-COUNT
127230       MOVE 'P' TO WS-PREV-RECORD-TYPE.
127240     PERFORM 6520-READ-I979-FILE-NEXT.
127250*
127260   6540-REPORT-I979-MAIN-FIXED.
127270     MOVE I979-M-HOLDING-COMPANY TO WS-979-P1-HOLDCO.
127280     MOVE I979-M-HC-LVL1-DIV TO WS-979-P1-HC-L1.
127290     MOVE I979-M-HC-LVL2-DIV TO WS-979-P1-HC-L2.
127300     MOVE I979-M-HC-LVL3-DIV TO WS-979-P1-HC-L3.
127310     MOVE I979-M-MASTER-BC TO WS-979-P1-MASTER-BC.
127320     MOVE I979-M-MBC-LVL1-DIV TO WS-979-P1-MBC-L1.
127330     MOVE I979-M-MBC-LVL2-DIV TO WS-979-P1-MBC-L2.
127340     MOVE I979-M-MBC-LVL3-DIV TO WS-979-P1-MBC-L3.
127350     MOVE I979-M-INST-BC TO WS-979-P1-BC.
127360     MOVE I979-M-INST-PRI-BRANCH TO WS-979-P1-PRI-BR.
127370     MOVE I979-M-INST-SEC-BRANCH TO WS-979-P1-SEC-BR.
127380     MOVE I979-M-INST-BILLING-TYPE TO WS-979-P1-BILL-TYPE.
127390     MOVE I979-M-PROGRAM-CODE TO WS-979-P1-PROG-CD.
127400     MOVE I979-M-SALES-REP-EMP-NBR TO WS-979-P1-SLS-REP-NBR.
127410     MOVE I979-M-PROMO-PRICE-FLAG TO WS-979-P1-PROMO-PR-FLG.
127420     MOVE I979-M-ENTRY-COUNT TO WS-979-P1-ENTRY-CT.
127430     SEARCH ALL WS-C348-TBL-ENTRY
127440       AT END
127450         MOVE SPACE TO WS-979-P1-SLS-REP-NAME
127460       WHEN WS-C348-TBL-EMP-NBR (IX-WS-C348-TBL) EQUAL
127470             WS-979-P1-SLS-REP-NBR
127480         MOVE WS-C348-TBL-EMP-NAME (IX-WS-C348-TBL) TO
127490               WS-979-P1-SLS-REP-NAME.
127500     IF WS-PREV-RECORD-TYPE EQUAL SPACE
127510       MOVE +3 TO WS-LINES-NEEDED
127520     ELSE
127530       MOVE +4 TO WS-LINES-NEEDED.
127540     PERFORM 0500-CHECK-FOR-HEADINGS.
127550     IF (WS-PREV-RECORD-TYPE NOT EQUAL SPACE)
127560         AND (WS-LINE-COUNT GREATER +3)
127570       MOVE +2 TO WS-LINE-SPACER.
127580     MOVE WS-979-C1 TO PRINTER1-RECORD.
127590     PERFORM 0600-WRITE-PRINTER1-RECORD.
127600     MOVE +1 TO WS-LINE-SPACER.
127610     MOVE WS-979-D1 TO PRINTER1-RECORD.
127620     PERFORM 0600-WRITE-PRINTER1-RECORD.
127630     MOVE WS-979-P1 TO PRINTER1-RECORD.
127640     PERFORM 0600-WRITE-PRINTER1-RECORD.
127650*
127660   6550-REPORT-I979-MAIN-ENTRY.
127670     SET WS-ENTRY-NBR TO I979-M-IX.
127680     MOVE WS-ENTRY-NBR TO WS-979-P2-ENTRY-NBR.
127690     MOVE I979-M-MATCH-PRI-BRANCH (I979-M-IX) TO
127700           WS-979-P2-M-PRI-BR.
127710     MOVE I979-M-MATCH-SEC-BRANCH (I979-M-IX) TO
127720           WS-979-P2-M-SEC-BR.
127730     MOVE I979-M-MATCH-BILLING-TYPE (I979-M-IX) TO
127740           WS-979-P2-M-BILL-TYPE.
127750     MOVE I979-M-MATCH-PRODUCT-CODE (I979-M-IX) TO
127760           WS-979-P2-M-PROD-CODE.
127770     MOVE I979-M-MATCH-DESCR-QTY (I979-M-IX) TO
127780           WS-979-P2-M-DESCR-QTY.
127790     MOVE I979-M-MATCH-REORDER-FLAG (I979-M-IX) TO
127800           WS-979-P2-M-REORD-FLG.
127810     MOVE I979-M-MATCH-AOE-FLAG (I979-M-IX) TO
127820           WS-979-P2-M-AOE-FLG.
127830     MOVE I979-M-MATCH-PRICING-UNITS (I979-M-IX) TO
127840           WS-979-P2-M-PR-UNITS.
127850     MOVE I979-M-MATCH-PURCHASE-ORDER (I979-M-IX) TO
127860           WS-979-P2-M-PURCH-ORD.
127870     MOVE I979-M-MATCH-SEP-INV (I979-M-IX) TO WS-979-P2-M-SEP-INV.
127880     MOVE I979-M-MATCH-BILLING-MEDIUM (I979-M-IX) TO
127890           WS-979-P2-M-BIL-MED.
127900     MOVE I979-M-APPLY-EXP-CREDITS-FLAG (I979-M-IX) TO
127910           WS-979-P2-APP-EXP-CR-FLG.
127920     MOVE I979-M-ASSIGN-PROGRAM-CODE (I979-M-IX) TO
127930           WS-979-P2-ASSGN-PROG-CD.
127940     MOVE I979-M-ASSIGN-CALC-CODE (I979-M-IX) TO
127950           WS-979-P2-ASSGN-CALC-CD.
127960     IF PRINT-COLUMN-HEAD
127970       MOVE +5 TO WS-LINES-NEEDED
127980     ELSE
127990       MOVE +1 TO WS-LINES-NEEDED.
128000     PERFORM 0500-CHECK-FOR-HEADINGS.
128010     IF PRINT-COLUMN-HEAD
128020       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
128030       IF WS-LINE-COUNT GREATER +3
128040         MOVE +2 TO WS-LINE-SPACER
128050       END-IF
128060       MOVE WS-979-C2A TO PRINTER1-RECORD
128070       PERFORM 0600-WRITE-PRINTER1-RECORD
128080       MOVE +1 TO WS-LINE-SPACER
128090       MOVE WS-979-C2B TO PRINTER1-RECORD
128100       PERFORM 0600-WRITE-PRINTER1-RECORD
128110       MOVE WS-979-D2 TO PRINTER1-RECORD
128120       PERFORM 0600-WRITE-PRINTER1-RECORD.
128130     MOVE WS-979-P2 TO PRINTER1-RECORD.
128140     PERFORM 0600-WRITE-PRINTER1-RECORD.
128150*
128160   6560-REPORT-I979-PROG-FIXED.
128170     MOVE I979-M-HOLDING-COMPANY TO WS-979-P3-HOLDCO.
128180     MOVE I979-M-HC-LVL1-DIV TO WS-979-P3-HC-L1.
128190     MOVE I979-M-HC-LVL2-DIV TO WS-979-P3-HC-L2.
128200     MOVE I979-M-HC-LVL3-DIV TO WS-979-P3-HC-L3.
128210     MOVE I979-M-MASTER-BC TO WS-979-P3-MASTER-BC.
128220     MOVE I979-M-MBC-LVL1-DIV TO WS-979-P3-MBC-L1.
128230     MOVE I979-M-MBC-LVL2-DIV TO WS-979-P3-MBC-L2.
128240     MOVE I979-M-MBC-LVL3-DIV TO WS-979-P3-MBC-L3.
128250     MOVE I979-M-INST-BC TO WS-979-P3-BC.
128260     MOVE I979-M-INST-PRI-BRANCH TO WS-979-P3-PRI-BR.
128270     MOVE I979-M-INST-SEC-BRANCH TO WS-979-P3-SEC-BR.
128280     MOVE I979-M-INST-BILLING-TYPE TO WS-979-P3-BILL-TYPE.
128290     MOVE I979-M-PROGRAM-CODE TO WS-979-P3-PROG-CD.
128300     MOVE I979-P-START-DATE TO WS-979-P3-START-DATE.
128310     MOVE I979-P-END-DATE TO WS-979-P3-END-DATE.
128320     MOVE I979-P-PROGRAM-NAME TO WS-979-P3-PROG-NAME.
128330     MOVE I979-P-METHOD TO WS-979-P3-METHOD.
128340     IF I979-P-LIMIT-TYPE EQUAL 'O'
128350       MOVE 'ORDERS ' TO WS-979-P3-LIM-TYPE
128360     ELSE
128370       IF I979-P-LIMIT-TYPE EQUAL 'U'
128380         MOVE ' UNITS ' TO WS-979-P3-LIM-TYPE
128390       ELSE
128400         MOVE 'DOLLARS' TO WS-979-P3-LIM-TYPE.
128410     MOVE I979-P-LIMIT TO WS-979-P3-LIMIT.
128420     MOVE I979-P-LIMIT-FIRST-MET-DATE TO WS-979-P3-LIM-MET-DATE.
128430     MOVE I979-P-FI-REPORT-FLAG TO WS-979-P3-FI-RPT-FLG.
128440     MOVE I979-P-PRINT-REPORT-FLAG TO WS-979-P3-PRT-RPT-FLG.
128450     MOVE I979-P-INSTITUTION-RPT-LEVEL TO WS-979-P3-INST-RPT-LVL.
128460     MOVE I979-P-PRODUCT-REPORT-LEVEL TO WS-979-P3-PROD-RPT-LVL.
128470     MOVE I979-P-CR-PROD-7-13 TO WS-979-P4-CR-PROD-7-13.
128480     MOVE I979-P-CR-ACCOUNT-NBR TO WS-979-P4-CR-ACCT-NBR.
128490     MOVE I979-P-DATE-OF-TOTALS TO WS-979-P4-DATE-OF-TTLS.
128500     MOVE I979-P-DOLLARS-TOTAL TO WS-979-P4-DLRS-TTL.
128510     MOVE I979-P-UNITS-TOTAL TO WS-979-P4-UNITS-TTL.
128520     MOVE I979-P-ORDERS-TOTAL TO WS-979-P4-ORDS-TTL.
128530     MOVE I979-P-ENTRY-COUNT TO WS-979-P4-ENTRY-CT.
128540     MOVE +9 TO WS-LINES-NEEDED.
128550     PERFORM 0500-CHECK-FOR-HEADINGS.
128560     IF WS-LINE-COUNT GREATER +3
128570       MOVE +2 TO WS-LINE-SPACER.
128580     MOVE WS-979-C3A TO PRINTER1-RECORD.
128590     PERFORM 0600-WRITE-PRINTER1-RECORD.
128600     MOVE +1 TO WS-LINE-SPACER.
128610     MOVE WS-979-C3B TO PRINTER1-RECORD.
128620     PERFORM 0600-WRITE-PRINTER1-RECORD.
128630     MOVE WS-979-D3 TO PRINTER1-RECORD.
128640     PERFORM 0600-WRITE-PRINTER1-RECORD.
128650     MOVE WS-979-P3 TO PRINTER1-RECORD.
128660     PERFORM 0600-WRITE-PRINTER1-RECORD.
128670     MOVE +2 TO WS-LINE-SPACER.
128680     MOVE WS-979-C4 TO PRINTER1-RECORD.
128690     PERFORM 0600-WRITE-PRINTER1-RECORD.
128700     MOVE +1 TO WS-LINE-SPACER.
128710     MOVE WS-979-D4 TO PRINTER1-RECORD.
128720     PERFORM 0600-WRITE-PRINTER1-RECORD.
128730     MOVE WS-979-P4 TO PRINTER1-RECORD.
128740     PERFORM 0600-WRITE-PRINTER1-RECORD.
128750*
128760   6570-REPORT-I979-PROG-ENTRY.
128770     SET WS-ENTRY-NBR TO I979-P-IX.
128780     MOVE WS-ENTRY-NBR TO WS-979-P5-ENTRY-NBR.
128790     MOVE I979-P-CALC-CODE (I979-P-IX) TO WS-979-P5-CALC-CD.
128800     MOVE I979-P-BASIS-CODE (I979-P-IX) TO WS-979-P5-BASIS-CD.
128810     MOVE I979-P-RSL-PASS-THRU-FLAG (I979-P-IX) TO
128820           WS-979-P5-RSL-PASS-FLG.
128830     IF (WS-979-P5-BASIS-CD EQUAL SPACE)
128840           OR (I979-P-RATE (I979-P-IX) NOT NUMERIC)
128850       MOVE SPACE TO WS-979-P5-RATE-X
128860     ELSE
128870       IF WS-979-P5-BASIS-CD IS NUMERIC
128880         MOVE I979-P-RATE (I979-P-IX) TO WS-979-P5-RATE-D
128890         MOVE SPACE TO WS-979-P5-PCT-SGN
128900       ELSE
128910         MOVE I979-P-RATE (I979-P-IX) TO WS-979-P5-RATE-P
128920         MOVE '%' TO WS-979-P5-PCT-SGN.
128930     IF PRINT-COLUMN-HEAD
128940       MOVE +4 TO WS-LINES-NEEDED
128950     ELSE
128960       MOVE +1 TO WS-LINES-NEEDED.
128970     PERFORM 0500-CHECK-FOR-HEADINGS.
128980     IF PRINT-COLUMN-HEAD
128990       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
129000       IF WS-LINE-COUNT GREATER +3
129010         MOVE +2 TO WS-LINE-SPACER
129020       END-IF
129030       MOVE WS-979-C5 TO PRINTER1-RECORD
129040       PERFORM 0600-WRITE-PRINTER1-RECORD
129050       MOVE +1 TO WS-LINE-SPACER
129060       MOVE WS-979-D5 TO PRINTER1-RECORD
129070       PERFORM 0600-WRITE-PRINTER1-RECORD.
129080     MOVE WS-979-P5 TO PRINTER1-RECORD.
129090     PERFORM 0600-WRITE-PRINTER1-RECORD.
129100*
129110   6600-CHECK-C1907-TABLE.
129120     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
129130     MOVE '1907C FILE:' TO WS-FILE-HD-FILE-NBR.
129140     MOVE 'OVERRIDE TO C1128 FOR CAPS (979 FILE)' TO
129150           WS-FILE-HD-FILE-NAME.
129160     SET IX-WS-C1907-TBL TO +1.
129170     PERFORM
129180         WS-C1907-ENTRY-COUNT TIMES
129190       MOVE WS-C1907-TBL-REC (IX-WS-C1907-TBL) TO WS-C1907-REC
129200       IF (WS-C1907-HOLDCO EQUAL SPACE OR WS-HOLDING-COMPANY)
129210           AND (WS-C1907-MASTER-BC EQUAL SPACE OR WS-FI-MASTER-BC)
129220           AND (WS-C1907-BC EQUAL SPACE OR WS-IPARM-BC)
129230         PERFORM  6610-REPORT-C1907-REC
129240       END-IF
129250       SET IX-WS-C1907-TBL UP BY 1
129260     END-PERFORM.
129270*
129280   6610-REPORT-C1907-REC.
129290     IF PRINT-COLUMN-HEAD
129300       MOVE +3 TO WS-LINES-NEEDED
129310     ELSE
129320       MOVE +1 TO WS-LINES-NEEDED.
129330     PERFORM 0500-CHECK-FOR-HEADINGS.
129340     IF PRINT-COLUMN-HEAD
129350       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
129360       MOVE WS-1907P-C1 TO PRINTER1-RECORD
129370       PERFORM 0600-WRITE-PRINTER1-RECORD
129380       MOVE WS-1907P-D1 TO PRINTER1-RECORD
129390       PERFORM 0600-WRITE-PRINTER1-RECORD.
129400     MOVE WS-C1907-HOLDCO TO WS-1907P-P1-HOLDCO.
129410     MOVE WS-C1907-HC-DIV-1 TO WS-1907P-P1-HC-DIV-1.
129420     MOVE WS-C1907-HC-DIV-2 TO WS-1907P-P1-HC-DIV-2.
129430     MOVE WS-C1907-HC-DIV-3 TO WS-1907P-P1-HC-DIV-3.
129440     MOVE WS-C1907-MASTER-BC TO WS-1907P-P1-MASTER-BC.
129450     MOVE WS-C1907-MBC-DIV-1 TO WS-1907P-P1-MBC-DIV-1.
129460     MOVE WS-C1907-MBC-DIV-2 TO WS-1907P-P1-MBC-DIV-2.
129470     MOVE WS-C1907-MBC-DIV-3 TO WS-1907P-P1-MBC-DIV-3.
129480     MOVE WS-C1907-BC TO WS-1907P-P1-BC.
129490     MOVE WS-C1907-PRI-BR TO WS-1907P-P1-PRI-BR.
129500     MOVE WS-C1907-SEC-BR TO WS-1907P-P1-SEC-BR.
129510     MOVE WS-C1907-TYPE-CODE TO WS-1907P-P1-TYPE-CODE.
129520     MOVE WS-C1907-PROD-CODE TO WS-1907P-P1-PROD-CODE.
129530     MOVE WS-C1907-EXPLANATION TO WS-1907P-P1-EXPLANATION.
129540     MOVE WS-1907P-P1 TO PRINTER1-RECORD.
129550     PERFORM 0600-WRITE-PRINTER1-RECORD.
129560*
129570   6620-CHECK-C1979-TABLE.
129580     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
129590     MOVE '1979C FILE:' TO WS-FILE-HD-FILE-NBR.
129600     MOVE 'CAPS REPORTING SELECTION PARAMETERS' TO
129610           WS-FILE-HD-FILE-NAME.
129620     SET IX-WS-C1979-TBL TO +1.
129630     PERFORM
129640         WS-C1979-ENTRY-COUNT TIMES
129650       MOVE WS-C1979-TBL-REC (IX-WS-C1979-TBL) TO WS-C1979-REC
129660       IF (WS-C1979-HOLDCO EQUAL SPACE OR WS-HOLDING-COMPANY)
129670           AND (WS-C1979-MASTER-BC EQUAL SPACE OR WS-FI-MASTER-BC)
129680           AND (WS-C1979-BC EQUAL SPACE OR WS-IPARM-BC)
129690         PERFORM 6630-REPORT-C1979-REC
129700       END-IF
129710       SET IX-WS-C1979-TBL UP BY 1
129720     END-PERFORM.
129730*
129740   6630-REPORT-C1979-REC.
129750     IF PRINT-COLUMN-HEAD
129760       MOVE +3 TO WS-LINES-NEEDED
129770     ELSE
129780       MOVE +1 TO WS-LINES-NEEDED.
129790     PERFORM 0500-CHECK-FOR-HEADINGS.
129800     IF PRINT-COLUMN-HEAD
129810       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
129820       MOVE WS-1979P-C1 TO PRINTER1-RECORD
129830       PERFORM 0600-WRITE-PRINTER1-RECORD
129840       MOVE WS-1979P-D1 TO PRINTER1-RECORD
129850       PERFORM 0600-WRITE-PRINTER1-RECORD.
129860     MOVE WS-C1979-HOLDCO TO WS-1979P-P1-HOLDCO.
129870     MOVE WS-C1979-HC-DIV-1 TO WS-1979P-P1-HC-DIV-1.
129880     MOVE WS-C1979-HC-DIV-2 TO WS-1979P-P1-HC-DIV-2.
129890     MOVE WS-C1979-HC-DIV-3 TO WS-1979P-P1-HC-DIV-3.
129900     MOVE WS-C1979-MASTER-BC TO WS-1979P-P1-MASTER-BC.
129910     MOVE WS-C1979-MBC-DIV-1 TO WS-1979P-P1-MBC-DIV-1.
129920     MOVE WS-C1979-MBC-DIV-2 TO WS-1979P-P1-MBC-DIV-2.
129930     MOVE WS-C1979-MBC-DIV-3 TO WS-1979P-P1-MBC-DIV-3.
129940     MOVE WS-C1979-BC TO WS-1979P-P1-BC.
129950     MOVE WS-C1979-PRI-BR TO WS-1979P-P1-PRI-BR.
129960     MOVE WS-C1979-FI-FLAG TO WS-1979P-P1-FI-FLAG.
129970     MOVE WS-C1979-AM-FLAG TO WS-1979P-P1-AM-FLAG.
129980     MOVE WS-C1979-COMMENT TO WS-1979P-P1-COMMENT.
129990     MOVE WS-1979P-P1 TO PRINTER1-RECORD.
130000     PERFORM 0600-WRITE-PRINTER1-RECORD.
130010*
130020   6650-CHECK-C1041-TABLE.
130030     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
130040     MOVE '1041C FILE: ' TO WS-FILE-HD-FILE-NBR
130050     MOVE 'CAPS FORCED CLOSED FILE' TO WS-FILE-HD-FILE-NAME
130060*
130070     SET IX-WS-C1041-TBL-CURR TO +1.
130080     PERFORM
130090         WITH TEST BEFORE
130100         UNTIL (IX-WS-C1041-TBL-CURR NOT LESS IX-WS-C1041-TBL-M1)
130110             OR (WS-C1041-TBL-BC (IX-WS-C1041-TBL-CURR) NOT LESS
130120                   WS-IPARM-BC)
130130       SET IX-WS-C1041-TBL-CURR UP BY 1
130140     END-PERFORM.
130150     PERFORM 6660-CHECK-C1041-ENTRY
130160         WITH TEST BEFORE
130170         UNTIL (IX-WS-C1041-TBL-CURR NOT LESS IX-WS-C1041-TBL-M1)
130180             OR (WS-C1041-TBL-BC (IX-WS-C1041-TBL-CURR) GREATER
130190                   WS-IPARM-BC).
130200*
130210     PERFORM
130220         WITH TEST BEFORE
130230         UNTIL (IX-WS-C1041-TBL-CURR NOT LESS IX-WS-C1041-TBL-H1)
130240             OR (WS-C1041-TBL-MBC (IX-WS-C1041-TBL-CURR) NOT LESS
130250                   WS-FI-MASTER-BC)
130260       SET IX-WS-C1041-TBL-CURR UP BY 1
130270     END-PERFORM.
130280     PERFORM 6660-CHECK-C1041-ENTRY
130290         WITH TEST BEFORE
130300         UNTIL (IX-WS-C1041-TBL-CURR NOT LESS IX-WS-C1041-TBL-H1)
130310             OR (WS-C1041-TBL-MBC (IX-WS-C1041-TBL-CURR) GREATER
130320                   WS-FI-MASTER-BC).
130330*
130340     IF WS-HOLDING-COMPANY NOT EQUAL SPACE
130350       PERFORM
130360           WITH TEST BEFORE
130370           UNTIL (IX-WS-C1041-TBL-CURR NOT LESS
130380                     IX-WS-C1041-TBL-EMPTY)
130390               OR (WS-C1041-TBL-HC (IX-WS-C1041-TBL-CURR) NOT LESS
130400                     WS-HOLDING-COMPANY)
130410         SET IX-WS-C1041-TBL-CURR UP BY 1
130420       END-PERFORM
130430       PERFORM 6660-CHECK-C1041-ENTRY
130440           WITH TEST BEFORE
130450           UNTIL (IX-WS-C1041-TBL-CURR NOT LESS
130460                     IX-WS-C1041-TBL-EMPTY)
130470               OR (WS-C1041-TBL-HC (IX-WS-C1041-TBL-CURR) GREATER
130480                     WS-HOLDING-COMPANY).
130490*
130500   6660-CHECK-C1041-ENTRY.
130510     IF (WS-C1041-TBL-HC (IX-WS-C1041-TBL-CURR) EQUAL SPACE OR
130520               WS-HOLDING-COMPANY)
130530         AND (WS-C1041-TBL-MBC (IX-WS-C1041-TBL-CURR) EQUAL SPACE
130540               OR WS-FI-MASTER-BC)
130550         AND (WS-C1041-TBL-BC (IX-WS-C1041-TBL-CURR) EQUAL SPACE
130560               OR WS-IPARM-BC)
130570       MOVE WS-C1041-TBL-REC (IX-WS-C1041-TBL-CURR) TO
130580             WS-C1041-REC
130590       PERFORM 6670-REPORT-I1041P-RECORD.
130600     SET IX-WS-C1041-TBL-CURR UP BY 1.
130610*
130620   6670-REPORT-I1041P-RECORD.
130630     IF PRINT-COLUMN-HEAD
130640       MOVE +3 TO WS-LINES-NEEDED
130650     ELSE
130660       MOVE +1 TO WS-LINES-NEEDED.
130670     PERFORM 0500-CHECK-FOR-HEADINGS.
130680*
130690     IF PRINT-COLUMN-HEAD
130700       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
130710       MOVE SPACES      TO PRINTER1-RECORD
130720       PERFORM 0600-WRITE-PRINTER1-RECORD
130730       MOVE WS-1041P-C1 TO PRINTER1-RECORD
130740       PERFORM 0600-WRITE-PRINTER1-RECORD
130750       MOVE WS-1041P-D1 TO PRINTER1-RECORD
130760       PERFORM 0600-WRITE-PRINTER1-RECORD.
130770*
130780     MOVE W1041P-979-INST-SEQ   TO WS-1041P-P1-979-INST-SEQ
130790     MOVE W1041P-979-PGM-CODE   TO WS-1041P-P1-979-PGM-CODE
130800     MOVE W1041P-BILLING-DATE   TO WS-1041P-P1-BILLING-DATE
130810     MOVE W1041P-NEW-START-DATE TO WS-1041P-P1-NEWSTRT-DATE
130820     MOVE W1041P-NEW-END-DATE   TO WS-1041P-P1-NEWEND-DATE
130830     MOVE W1041P-NEW-LIMIT      TO WS-1041P-P1-NEW-LIMIT
130840     MOVE W1041P-NEW-LIMIT-TYPE TO WS-1041P-P1-NEWLMT-TYPE
130850*
130860     MOVE WS-1041P-P1 TO PRINTER1-RECORD.
130870     PERFORM 0600-WRITE-PRINTER1-RECORD.
130880*
130890*
130900   6700-CHECK-1130P-TABLE.
130910*
130920     MOVE 'Y' TO WS-FILE-HEAD-FLAG.
130930     MOVE '1130P FILE:  ' TO WS-FILE-HD-FILE-NBR.
130940     MOVE 'REGIONAL I1128P OVERRIDE FILE' TO WS-FILE-HD-FILE-NAME.
130950     SET IX-WS-1130P-TBL IX-WS-CONSID-NBR-CURR TO +1.
130960     PERFORM
130970         UNTIL IX-WS-CONSID-NBR-CURR NOT LESS
130980               IX-WS-CONSID-NBR-EMPTY
130990       MOVE WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-CURR) TO
131000             WS-CONSID-NBR
131010       PERFORM 6705-SEARCH-1130P-TABLE
131020       SET IX-WS-CONSID-NBR-CURR UP BY 1
131030     END-PERFORM
131040     .
131050*
131060*
131070   6705-SEARCH-1130P-TABLE.
131080*
131090     SET IX-WS-1130P-TBL TO 1
131100     PERFORM UNTIL IX-WS-1130P-TBL > WS-1130P-ENTRY-COUNT
131110      IF WS-CONSID-NBR = WS-1130P-TBL-CONSID-NBR (IX-WS-1130P-TBL)
131120         MOVE WS-1130P-TBL-ENTRY (IX-WS-1130P-TBL) TO WS-1130P-REC
131130         PERFORM 6710-REPORT-1130P-REC
131140      END-IF
131150      SET IX-WS-1130P-TBL UP BY 1
131160     END-PERFORM.
131170*
131180*
131190   6710-REPORT-1130P-REC.
131200*
131210     IF PRINT-COLUMN-HEAD
131220       MOVE +3 TO WS-LINES-NEEDED
131230     ELSE
131240       MOVE +1 TO WS-LINES-NEEDED.
131250     PERFORM 0500-CHECK-FOR-HEADINGS.
131260     IF PRINT-COLUMN-HEAD
131270       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
131280       MOVE WS-1130P-C1 TO PRINTER1-RECORD
131290       PERFORM 0600-WRITE-PRINTER1-RECORD
131300       MOVE +1 TO WS-LINE-SPACER
131310       MOVE WS-1130P-D1 TO PRINTER1-RECORD
131320       PERFORM 0600-WRITE-PRINTER1-RECORD.
131330*
131340         MOVE WS-1130P-TBL-CONSID-NBR (IX-WS-1130P-TBL)
131350               TO WS-1130P-P1-CONSID-NBR
131360         MOVE WS-1130P-TBL-PRODUCT-CODE (IX-WS-1130P-TBL)
131370               TO WS-1130P-P1-PROD-CODE
131380         MOVE WS-1130P-TBL-NAME (IX-WS-1130P-TBL)
131390           TO WS-1130P-P1-NAME
131400         MOVE WS-1130P-TBL-PRODUCT-DESC (IX-WS-1130P-TBL)
131410               TO WS-1130P-P1-PROD-DESC
131420*
131430         MOVE WS-1130P-P1 TO PRINTER1-RECORD
131440         PERFORM 0600-WRITE-PRINTER1-RECORD.
131450*
131460   6750-CHECK-8920-TABLE.
131470     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG.
131480     MOVE '8920 FILE:' TO WS-FILE-HD-FILE-NBR.
131490     MOVE 'CONSID ADDRESS FILE' TO WS-FILE-HD-FILE-NAME.
131500     SET IX-WS-8920-TBL TO +1.
131510     PERFORM
131520         WS-8920-ENTRY-COUNT TIMES
131530       MOVE WS-8920-TBL-REC (IX-WS-8920-TBL) TO W8920-RECORD
131540       IF W8920-BC EQUAL WS-IPARM-BC
131550         MOVE 'Y' TO WS-8920-CN-MATCH-FLAG
131560       ELSE
131570         MOVE SPACE TO WS-8920-CN-MATCH-FLAG
131580         IF IX-WS-CONSID-NBR-EMPTY GREATER +1
131590           SET IX-WS-CONSID-NBR-CURR TO +1
131600           PERFORM
131610               WITH TEST AFTER
131620               UNTIL MATCHED-8920-CN
131630                   OR (IX-WS-CONSID-NBR-CURR NOT LESS
131640                         IX-WS-CONSID-NBR-EMPTY)
131650             IF WS-TBL-CONSID-NBR (IX-WS-CONSID-NBR-CURR)
131660                   EQUAL W8920-CONSIDERATION-NBR
131670               MOVE 'Y' TO WS-8920-CN-MATCH-FLAG
131680             ELSE
131690               SET IX-WS-CONSID-NBR-CURR UP BY 1
131700             END-IF
131710           END-PERFORM
131720         END-IF
131730       END-IF
131740       IF MATCHED-8920-CN
131750         PERFORM 6760-REPORT-W8920-REC
131760       END-IF
131770       SET IX-WS-8920-TBL UP BY 1
131780     END-PERFORM.
131790*
131800   6760-REPORT-W8920-REC.
131810     IF PRINT-COLUMN-HEAD
131820       MOVE +4 TO WS-LINES-NEEDED
131830     ELSE
131840       MOVE +3 TO WS-LINES-NEEDED.
131850     PERFORM 0500-CHECK-FOR-HEADINGS.
131860     IF PRINT-COLUMN-HEAD
131870       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
131880       MOVE WS-8920-C1 TO PRINTER1-RECORD
131890       PERFORM 0600-WRITE-PRINTER1-RECORD
131900       MOVE WS-8920-D1 TO PRINTER1-RECORD
131910     ELSE
131920       MOVE SPACE TO PRINTER1-RECORD.
131930     MOVE +1 TO WS-LINE-SPACER.
131940     PERFORM 0600-WRITE-PRINTER1-RECORD.
131950     MOVE W8920-CONSIDERATION-NBR TO WS-8920-P1-CONSID-NBR.
131960     MOVE W8920-BC TO WS-8920-P1-BC.
131970     MOVE W8920-BANK-NAME TO WS-8920-P1-BANK-NAME.
131980     MOVE W8920-ADR-LINE1 TO WS-8920-P1-ADDR-LN-1.
131990     MOVE W8920-ATTENTION-LINE TO WS-8920-P1-ATTN-LN.
132000     MOVE W8920-ADR-LINE2 TO WS-8920-P1-ADDR-LN-2.
132010     MOVE W8920-ADR-LINE3 TO WS-8920-P2-ADDR-LN-3.
132020     MOVE W8920-CITY TO WS-8920-P2-CITY.
132030     MOVE W8920-STATE TO WS-8920-P2-STATE.
132040     MOVE W8920-ZIP TO WS-8920-P2-ZIP.
132050     MOVE WS-8920-P1 TO PRINTER1-RECORD
132060     PERFORM 0600-WRITE-PRINTER1-RECORD.
132070     MOVE WS-8920-P2 TO PRINTER1-RECORD
132080     PERFORM 0600-WRITE-PRINTER1-RECORD.
132090*
132100*
132110   6800-CHECK-I442-FILE.
132120*
132130     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
132140     MOVE 'I442 FILE:  ' TO WS-FILE-HD-FILE-NBR
132150     MOVE 'CI PROGRAM IDENTIFICATION' TO WS-FILE-HD-FILE-NAME.
132160     PERFORM
132170         UNTIL (NOT WS-I442-SUCCESSFUL)
132180         OR I442-BANK-CODE > WS-IPARM-BC
132190       IF  I442-BANK-CODE = WS-IPARM-BC
132200          PERFORM 6820-REPORT-I442-RECORD
132210          PERFORM 6810-READ-I442-FILE-NEXT
132220       ELSE
132230         IF  I442-BANK-CODE < WS-IPARM-BC
132240           PERFORM 6810-READ-I442-FILE-NEXT
132250         END-IF
132260       END-IF
132270     END-PERFORM
132280          .
132290*
132300*
132310   6810-READ-I442-FILE-NEXT.
132320*
132330     READ I442-FILE NEXT RECORD
132340       AT END
132350         MOVE 'E' TO WS-I442-FILE-FLAG
132360       NOT AT END
132370         IF I442-BANK-CODE >= WS-I442-BC
132380           MOVE I442-BANK-CODE TO WS-I442-BC
132390         ELSE
132400           DISPLAY '* I442 SEQUENCE ERROR "' WS-I442-BC '" "'
132410               I442-BANK-CODE '" *' UPON SYSOUT
132420           GO TO 9900-DISPLAY-ABORT
132430         END-IF
132440     END-READ.
132450*
132460*
132470   6820-REPORT-I442-RECORD.
132480*
132490     IF PRINT-COLUMN-HEAD
132500       MOVE +5 TO WS-LINES-NEEDED
132510     ELSE
132520       MOVE +1 TO WS-LINES-NEEDED.
132530     PERFORM 0500-CHECK-FOR-HEADINGS.
132540     IF PRINT-COLUMN-HEAD
132550       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
132560       MOVE SPACE     TO PRINTER1-RECORD
132570       PERFORM 0600-WRITE-PRINTER1-RECORD
132580       MOVE WS-442-C1 TO PRINTER1-RECORD
132590       PERFORM 0600-WRITE-PRINTER1-RECORD
132600       MOVE WS-442-D1 TO PRINTER1-RECORD
132610       PERFORM 0600-WRITE-PRINTER1-RECORD
132620     END-IF.
132630*
132640     MOVE I442-BANK-CODE             TO WS-442-P1-BC
132650     MOVE I442-COMPLEXITY-CODE       TO WS-442-P1-COMPLEXITY-CODE
132660     MOVE I442-DUPLICATE-NUMBER      TO WS-442-P1-DUPLICATE-NBR
132670     MOVE I442-MATCH-CUTS            TO WS-442-P1-MATCH-CUT
132680     MOVE I442-MAIL-CODE             TO WS-442-P1-MAIL-CODE
132690     MOVE I442-MATCH-BILL-CONDS      TO WS-442-P1-MATCH-BILL-COND
132700     MOVE I442-MATCH-ORD-CONDS       TO WS-442-P1-MATCH-ORD-COND
132710     MOVE I442-MATCH-TEXT-LINES      TO WS-442-P1-MATCH-TEXT-LINE
132720     MOVE I442-EPC-FLAG              TO WS-442-P1-EPC-FLAG
132730     MOVE I442-PROGRAM-NAME          TO WS-442-P1-PROGRAM-NAME
132740     MOVE WS-442-P1 TO PRINTER1-RECORD
132750     PERFORM 0600-WRITE-PRINTER1-RECORD.
132760*
132770*
132780   6850-CHECK-I906SEQ-FILE.
132790     PERFORM 6870-READ-I906SEQ-FILE
132800         WITH TEST BEFORE
132810         UNTIL END-I906SEQ-FILE
132820             OR (WS-I906-BC NOT LESS WS-IPARM-BC).
132830     IF WS-I906-BC EQUAL WS-IPARM-BC
132840       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
132850       MOVE '906 FILE:  ' TO WS-FILE-HD-FILE-NBR
132860       MOVE 'PROMO EXTRACT' TO WS-FILE-HD-FILE-NAME
132870       PERFORM 6860-REPORT-I906-REC
132880           WITH TEST AFTER
132890           UNTIL END-I906SEQ-FILE
132900               OR (WS-I906-BC GREATER WS-IPARM-BC).
132910*
132920   6860-REPORT-I906-REC.
132930     IF PRINT-COLUMN-HEAD
132940       MOVE +3 TO WS-LINES-NEEDED
132950     ELSE
132960       MOVE +1 TO WS-LINES-NEEDED.
132970     PERFORM 0500-CHECK-FOR-HEADINGS.
132980     IF PRINT-COLUMN-HEAD
132990       MOVE SPACE TO WS-COLUMN-HEAD-FLAG PRINTER1-RECORD
133000       PERFORM 0600-WRITE-PRINTER1-RECORD
133010       MOVE WS-906-C1 TO PRINTER1-RECORD
133020       PERFORM 0600-WRITE-PRINTER1-RECORD
133030       MOVE WS-906-D1 TO PRINTER1-RECORD
133040       PERFORM 0600-WRITE-PRINTER1-RECORD.
133050     MOVE I906-BC TO WS-906-P1-BC.
133060     MOVE I906-EXP-CD TO WS-906-P1-EXP-CD.
133070     MOVE I906-OC-1 TO WS-906-P1-OC-1.
133080     MOVE I906-OC-2 TO WS-906-P1-OC-2.
133090     MOVE I906-OC-3 TO WS-906-P1-OC-3.
133100     MOVE I906-PROMO-NAME TO WS-906-P1-PROMO-NAME.
133110     MOVE I906-EFF-DATE TO WS-906-P1-EFF-DATE.
133120     MOVE I906-END-DATE TO WS-906-P1-END-DATE.
133130     MOVE I906-FI-ID TO WS-906-P1-FI-ID.
133140     MOVE I906-PROMO-ID TO WS-906-P1-PROMO-ID.
133150     MOVE WS-906-P1 TO PRINTER1-RECORD
133160     PERFORM 0600-WRITE-PRINTER1-RECORD.
133170     PERFORM 6870-READ-I906SEQ-FILE.
133180*
133190   6870-READ-I906SEQ-FILE.
133200     READ I906SEQ-FILE
133210       AT END
133220         MOVE 'E' TO WS-I906SEQ-FILE-FLAG
133230       NOT AT END
133240         IF I906-BC LESS WS-I906-BC
133250           DISPLAY '* I906SEQ SEQUENCE ERROR "' WS-I906-BC '" "'
133260                 I906-BC '" *' UPON SYSOUT
133270           GO TO 9900-DISPLAY-ABORT
133280         END-IF
133290         MOVE I906-BC TO WS-I906-BC
133300     END-READ.
133310*
133320*
133330   6900-CHECK-I1840-FILE.
133340     MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
133350     MOVE 'I1840 FILE:  ' TO WS-FILE-HD-FILE-NBR
133360     MOVE 'CI EXPENSE CODE/PROGRAM ID CROSS-REFERENCE' TO
133370          WS-FILE-HD-FILE-NAME.
133380     PERFORM
133390         UNTIL (NOT WS-I1840-SUCCESSFUL)
133400         OR I1840-BANK-CODE > WS-IPARM-BC
133410       IF  I1840-BANK-CODE = WS-IPARM-BC
133420          PERFORM 6920-REPORT-I1840-RECORD
133430          PERFORM 6910-READ-I1840-FILE-NEXT
133440       ELSE
133450         IF  I1840-BANK-CODE < WS-IPARM-BC
133460           PERFORM 6910-READ-I1840-FILE-NEXT
133470         END-IF
133480       END-IF
133490     END-PERFORM.
133500*
133510   6910-READ-I1840-FILE-NEXT.
133520     READ I1840-FILE NEXT RECORD.
133530     IF (NOT WS-I1840-SUCCESSFUL)
133540         AND (NOT WS-I1840-END-OF-FILE)
133550       DISPLAY '* VSAM ERROR ON I1840 READ NEXT. FILE STATUS = '
133560             WS-I1840-FILE-STATUS '. *' UPON SYSOUT
133570       GO TO 9900-DISPLAY-ABORT.
133580*
133590   6920-REPORT-I1840-RECORD.
133600     IF PRINT-COLUMN-HEAD
133610       MOVE +3 TO WS-LINES-NEEDED
133620     ELSE
133630       MOVE +1 TO WS-LINES-NEEDED.
133640     PERFORM 0500-CHECK-FOR-HEADINGS.
133650*
133660     IF PRINT-COLUMN-HEAD
133670       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
133680       MOVE SPACE TO PRINTER1-RECORD
133690       PERFORM 0600-WRITE-PRINTER1-RECORD
133700       MOVE WS-1840-C1 TO PRINTER1-RECORD
133710       PERFORM 0600-WRITE-PRINTER1-RECORD
133720       MOVE WS-1840-D1 TO PRINTER1-RECORD
133730       PERFORM 0600-WRITE-PRINTER1-RECORD.
133740*
133750     MOVE I1840-BANK-CODE    TO WS-1840-PI-BANK-CODE.
133760     MOVE I1840-EXPENSE-CODE TO WS-1840-PI-EXPENSE-CODE.
133770     MOVE I1840-PROGRAM-ID   TO WS-1840-PI-PROGRAM-ID.
133780     MOVE I1840-PROGRAM-NAME TO WS-1840-PI-PROGRAM-NAME.
133790     MOVE WS-1840-P1 TO PRINTER1-RECORD
133800     PERFORM 0600-WRITE-PRINTER1-RECORD.
133810*
133820*
133830   7000-CHECK-I149P-FILE.
133840     PERFORM 7010-READ-I149P-FILE
133850         WITH TEST BEFORE
133860         UNTIL END-I149P-FILE
133870             OR (WS-I149P-BC NOT LESS WS-IPARM-BC).
133880     IF WS-I149P-BC EQUAL WS-IPARM-BC
133890       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
133900       MOVE '149C FILE:  ' TO WS-FILE-HD-FILE-NBR
133910       MOVE 'PROVENT SERVICE LEVEL FROM CI' TO
133920             WS-FILE-HD-FILE-NAME
133930       PERFORM
133940           WITH TEST AFTER
133950           UNTIL END-I149P-FILE
133960               OR (WS-I149P-BC GREATER WS-IPARM-BC)
133970         PERFORM 7020-REPORT-I149P-CARD
133980         PERFORM 7010-READ-I149P-FILE
133990       END-PERFORM.
134000*
134010   7010-READ-I149P-FILE.
134020     READ I149P-FILE
134030       AT END
134040         MOVE 'E' TO WS-I149P-FILE-FLAG
134050       NOT AT END
134060         IF I149P-BC LESS WS-I149P-BC
134070           DISPLAY '* I149P SEQUENCE ERROR "' WS-I149P-BC '" "'
134080                 I149P-BC '" *' UPON SYSOUT
134090           GO TO 9900-DISPLAY-ABORT
134100         END-IF
134110         MOVE I149P-BC TO WS-I149P-BC
134120     END-READ.
134130*
134140   7020-REPORT-I149P-CARD.
134150     IF PRINT-COLUMN-HEAD
134160       MOVE +3 TO WS-LINES-NEEDED
134170     ELSE
134180       MOVE +1 TO WS-LINES-NEEDED.
134190     PERFORM 0500-CHECK-FOR-HEADINGS.
134200*
134210     IF PRINT-COLUMN-HEAD
134220       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
134230       MOVE SPACE TO PRINTER1-RECORD
134240       PERFORM 0600-WRITE-PRINTER1-RECORD
134250       MOVE WS-149P-C1 TO PRINTER1-RECORD
134260       PERFORM 0600-WRITE-PRINTER1-RECORD
134270       MOVE WS-149P-D1 TO PRINTER1-RECORD
134280       PERFORM 0600-WRITE-PRINTER1-RECORD.
134290*
134300     MOVE I149P-BC TO WS-149P-P1-BC.
134310     MOVE I149P-EXP-CD TO WS-149P-P1-EXP-CD.
134320     MOVE I149P-PROVENT-OPT-P TO WS-149P-P1-PROV-OPT-P.
134330     SEARCH ALL WS-C149-D-T-ENTRY
134340       AT END
134350         MOVE '(UNDEFINED)' TO WS-149P-P1-DESCR-P
134360       WHEN WS-C149-D-T-OPT (IX-WS-C149-D-T) EQUAL
134370             WS-149P-P1-PROV-OPT-P
134380         MOVE WS-C149-D-T-DESCR (IX-WS-C149-D-T) TO
134390               WS-149P-P1-DESCR-P.
134400     MOVE I149P-PROVENT-OPT-B TO WS-149P-P1-PROV-OPT-B.
134410     SEARCH ALL WS-C149-D-T-ENTRY
134420       AT END
134430         MOVE '(UNDEFINED)' TO WS-149P-P1-DESCR-B
134440       WHEN WS-C149-D-T-OPT (IX-WS-C149-D-T) EQUAL
134450             WS-149P-P1-PROV-OPT-B
134460         MOVE WS-C149-D-T-DESCR (IX-WS-C149-D-T) TO
134470               WS-149P-P1-DESCR-B.
134480     IF I149P-PROVENT-OPT-P EQUAL SPACE OR 'Z'
134490       MOVE WS-C149-CONS-TXT-NA TO WS-149P-P1-CONS-TEXT-P
134500     ELSE
134510       IF I149P-CONS-OPT-P EQUAL SPACE
134520         MOVE WS-C149-CONS-TXT-SP TO WS-149P-P1-CONS-TEXT-P
134530       ELSE
134540         IF I149P-CONS-OPT-P EQUAL 'X'
134550           MOVE WS-C149-CONS-TXT-X TO WS-149P-P1-CONS-TEXT-P
134560         ELSE
134570           MOVE I149P-CONS-OPT-P TO WS-149P-P1-CONS-TEXT-P (1:1)
134580           MOVE WS-C149-CONS-TXT-UND TO
134590                 WS-149P-P1-CONS-TEXT-P (2:22).
134600     IF I149P-PROVENT-OPT-B EQUAL SPACE OR 'Z'
134610       MOVE WS-C149-CONS-TXT-NA TO WS-149P-P1-CONS-TEXT-B
134620     ELSE
134630       IF I149P-CONS-OPT-B EQUAL SPACE
134640         MOVE WS-C149-CONS-TXT-SP TO WS-149P-P1-CONS-TEXT-B
134650       ELSE
134660         IF I149P-CONS-OPT-B EQUAL 'X'
134670           MOVE WS-C149-CONS-TXT-X TO WS-149P-P1-CONS-TEXT-B
134680         ELSE
134690           MOVE I149P-CONS-OPT-B TO WS-149P-P1-CONS-TEXT-B (1:1)
134700           MOVE WS-C149-CONS-TXT-UND TO
134710                 WS-149P-P1-CONS-TEXT-B (2:22).
134720     MOVE WS-149P-P1 TO PRINTER1-RECORD.
134730     PERFORM 0600-WRITE-PRINTER1-RECORD.
134740*
134750   7100-CHECK-I120P-FILE.
134760     PERFORM 7110-READ-I120P-FILE
134770         WITH TEST BEFORE
134780         UNTIL END-I120P-FILE
134790             OR (WS-I120P-BC NOT LESS WS-IPARM-BC).
134800     IF WS-I120P-BC EQUAL WS-IPARM-BC
134810       MOVE 'Y' TO WS-FILE-HEAD-FLAG WS-COLUMN-HEAD-FLAG
134820       MOVE '120C FILE:  ' TO WS-FILE-HD-FILE-NBR
134830       MOVE 'TRACKABLE DELIVERY OPTION    ' TO
134840             WS-FILE-HD-FILE-NAME
134850       PERFORM
134860           WITH TEST AFTER
134870           UNTIL END-I120P-FILE
134880               OR (WS-I120P-BC GREATER WS-IPARM-BC)
134890         PERFORM 7120-REPORT-I120P-CARD
134900         PERFORM 7110-READ-I120P-FILE
134910       END-PERFORM.
134920*
134930   7110-READ-I120P-FILE.
134940     READ I120P-FILE
134950       AT END
134960         MOVE 'E' TO WS-I120P-FILE-FLAG
134970       NOT AT END
134980         IF I120P-BC LESS WS-I120P-BC
134990           DISPLAY '* I120P SEQUENCE ERROR "' WS-I120P-BC '" "'
135000                 I120P-BC '" *' UPON SYSOUT
135010           GO TO 9900-DISPLAY-ABORT
135020         END-IF
135030         MOVE I120P-BC TO WS-I120P-BC
135040     END-READ.
135050*
135060   7120-REPORT-I120P-CARD.
135070     IF PRINT-COLUMN-HEAD
135080       MOVE +3 TO WS-LINES-NEEDED
135090     ELSE
135100       MOVE +1 TO WS-LINES-NEEDED.
135110     PERFORM 0500-CHECK-FOR-HEADINGS.
135120*
135130     IF PRINT-COLUMN-HEAD
135140       MOVE SPACE TO WS-COLUMN-HEAD-FLAG
135150       MOVE SPACE TO PRINTER1-RECORD
135160       PERFORM 0600-WRITE-PRINTER1-RECORD
135170       MOVE WS-120P-C1 TO PRINTER1-RECORD
135180       PERFORM 0600-WRITE-PRINTER1-RECORD
135190       MOVE WS-120P-D1 TO PRINTER1-RECORD
135200       PERFORM 0600-WRITE-PRINTER1-RECORD.
135210*
135220     MOVE I120P-BC TO WS-120P-P1-BC.
135230     MOVE I120P-EXP-CD TO WS-120P-P1-EXP-CD.
135240     MOVE I120P-OPTION TO WS-120P-P1-OPT.
135250     IF I120P-OPTION EQUAL '0'
135260       MOVE WS-C120-OPT-0 TO WS-120P-P1-DESC-OPT
135270       MOVE WS-C120-TYP-N TO WS-120P-P1-DESC-S
135280     ELSE
135290       IF I120P-OPTION EQUAL '1'
135300         MOVE WS-C120-OPT-1 TO WS-120P-P1-DESC-OPT
135310         MOVE WS-C120-TYP-N TO WS-120P-P1-DESC-S
135320       ELSE
135330         IF I120P-OPTION EQUAL '2'
135340           MOVE WS-C120-OPT-2 TO WS-120P-P1-DESC-OPT
135350         ELSE
135360           IF I120P-OPTION EQUAL '3'
135370             MOVE WS-C120-OPT-3 TO WS-120P-P1-DESC-OPT
135380           ELSE
135390             MOVE WS-C120-CONS-TXT-OPT TO WS-120P-P1-CONS-TEXT-P.
135400     IF I120P-OPTION EQUAL '2' OR '3'
135410       IF I120P-SERVICE = SPACE OR 'D'
135420         MOVE WS-C120-TYP-D TO WS-120P-P1-DESC-S
135430       ELSE
135440         IF I120P-SERVICE = 'F'
135450           MOVE WS-C120-TYP-F TO WS-120P-P1-DESC-S
135460         ELSE
135470           MOVE WS-C120-CONS-TXT-TYP TO WS-120P-P1-CONS-TEXT-B.
135480     MOVE WS-120P-P1 TO PRINTER1-RECORD.
135490     PERFORM 0600-WRITE-PRINTER1-RECORD.
135500*
135510*
135520   7900-CONCLUDE-BC.
135530     IF IX-WS-INV-BC-EMPTY GREATER +81
135540       MOVE 'Y' TO WS-RETURN-07-FLAG
135550       DISPLAY 'INVOICE BC TABLE OVER 80% FULL FOR BC "'
135560             WS-IPARM-BC '".' UPON SYSOUT.
135570     IF IX-WS-GAS-KEY-EMPTY GREATER +161
135580       MOVE 'Y' TO WS-RETURN-07-FLAG
135590       DISPLAY 'G.A.S. KEY TABLE OVER 80% FULL FOR BC "'
135600             WS-IPARM-BC '".' UPON SYSOUT.
135610     IF IX-WS-UPCH-KEY-EMPTY GREATER +161
135620       MOVE 'Y' TO WS-RETURN-07-FLAG
135630       DISPLAY 'UPCHARGE KEY TABLE OVER 80% FULL FOR BC "'
135640             WS-IPARM-BC '".' UPON SYSOUT.
135650     IF IX-WS-PROFIT-RPT-EMPTY GREATER +161
135660       MOVE 'Y' TO WS-RETURN-07-FLAG
135670       DISPLAY 'PROFIT REPORT NBR TABLE OVER 80% FULL FOR BC "'
135680             WS-IPARM-BC '".' UPON SYSOUT.
135690     IF IX-WS-CONSID-NBR-EMPTY GREATER +33
135700       MOVE 'Y' TO WS-RETURN-07-FLAG
135710       DISPLAY 'CONSID NUMBER TABLE OVER 80% FULL FOR BC "'
135720             WS-IPARM-BC '".' UPON SYSOUT.
135730     IF IX-WS-NACHA-CODE-EMPTY GREATER +4801
135740       MOVE 'Y' TO WS-RETURN-07-FLAG
135750       DISPLAY 'NACHA CODE TABLE OVER 80% FULL FOR BC "'
135760             WS-IPARM-BC '".' UPON SYSOUT.
135770     IF WS-MAIL-CODE-COUNT GREATER +79
135780       MOVE 'Y' TO WS-RETURN-07-FLAG
135790       DISPLAY 'MAIL CODE TABLE OVER 80% FULL FOR BC "'
135800             WS-IPARM-BC '".' UPON SYSOUT.
135810*
135820*
135830   8000-INITIALIZE.
135840*
135850 COPY CPY005.
135860*
135870     PERFORM 8020-EDIT-DISPLAY-PARM-INFO.
135880     PERFORM 8040-INIT-COMMON-FILES.
135890     PERFORM 8060-INIT-PASS2-FILES.
135900     PERFORM 8080-INIT-PASS2-HEADING.
135910     PERFORM 8100-LOAD-TABLES.
135920*
135930   8020-EDIT-DISPLAY-PARM-INFO.
135940*
135950 COPY AIXPRCPY.
135960*
135970     MOVE LS-PARM-LENGTH TO CPY108-PARM-LENGTH.
135980     MOVE LS-PARM-DATA TO CPY108-PARM-DATA.
135990     CALL 'mis11500' USING CPY108-REC.
136000     IF CPY108-PARSE-ERROR
136010       DISPLAY '* CALLED PROGRAM MIS115 ABORTED *' UPON SYSOUT
136020       GO TO 9900-DISPLAY-ABORT.
136030     PERFORM
136040           VARYING CPY108-STMT-IX FROM +1 BY +1
136050           UNTIL CPY108-STMT-IX GREATER +5
136060       IF CPY108-RET-STATEMENT (CPY108-STMT-IX) NOT EQUAL SPACE
136070         MOVE CPY108-RET-STATEMENT (CPY108-STMT-IX) TO
136080               WS-DP-STATEMENT
136090         DISPLAY WS-DISPLAY-PARM UPON SYSOUT
136100         MOVE SPACE TO WS-DP-CAPTION
136110       END-IF
136120     END-PERFORM.
136130*
136140     SET CPY108-VAL-IX TO +1.
136150     SEARCH CPY108-RET-VALUES-ENTRY
136160       AT END
136170         DISPLAY '* MISSING PARM KEYWORD "PRINT     " *'
136180               UPON SYSOUT
136190         GO TO 9900-DISPLAY-ABORT
136200       WHEN CPY108-RET-KEYWORD (CPY108-VAL-IX) EQUAL
136210             'PRINT     '
136220         IF CPY108-RET-VALUE (CPY108-VAL-IX) EQUAL 'DUPLEX    '
136230               OR 'SIMPLEX   '
136240           MOVE CPY108-RET-VALUE (CPY108-VAL-IX) TO
136250                 WS-PARM-PRINT-OPT
136260           MOVE SPACE TO CPY108-RET-KEYWORD (CPY108-VAL-IX)
136270         ELSE
136280           DISPLAY '* INVALID VALUE "' CPY108-RET-VALUE
136290                 (CPY108-VAL-IX) '" FOR PARM KEYWORD "'
136300                 CPY108-RET-KEYWORD (CPY108-VAL-IX) '" *'
136310                 UPON SYSOUT
136320           GO TO 9900-DISPLAY-ABORT
136330         END-IF
136340       END-SEARCH.
136350*
136360     SET CPY108-VAL-IX TO +1.
136370     SEARCH CPY108-RET-VALUES-ENTRY
136380       AT END
136390         MOVE 'N' TO WS-PARM-EMPTY-OPT
136400         MOVE 'Y' TO WS-RETURN-04-FLAG
136410         DISPLAY 'MISSING PARM KEYWORD "HEAD-EMPTY", DEFAULT VALUE
136420-              ' "NO" WILL BE USED.' UPON SYSOUT
136430       WHEN CPY108-RET-KEYWORD (CPY108-VAL-IX) EQUAL
136440             'HEAD-EMPTY'
136450         IF CPY108-RET-VALUE (CPY108-VAL-IX) EQUAL 'YES       '
136460               OR 'NO        '
136470           MOVE CPY108-RET-VALUE (CPY108-VAL-IX) TO
136480                 WS-PARM-EMPTY-OPT
136490           MOVE SPACE TO CPY108-RET-KEYWORD (CPY108-VAL-IX)
136500         ELSE
136510           DISPLAY '* INVALID VALUE "' CPY108-RET-VALUE
136520                 (CPY108-VAL-IX) '" FOR PARM KEYWORD "'
136530                 CPY108-RET-KEYWORD (CPY108-VAL-IX) '" *'
136540                 UPON SYSOUT
136550           GO TO 9900-DISPLAY-ABORT
136560         END-IF
136570       END-SEARCH.
136580*
136590     PERFORM
136600           VARYING CPY108-VAL-IX FROM +1 BY +1
136610           UNTIL CPY108-VAL-IX GREATER +5
136620       IF CPY108-RET-KEYWORD (CPY108-VAL-IX) NOT EQUAL SPACE
136630         MOVE 'Y' TO WS-RETURN-04-FLAG
136640         DISPLAY 'INFO ONLY: EXTRANEOUS PARM KEYWORD "'
136650               CPY108-RET-KEYWORD (CPY108-VAL-IX) '".'
136660               UPON SYSOUT
136670       END-IF
136680     END-PERFORM.
136690*
136700   8040-INIT-COMMON-FILES.
136710     OPEN INPUT IPARM-FILE.
136720*
136730     PERFORM 0100-READ-IPARM-FILE.
136740     IF END-IPARM-FILE
136750       DISPLAY '* IPARM IS AN EMPTY FILE *' UPON SYSOUT
136760       GO TO 9900-DISPLAY-ABORT.
136770*
136780     OPEN INPUT I550-FILE.
136790     IF NOT WS-I550-SUCCESSFUL-OPEN
136800       DISPLAY '* VSAM ERROR ON I550 OPEN. FILE STATUS = '
136810             WS-I550-FILE-STATUS '. *' UPON SYSOUT
136820       GO TO 9900-DISPLAY-ABORT.
136830     MOVE 'Y' TO WS-I550-FILE-FLAG.
136840*
136850     PERFORM 1520-READ-I550-FILE-NEXT.
136860     IF WS-I550-END-OF-FILE
136870       DISPLAY '* I550 IS AN EMPTY FILE. *' UPON SYSOUT
136880       GO TO 9900-DISPLAY-ABORT.
136890*
136900   8060-INIT-PASS2-FILES.
136910     OPEN OUTPUT PRINTER1-FILE
136920         INPUT I149P-FILE I120P-FILE I225P-FILE I233P-FILE
136930           I262P-FILE I285P-FILE I348P-FILE I506P-FILE I589P-FILE
136940           I660P-FILE I662P-FILE I663P-FILE I751P-FILE I761P-FILE
136950           I761P2-FILE I769P-FILE I781P-FILE I782P-FILE
136960           I850P-FILE I851P-FILE I996P-FILE I1041P-FILE
136970           I1122P-FILE I1130P-FILE I1712P-FILE I1907P-FILE
136980           I1921P-FILE I1961P-FILE I1967P-FILE I1979P-FILE
136990           IMAIL-FILE I566SUM-FILE I575-FILE I871-FILE I877-FILE
137000           I896-FILE I906SEQ-FILE I1475-FILE I8920-FILE
137010           I8950-FILE.
137020*
137030     OPEN INPUT I550T-FILE.
137040     IF NOT WS-I550T-SUCCESSFUL-OPEN
137050       DISPLAY '* VSAM ERROR ON I550T OPEN. FILE STATUS = '
137060             WS-I550T-FILE-STATUS '. *' UPON SYSOUT
137070       GO TO 9900-DISPLAY-ABORT.
137080     MOVE 'Y' TO WS-I550T-FILE-FLAG.
137090*
137100     OPEN INPUT I552-FILE.
137110     IF NOT WS-I552-SUCCESSFUL-OPEN
137120       DISPLAY '* VSAM ERROR ON I552 OPEN. FILE STATUS = '
137130             WS-I552-FILE-STATUS '. *' UPON SYSOUT
137140       GO TO 9900-DISPLAY-ABORT.
137150     MOVE 'Y' TO WS-I552-FILE-FLAG.
137160*
137170     OPEN INPUT I552T-FILE.
137180     IF NOT WS-I552T-SUCCESSFUL-OPEN
137190       DISPLAY '* VSAM ERROR ON I552T OPEN. FILE STATUS = '
137200             WS-I552T-FILE-STATUS '. *' UPON SYSOUT
137210       GO TO 9900-DISPLAY-ABORT.
137220     MOVE 'Y' TO WS-I552T-FILE-FLAG.
137230*
137240     OPEN INPUT I554-FILE.
137250     IF NOT WS-I554-SUCCESSFUL-OPEN
137260       DISPLAY '* VSAM ERROR ON I554 OPEN. FILE STATUS = '
137270             WS-I554-FILE-STATUS '. *' UPON SYSOUT
137280       GO TO 9900-DISPLAY-ABORT.
137290     MOVE 'Y' TO WS-I554-FILE-FLAG.
137300*
137310     OPEN INPUT I554T-FILE.
137320     IF NOT WS-I554T-SUCCESSFUL-OPEN
137330       DISPLAY '* VSAM ERROR ON I554T OPEN. FILE STATUS = '
137340             WS-I554T-FILE-STATUS '. *' UPON SYSOUT
137350       GO TO 9900-DISPLAY-ABORT.
137360     MOVE 'Y' TO WS-I554T-FILE-FLAG.
137370*
137380     OPEN INPUT I556-FILE.
137390     IF NOT WS-I556-SUCCESSFUL-OPEN
137400       DISPLAY '* VSAM ERROR ON I556 OPEN. FILE STATUS = '
137410             WS-I556-FILE-STATUS '. *' UPON SYSOUT
137420       GO TO 9900-DISPLAY-ABORT.
137430     MOVE 'Y' TO WS-I556-FILE-FLAG.
137440*
137450     OPEN INPUT I561-FILE.
137460     IF NOT WS-I561-SUCCESSFUL-OPEN
137470       DISPLAY '* VSAM ERROR ON I561 OPEN. FILE STATUS = '
137480             WS-I561-FILE-STATUS '. *' UPON SYSOUT
137490       GO TO 9900-DISPLAY-ABORT.
137500     MOVE 'Y' TO WS-I561-FILE-FLAG.
137510*
137520     OPEN INPUT I562-FILE.
137530     IF NOT WS-I562-SUCCESSFUL-OPEN
137540       DISPLAY '* VSAM ERROR ON I562 OPEN. FILE STATUS = '
137550             WS-I562-FILE-STATUS '. *' UPON SYSOUT
137560       GO TO 9900-DISPLAY-ABORT.
137570     MOVE 'Y' TO WS-I562-FILE-FLAG.
137580*
137590     OPEN INPUT I563-FILE.
137600     IF NOT WS-I563-SUCCESSFUL-OPEN
137610       DISPLAY '* VSAM ERROR ON I563 OPEN. FILE STATUS = '
137620             WS-I563-FILE-STATUS '. *' UPON SYSOUT
137630       GO TO 9900-DISPLAY-ABORT.
137640     MOVE 'Y' TO WS-I563-FILE-FLAG.
137650*
137660     OPEN INPUT I565-FILE.
137670     IF NOT WS-I565-SUCCESSFUL-OPEN
137680       DISPLAY '* VSAM ERROR ON I565 OPEN. FILE STATUS = '
137690             WS-I565-FILE-STATUS '. *' UPON SYSOUT
137700       GO TO 9900-DISPLAY-ABORT.
137710     MOVE 'Y' TO WS-I565-FILE-FLAG.
137720*
137730     OPEN INPUT I567-FILE.
137740     IF NOT WS-I567-SUCCESSFUL-OPEN
137750       DISPLAY '* VSAM ERROR ON I567 OPEN. FILE STATUS = '
137760             WS-I567-FILE-STATUS '. *' UPON SYSOUT
137770       GO TO 9900-DISPLAY-ABORT.
137780     MOVE 'Y' TO WS-I567-FILE-FLAG.
137790*
137800     OPEN INPUT I759-FILE.
137810     IF NOT WS-I759-SUCCESSFUL-OPEN
137820       DISPLAY '* VSAM ERROR ON I759 OPEN. FILE STATUS = '
137830             WS-I759-FILE-STATUS '. *' UPON SYSOUT
137840       GO TO 9900-DISPLAY-ABORT.
137850     MOVE 'Y' TO WS-I759-FILE-FLAG.
137860*
137870     OPEN INPUT I864-FILE.
137880     IF NOT WS-I864-SUCCESSFUL-OPEN
137890       DISPLAY '* VSAM ERROR ON I864 OPEN. FILE STATUS = '
137900             WS-I864-FILE-STATUS '. *' UPON SYSOUT
137910       GO TO 9900-DISPLAY-ABORT.
137920     MOVE 'Y' TO WS-I864-FILE-FLAG.
137930*
137940     OPEN INPUT I979-FILE.
137950     IF NOT WS-I979-SUCCESSFUL-OPEN
137960       DISPLAY '* VSAM ERROR ON I979 OPEN. FILE STATUS = '
137970             WS-I979-FILE-STATUS '. *' UPON SYSOUT
137980       GO TO 9900-DISPLAY-ABORT.
137990     MOVE 'Y' TO WS-I979-FILE-FLAG.
138000*
138010     OPEN INPUT I1637-FILE.
138020     IF NOT WS-I1637-SUCCESSFUL-OPEN
138030       DISPLAY '* VSAM ERROR ON I1637 OPEN. FILE STATUS = '
138040             WS-I1637-FILE-STATUS '. *' UPON SYSOUT
138050       GO TO 9900-DISPLAY-ABORT.
138060     MOVE 'Y' TO WS-I1637-FILE-FLAG.
138070*
138080     OPEN INPUT I442-FILE.
138090     IF NOT WS-I442-SUCCESSFUL-OPEN
138100       DISPLAY '* VSAM ERROR ON I442 OPEN. FILE STATUS = '
138110             WS-I442-FILE-STATUS '. *' UPON SYSOUT
138120       GO TO 9900-DISPLAY-ABORT.
138130     MOVE 'Y' TO WS-I442-FILE-FLAG.
138140*
138150     OPEN INPUT I1840-FILE.
138160     IF NOT WS-I1840-SUCCESSFUL-OPEN
138170       DISPLAY '* VSAM ERROR ON I1840 OPEN. FILE STATUS = '
138180             WS-I1840-FILE-STATUS '. *' UPON SYSOUT
138190       GO TO 9900-DISPLAY-ABORT.
138200     MOVE 'Y' TO WS-I1840-FILE-FLAG.
138210*
138220     OPEN INPUT I8935-FILE.
138230     IF NOT WS-I8935-SUCCESSFUL-OPEN
138240       DISPLAY '* VSAM ERROR ON I8935 OPEN. FILE STATUS = '
138250             WS-I8935-FILE-STATUS '. *' UPON SYSOUT
138260       GO TO 9900-DISPLAY-ABORT.
138270     MOVE 'Y' TO WS-I8935-FILE-FLAG.
138280*
138290     OPEN INPUT I8935T-FILE.
138300     IF NOT WS-I8935T-SUCCESSFUL-OPEN
138310       DISPLAY '* VSAM ERROR ON I8935T OPEN. FILE STATUS = '
138320             WS-I8935T-FILE-STATUS '. *' UPON SYSOUT
138330       GO TO 9900-DISPLAY-ABORT.
138340     MOVE 'Y' TO WS-I8935T-FILE-FLAG.
138350*
138360     PERFORM 1210-READ-IMAIL-FILE.
138370     IF END-IMAIL-FILE
138380       DISPLAY 'IMAIL IS AN EMPTY FILE.' UPON SYSOUT
138390       MOVE 'Y' TO WS-RETURN-04-FLAG.
138400*
138410     PERFORM 7010-READ-I149P-FILE.
138420     IF END-I149P-FILE
138430       DISPLAY 'I149P IS AN EMPTY FILE.' UPON SYSOUT
138440       MOVE 'Y' TO WS-RETURN-04-FLAG.
138450*
138460     PERFORM 7110-READ-I120P-FILE.
138470     IF END-I120P-FILE
138480       DISPLAY 'I120P IS AN EMPTY FILE.' UPON SYSOUT
138490       MOVE 'Y' TO WS-RETURN-04-FLAG.
138500*
138510     PERFORM 6136-READ-I225P-FILE.
138520     IF END-I225P-FILE
138530       DISPLAY 'I225P IS AN EMPTY FILE.' UPON SYSOUT
138540       MOVE 'Y' TO WS-RETURN-04-FLAG.
138550*
138560     PERFORM 2910-READ-I233P-FILE.
138570     IF END-I233P-FILE
138580       DISPLAY 'I233P IS AN EMPTY FILE.' UPON SYSOUT
138590       MOVE 'Y' TO WS-RETURN-04-FLAG.
138600*
138610     PERFORM 3110-READ-I262P-FILE.
138620     IF END-I262P-FILE
138630       DISPLAY 'I262P IS AN EMPTY FILE.' UPON SYSOUT
138640       MOVE 'Y' TO WS-RETURN-04-FLAG.
138650*
138660     PERFORM 8115-READ-I285P-FILE.
138670     IF END-I285P-FILE
138680       DISPLAY 'I285P IS AN EMPTY FILE.' UPON SYSOUT
138690       MOVE 'Y' TO WS-RETURN-04-FLAG.
138700*
138710     PERFORM 8160-READ-I348P-FILE.
138720     IF END-I348P-FILE
138730       DISPLAY 'I348P IS AN EMPTY FILE.' UPON SYSOUT
138740       MOVE 'Y' TO WS-RETURN-04-FLAG.
138750*
138760     PERFORM 8125-READ-I506P-FILE.
138770     IF END-I506P-FILE
138780       DISPLAY 'I506P IS AN EMPTY FILE.' UPON SYSOUT
138790       MOVE 'Y' TO WS-RETURN-04-FLAG.
138800*
138810     PERFORM 5110-READ-I589P-FILE.
138820     IF END-I589P-FILE
138830       DISPLAY 'I589P IS AN EMPTY FILE.' UPON SYSOUT
138840       MOVE 'Y' TO WS-RETURN-04-FLAG.
138850*
138860     PERFORM 3910-READ-I8950-FILE-NEXT.
138870     IF WS-I8950-END-OF-FILE
138880       DISPLAY 'I8950 IS AN EMPTY FILE.' UPON SYSOUT
138890       MOVE 'E' TO WS-I8950-FILE-FLAG
138900       MOVE 'Y' TO WS-RETURN-04-FLAG.
138910*
138920     PERFORM 3410-READ-I660P-FILE.
138930     IF END-I660P-FILE
138940       DISPLAY 'I660P IS AN EMPTY FILE.' UPON SYSOUT
138950       MOVE 'Y' TO WS-RETURN-04-FLAG.
138960*
138970     PERFORM 3510-READ-I662P-FILE.
138980     IF END-I662P-FILE
138990       DISPLAY 'I662P IS AN EMPTY FILE.' UPON SYSOUT
139000       MOVE 'Y' TO WS-RETURN-04-FLAG.
139010*
139020     PERFORM 3310-READ-I663P-FILE.
139030     IF END-I663P-FILE
139040       DISPLAY 'I663P IS AN EMPTY FILE.' UPON SYSOUT
139050       MOVE 'Y' TO WS-RETURN-04-FLAG.
139060*
139070     PERFORM 4110-READ-I751P-FILE.
139080     IF END-I751P-FILE
139090       DISPLAY 'I751P IS AN EMPTY FILE.' UPON SYSOUT
139100       MOVE 'Y' TO WS-RETURN-04-FLAG.
139110*
139120     PERFORM 8260-READ-I761P-FILE.
139130     IF END-I761P-FILE
139140       DISPLAY 'I761P IS AN EMPTY FILE.' UPON SYSOUT
139150       MOVE 'Y' TO WS-RETURN-04-FLAG.
139160*
139170     PERFORM 8290-READ-I761P2-FILE.
139180     IF END-I761P2-FILE
139190       DISPLAY 'I761P2 IS AN EMPTY FILE.' UPON SYSOUT
139200       MOVE 'Y' TO WS-RETURN-04-FLAG.
139210*
139220     PERFORM 8310-READ-I769P-FILE.
139230     IF END-I769P-FILE
139240       DISPLAY 'I769P IS AN EMPTY FILE.' UPON SYSOUT
139250       MOVE 'Y' TO WS-RETURN-04-FLAG.
139260*
139270     PERFORM 8360-READ-I781P-FILE.
139280     IF END-I781P-FILE
139290       DISPLAY 'I781P IS AN EMPTY FILE.' UPON SYSOUT
139300       MOVE 'Y' TO WS-RETURN-04-FLAG.
139310*
139320     PERFORM 8361-READ-I782P-FILE.
139330     IF END-I782P-FILE
139340       DISPLAY 'I782P IS AN EMPTY FILE.' UPON SYSOUT
139350       MOVE 'Y' TO WS-RETURN-04-FLAG.
139360*
139370     PERFORM 8501-READ-I850P-FILE.
139380     IF END-I850P-FILE
139390       DISPLAY 'I850P IS AN EMPTY FILE.' UPON SYSOUT
139400       MOVE 'Y' TO WS-RETURN-04-FLAG.
139410*
139420     PERFORM 8511-READ-I851P-FILE.
139430     IF END-I851P-FILE
139440       DISPLAY 'I851P IS AN EMPTY FILE.' UPON SYSOUT
139450       MOVE 'Y' TO WS-RETURN-04-FLAG.
139460*
139470     PERFORM 8380-READ-I1712P-FILE.
139480     IF END-I1712P-FILE
139490       DISPLAY 'I1712P IS AN EMPTY FILE.' UPON SYSOUT
139500       MOVE 'Y' TO WS-RETURN-04-FLAG.
139510*
139520     PERFORM 8540-READ-I1921P-FILE.
139530     IF END-I1921P-FILE
139540       DISPLAY 'I1921 IS AN EMPTY FILE.' UPON SYSOUT
139550       MOVE 'Y' TO WS-RETURN-04-FLAG.
139560*
139570     PERFORM 5610-READ-I1967P-FILE.
139580     IF END-I1967P-FILE
139590       DISPLAY 'I1967P IS AN EMPTY FILE.' UPON SYSOUT
139600       MOVE 'Y' TO WS-RETURN-04-FLAG.
139610*
139620     PERFORM 2610-READ-I996P-FILE.
139630     IF END-I996P-FILE
139640       DISPLAY 'I996P IS AN EMPTY FILE.' UPON SYSOUT
139650       MOVE 'Y' TO WS-RETURN-04-FLAG.
139660*
139670     PERFORM 8141-READ-I1041P-FILE.
139680     IF END-I1041P-FILE
139690       DISPLAY 'I1041P IS AN EMPTY FILE.' UPON SYSOUT
139700       MOVE 'Y' TO WS-RETURN-04-FLAG.
139710*
139720     PERFORM 3610-READ-I1122P-FILE.
139730     IF END-I1122P-FILE
139740       DISPLAY 'I1122P IS AN EMPTY FILE.' UPON SYSOUT
139750       MOVE 'Y' TO WS-RETURN-04-FLAG.
139760*
139770     PERFORM 8561-READ-I566SUM-FILE.
139780     IF END-I566SUM-FILE
139790       DISPLAY 'I566SUM IS AN EMPTY FILE.' UPON SYSOUT
139800       MOVE 'Y' TO WS-RETURN-04-FLAG.
139810*
139820     PERFORM 8880-READ-I1130P-FILE.
139830     IF END-1130P-FILE
139840       DISPLAY 'I1130P IS AN EMPTY FILE.' UPON SYSOUT
139850       MOVE 'Y' TO WS-RETURN-04-FLAG.
139860*
139870     PERFORM 8680-READ-I1907P-FILE.
139880     IF END-I1907P-FILE
139890       DISPLAY 'I1907P IS AN EMPTY FILE.' UPON SYSOUT
139900       MOVE 'Y' TO WS-RETURN-04-FLAG.
139910*
139920     PERFORM 8810-READ-I575-FILE.
139930     IF END-I575-FILE
139940       DISPLAY 'I575 IS AN EMPTY FILE.' UPON SYSOUT
139950       MOVE 'Y' TO WS-RETURN-04-FLAG.
139960*
139970     PERFORM 4210-READ-I871-FILE.
139980     IF END-I871-FILE
139990       DISPLAY 'I871 IS AN EMPTY FILE.' UPON SYSOUT
140000       MOVE 'Y' TO WS-RETURN-04-FLAG.
140010*
140020     PERFORM 8860-READ-I877-FILE.
140030     IF END-I877-FILE
140040       DISPLAY 'I877 IS AN EMPTY FILE.' UPON SYSOUT
140050       MOVE 'Y' TO WS-RETURN-04-FLAG.
140060*
140070     PERFORM 8910-READ-I896-FILE.
140080     IF END-I896-FILE
140090       DISPLAY 'I896 IS AN EMPTY FILE.' UPON SYSOUT
140100       MOVE 'Y' TO WS-RETURN-04-FLAG.
140110*
140120     PERFORM 6870-READ-I906SEQ-FILE.
140130     IF END-I906SEQ-FILE
140140       DISPLAY 'I906SEQ IS AN EMPTY FILE.' UPON SYSOUT
140150       MOVE 'Y' TO WS-RETURN-04-FLAG.
140160*
140170     PERFORM 8175-READ-I1979P-FILE.
140180     IF END-I1979P-FILE
140190       DISPLAY 'I1979P IS AN EMPTY FILE.' UPON SYSOUT
140200       MOVE 'Y' TO WS-RETURN-04-FLAG.
140210*
140220     PERFORM 8185-READ-I8920-FILE.
140230     IF END-I8920-FILE
140240       DISPLAY 'I8920 IS AN EMPTY FILE.' UPON SYSOUT
140250       MOVE 'Y' TO WS-RETURN-04-FLAG.
140260*
140270     PERFORM 5510-READ-I1475-FILE.
140280     IF END-I1475-FILE
140290       DISPLAY 'I1475 IS AN EMPTY FILE.' UPON SYSOUT
140300       MOVE 'Y' TO WS-RETURN-04-FLAG.
140310*
140320     PERFORM 1620-READ-I550T-FILE-NEXT.
140330     IF WS-I550T-END-OF-FILE
140340       DISPLAY 'I550T IS AN EMPTY FILE.' UPON SYSOUT
140350       MOVE 'E' TO WS-I550T-FILE-FLAG
140360       MOVE 'Y' TO WS-RETURN-04-FLAG.
140370*
140380     PERFORM 6210-READ-I552-FILE-NEXT.
140390     IF WS-I552-END-OF-FILE
140400       DISPLAY 'I552 IS AN EMPTY FILE.' UPON SYSOUT
140410       MOVE 'E' TO WS-I552-FILE-FLAG
140420       MOVE 'Y' TO WS-RETURN-04-FLAG.
140430*
140440     PERFORM 6310-READ-I552T-FILE-NEXT.
140450     IF WS-I552T-END-OF-FILE
140460       DISPLAY 'I552T IS AN EMPTY FILE.' UPON SYSOUT
140470       MOVE 'E' TO WS-I552T-FILE-FLAG
140480       MOVE 'Y' TO WS-RETURN-04-FLAG.
140490*
140500     PERFORM 6010-READ-I554-FILE-NEXT.
140510     IF WS-I554-END-OF-FILE
140520       DISPLAY 'I554 IS AN EMPTY FILE.' UPON SYSOUT
140530       MOVE 'E' TO WS-I554-FILE-FLAG
140540       MOVE 'Y' TO WS-RETURN-04-FLAG.
140550*
140560     PERFORM 6110-READ-I554T-FILE-NEXT.
140570     IF WS-I554T-END-OF-FILE
140580       DISPLAY 'I554T IS AN EMPTY FILE.' UPON SYSOUT
140590       MOVE 'E' TO WS-I554T-FILE-FLAG
140600       MOVE 'Y' TO WS-RETURN-04-FLAG.
140610*
140620     PERFORM 8610-READ-I556-FILE-NEXT.
140630     IF WS-I556-END-OF-FILE
140640       DISPLAY 'I556 IS AN EMPTY FILE.' UPON SYSOUT
140650       MOVE 'E' TO WS-I556-FILE-FLAG
140660       MOVE 'Y' TO WS-RETURN-04-FLAG.
140670*
140680     PERFORM 2020-READ-I561-FILE-NEXT.
140690     IF WS-I561-END-OF-FILE
140700       DISPLAY 'I561 IS AN EMPTY FILE.' UPON SYSOUT
140710       MOVE 'E' TO WS-I561-FILE-FLAG
140720       MOVE 'Y' TO WS-RETURN-04-FLAG.
140730*
140740     PERFORM 2120-READ-I562-FILE-NEXT.
140750     IF WS-I562-END-OF-FILE
140760       DISPLAY 'I562 IS AN EMPTY FILE.' UPON SYSOUT
140770       MOVE 'E' TO WS-I562-FILE-FLAG
140780       MOVE 'Y' TO WS-RETURN-04-FLAG.
140790*
140800     PERFORM 2220-READ-I563-FILE-NEXT.
140810     IF WS-I563-END-OF-FILE
140820       DISPLAY 'I563 IS AN EMPTY FILE.' UPON SYSOUT
140830       MOVE 'E' TO WS-I563-FILE-FLAG
140840       MOVE 'Y' TO WS-RETURN-04-FLAG.
140850*
140860     PERFORM 2420-READ-I565-FILE-NEXT.
140870     IF WS-I565-END-OF-FILE
140880       DISPLAY 'I565 IS AN EMPTY FILE.' UPON SYSOUT
140890       MOVE 'E' TO WS-I565-FILE-FLAG
140900       MOVE 'Y' TO WS-RETURN-04-FLAG.
140910*
140920     PERFORM 2520-READ-I567-FILE-NEXT.
140930     IF WS-I567-END-OF-FILE
140940       DISPLAY 'I567 IS AN EMPTY FILE.' UPON SYSOUT
140950       MOVE 'E' TO WS-I567-FILE-FLAG
140960       MOVE 'Y' TO WS-RETURN-04-FLAG.
140970*
140980     PERFORM 6520-READ-I979-FILE-NEXT.
140990     IF WS-I979-END-OF-FILE
141000       DISPLAY 'I979 IS AN EMPTY FILE.' UPON SYSOUT
141010       MOVE 'E' TO WS-I979-FILE-FLAG
141020       MOVE 'Y' TO WS-RETURN-04-FLAG.
141030*
141040     PERFORM 6810-READ-I442-FILE-NEXT.
141050     IF WS-I442-END-OF-FILE
141060       DISPLAY 'I442 IS AN EMPTY FILE.' UPON SYSOUT
141070       MOVE 'E' TO WS-I442-FILE-FLAG
141080       MOVE 'Y' TO WS-RETURN-04-FLAG.
141090*
141100     PERFORM 6910-READ-I1840-FILE-NEXT.
141110     IF WS-I1840-END-OF-FILE
141120       DISPLAY 'I1840 IS AN EMPTY FILE.' UPON SYSOUT
141130       MOVE 'E' TO WS-I1840-FILE-FLAG
141140       MOVE 'Y' TO WS-RETURN-04-FLAG.
141150*
141160     PERFORM 6123-READ-I8935-FILE-NEXT.
141170     IF WS-I8935-END-OF-FILE
141180       DISPLAY 'I8935 IS AN EMPTY FILE.' UPON SYSOUT
141190       MOVE 'E' TO WS-I8935-FILE-FLAG
141200       MOVE 'Y' TO WS-RETURN-04-FLAG.
141210*
141220     PERFORM 6133-READ-I8935T-FILE-NEXT.
141230     IF WS-I8935T-END-OF-FILE
141240       DISPLAY 'I8935T IS AN EMPTY FILE.' UPON SYSOUT
141250       MOVE 'E' TO WS-I8935T-FILE-FLAG
141260       MOVE 'Y' TO WS-RETURN-04-FLAG.
141270*
141280     PERFORM 8960-READ-I1637-FILE-NEXT.
141290     IF WS-I1637-END-OF-FILE
141300       DISPLAY 'I1637 IS AN EMPTY FILE.' UPON SYSOUT
141310       MOVE 'E' TO WS-I1637-FILE-FLAG
141320       MOVE 'Y' TO WS-RETURN-04-FLAG.
141330*
141340   8080-INIT-PASS2-HEADING.
141350     MOVE WS-PROGRAM-NUMBER TO WS-HD1-PROGRAM-NUMBER.
141360     MOVE WS-SYSOUT-RUN-MONTH TO WS-HD1-RUN-MONTH.
141370     MOVE WS-SYSOUT-RUN-DAY TO WS-HD1-RUN-DAY.
141380     MOVE CPY4-FOUR-DIGIT-YEAR TO WS-HD1-RUN-YEAR.
141390*
141400   8100-LOAD-TABLES.
141410*
141420     MOVE 0 TO WS-C225-TBL-ENT-CT.
141430     IF (NOT END-I225P-FILE)
141440         AND (WS-I225P-BC EQUAL SPACE)
141450       PERFORM 8130-LOAD-C225-TABLE.
141460*
141470     SET IX-WS-C285-TBL-EMPTY TO +1.
141480     IF NOT END-I285P-FILE
141490       PERFORM 8110-LOAD-C285-TABLE.
141500*
141510     SET IX-WS-C506-TBL-EMPTY TO +1.
141520     IF NOT END-I506P-FILE
141530       PERFORM 8120-LOAD-C506-TABLE.
141540*
141550     MOVE 0 TO WS-C1041-TBL-ENT-CT.
141560     IF NOT END-I1041P-FILE
141570       PERFORM 8140-BUILD-C1041-TABLE.
141580*
141590     MOVE +0 TO WS-C348-ENTRY-COUNT.
141600     IF (NOT END-I348P-FILE) AND (NOT EMPTY-I979-FILE)
141610*                * REP NAMES ARE USED ONLY ON THE 979 REPORT *
141620       PERFORM 8150-LOAD-C348-TABLE.
141630*
141640     PERFORM 8400-INIT-662P-NBC-TBL.
141650*
141660     MOVE 0 TO WS-C1979-ENTRY-COUNT.
141670     IF NOT END-I1979P-FILE
141680       PERFORM 8170-LOAD-C1979-TABLE.
141690*
141700     MOVE 0 TO WS-8920-ENTRY-COUNT.
141710     IF NOT END-I8920-FILE
141720       PERFORM 8180-LOAD-8920-TABLE.
141730*
141740     MOVE +0 TO WS-C761-ENTRY-COUNT.
141750     IF NOT END-I761P-FILE
141760       PERFORM 8250-LOAD-C761-TABLE.
141770*
141780     MOVE +0 TO WS-C761A-ENTRY-COUNT.
141790     IF NOT END-I761P2-FILE
141800       PERFORM 8280-LOAD-C761A-TABLE.
141810*
141820     MOVE +0 TO WS-C769-ENTRY-COUNT.
141830     IF NOT END-I769P-FILE
141840       PERFORM 8300-LOAD-C769-TABLE.
141850*
141860     MOVE +0 TO WS-C781-ENTRY-COUNT.
141870     IF NOT END-I781P-FILE
141880       PERFORM 8350-LOAD-C781-TABLE.
141890*
141900     MOVE +0 TO WS-C782-ENTRY-COUNT.
141910     IF NOT END-I782P-FILE
141920       PERFORM 8351-LOAD-C782-TABLE.
141930*
141940     MOVE +0 TO WS-C850-BC-ENTRY-COUNT WS-C850-HC-ENTRY-COUNT.
141950     IF NOT END-I850P-FILE
141960       PERFORM 8500-LOAD-C850-TABLES.
141970*
141980     MOVE +0 TO WS-C851-ENTRY-COUNT.
141990     IF NOT END-I851P-FILE
142000       PERFORM 8510-LOAD-C851-TABLE.
142010*
142020     MOVE +0 TO WS-C1712-ENTRY-COUNT.
142030     IF NOT END-I1712P-FILE
142040       PERFORM 8370-LOAD-C1712-TABLE.
142050*
142060     MOVE +0 TO  WS-C1921-ENTRY-HC-COUNT.
142070     MOVE +0 TO  WS-C1921-ENTRY-BC-COUNT.
142080     IF NOT END-I1921P-FILE
142090       PERFORM 8530-LOAD-I1921P-TABLE.
142100*
142110     MOVE +0 TO WS-C1907-ENTRY-COUNT.
142120     IF NOT END-I1907P-FILE
142130       PERFORM 8670-LOAD-C1907-TABLE.
142140*
142150     MOVE +0 TO WS-556-ENTRY-COUNT.
142160     IF NOT WS-I556-END-OF-FILE
142170       PERFORM 8600-LOAD-556-TABLE.
142180*
142190     MOVE +0 TO WS-561-ENTRY-COUNT.
142200     IF NOT WS-I561-END-OF-FILE
142210       PERFORM 8650-LOAD-561-TABLE.
142220*
142230     MOVE +0 TO WS-563-ENTRY-COUNT.
142240     IF NOT WS-I563-END-OF-FILE
142250       PERFORM 8700-LOAD-563-TABLE.
142260*
142270     MOVE +0 TO WS-567-ENTRY-COUNT.
142280     IF NOT WS-I567-END-OF-FILE
142290       PERFORM 8750-LOAD-567-TABLE.
142300*
142310     MOVE +0 TO WS-575-ENTRY-COUNT.
142320     IF NOT END-I575-FILE
142330       PERFORM 8800-LOAD-575-TABLE.
142340*
142350     MOVE +0 TO WS-877-ENTRY-COUNT.
142360     IF NOT END-I877-FILE
142370       PERFORM 8850-LOAD-877-TABLE.
142380*
142390     MOVE +0 TO WS-896-ENTRY-COUNT.
142400     IF NOT END-I896-FILE
142410       PERFORM 8900-LOAD-896-TABLE.
142420*
142430     MOVE +0 TO WS-1130P-ENTRY-COUNT.
142440     IF NOT END-1130P-FILE
142450       PERFORM 8870-LOAD-1130P-TABLE.
142460*
142470     MOVE +0 TO WS-1637-ENTRY-COUNT.
142480     IF NOT WS-I1637-END-OF-FILE
142490       PERFORM 8950-LOAD-1637-TABLE.
142500*
142510   8110-LOAD-C285-TABLE.
142520     PERFORM
142530         WITH TEST AFTER
142540         UNTIL END-I285P-FILE
142550       IF IX-WS-C285-TBL-EMPTY GREATER +801
142560         DISPLAY '* C285 TABLE OVERFLOWED *' UPON SYSOUT
142570         GO TO 9900-DISPLAY-ABORT
142580       END-IF
142590       MOVE I285P-INV-SEQ TO WS-C285-INV-SEQ
142600       MOVE I285P-PYMT-DAYS TO WS-C285-PYMT-DAYS
142610       MOVE WS-C285-REC TO
142620             WS-C285-TBL-REC (IX-WS-C285-TBL-EMPTY)
142630       SET IX-WS-C285-TBL-EMPTY UP BY 1
142640       PERFORM 8115-READ-I285P-FILE
142650     END-PERFORM.
142660     IF IX-WS-C285-TBL-EMPTY GREATER +641
142670       DISPLAY 'C285 TABLE OVER 80% FULL.' UPON SYSOUT
142680       MOVE 'Y' TO WS-RETURN-07-FLAG.
142690*
142700   8115-READ-I285P-FILE.
142710     READ I285P-FILE
142720       AT END
142730         MOVE 'E' TO WS-I285P-FILE-FLAG
142740       NOT AT END
142750         IF I285P-INV-SEQ NOT GREATER WS-I285P-SEQ
142760           DISPLAY '* I285P SEQUENCE ERROR "' WS-I285P-SEQ '" "'
142770                 I285P-INV-SEQ '" *' UPON SYSOUT
142780           GO TO 9900-DISPLAY-ABORT
142790         END-IF
142800         MOVE I285P-INV-SEQ TO WS-I285P-SEQ
142810     END-READ.
142820*
142830   8120-LOAD-C506-TABLE.
142840     MOVE 'G' TO WS-C506-CONST-G.
142850     MOVE SPACE TO WS-C506-CONST-SP.
142860     PERFORM
142870         WITH TEST AFTER
142880         UNTIL END-I506P-FILE
142890       IF IX-WS-C506-TBL-EMPTY GREATER +3200
142900         DISPLAY '* C506 TABLE OVERFLOWED *' UPON SYSOUT
142910         GO TO 9900-DISPLAY-ABORT
142920       END-IF
142930       MOVE WS-I506P-SEQ-HC-THRU-PBR TO WS-C506-HC-THRU-PBR
142940       MOVE I506P-START-DATE TO WS-C506-START-DATE
142950       MOVE I506P-END-DATE TO WS-C506-END-DATE
142960       MOVE I506P-LIMIT TO WS-C506-LIMIT
142970       MOVE WS-C506-REC TO WS-C506-TBL-REC (IX-WS-C506-TBL-EMPTY)
142980       SET IX-WS-C506-TBL-EMPTY UP BY 1
142990       PERFORM 8125-READ-I506P-FILE
143000     END-PERFORM.
143010     IF IX-WS-C506-TBL-EMPTY GREATER +2561
143020       DISPLAY 'C506 TABLE OVER 80% FULL.' UPON SYSOUT
143030       MOVE 'Y' TO WS-RETURN-07-FLAG.
143040*
143050   8125-READ-I506P-FILE.
143060     READ I506P-FILE
143070       AT END
143080         MOVE 'E' TO WS-I506P-FILE-FLAG
143090       NOT AT END
143100         MOVE WS-I506P-SEQ TO WS-PREV-I506P-SEQ
143110         MOVE I506P-HC TO WS-I506P-SEQ-HC
143120         MOVE I506P-HC-DIVS TO WS-I506P-SEQ-HC-DIVS
143130         MOVE I506P-MBC TO WS-I506P-SEQ-MBC
143140         MOVE I506P-MBC-DIVS TO WS-I506P-SEQ-MBC-DIVS
143150         MOVE I506P-BC TO WS-I506P-SEQ-BC
143160         MOVE I506P-PRI-BR TO WS-I506P-SEQ-PBR
143170         MOVE I506P-START-YR TO WS-I506P-SEQ-ST-YR
143180         MOVE I506P-START-MO TO WS-I506P-SEQ-ST-MO
143190         MOVE I506P-START-DY TO WS-I506P-SEQ-ST-DY
143200         IF WS-I506P-SEQ NOT GREATER WS-PREV-I506P-SEQ
143210           DISPLAY '* I506P SEQUENCE ERROR "' WS-PREV-I506P-SEQ
143220                 '" "' WS-I506P-SEQ '" *' UPON SYSOUT
143230           GO TO 9900-DISPLAY-ABORT
143240         END-IF
143250     END-READ.
143260*
143270   8130-LOAD-C225-TABLE.
143280     PERFORM
143290         WITH TEST AFTER
143300         UNTIL END-I225P-FILE
143310              OR (WS-I225P-BC NOT EQUAL SPACE)
143320       IF WS-C225-TBL-ENT-CT NOT LESS 800
143330         DISPLAY '* C225 HC TABLE OVERFLOWED *' UPON SYSOUT
143340         GO TO 9900-DISPLAY-ABORT
143350       END-IF
143360       ADD 1 TO WS-C225-TBL-ENT-CT
143370       MOVE I225P-INFO TO WS-C225-TBL-INFO (WS-C225-TBL-ENT-CT)
143380       PERFORM 6136-READ-I225P-FILE
143390     END-PERFORM.
143400     IF WS-C225-TBL-ENT-CT GREATER 640
143410       DISPLAY 'C225 HC TABLE OVER 80% FULL.' UPON SYSOUT
143420       MOVE 'Y' TO WS-RETURN-07-FLAG.
143430*
143440   8140-BUILD-C1041-TABLE.
143450     PERFORM
143460         WITH TEST AFTER
143470         UNTIL END-I1041P-FILE
143480       IF WS-C1041-TBL-ENT-CT NOT LESS 5000
143490         DISPLAY '* C1041 TABLE OVERFLOWED *' UPON SYSOUT
143500         GO TO 9900-DISPLAY-ABORT
143510       END-IF
143520       ADD 1 TO WS-C1041-TBL-ENT-CT
143530       MOVE I1041P-RECORD (1:72) TO
143540             WS-C1041-TBL-REC (WS-C1041-TBL-ENT-CT)
143550       PERFORM 8141-READ-I1041P-FILE
143560     END-PERFORM.
143570     IF WS-C1041-TBL-ENT-CT GREATER 4000
143580       DISPLAY 'C1041 TABLE OVER 80% FULL.' UPON SYSOUT
143590       MOVE 'Y' TO WS-RETURN-07-FLAG.
143600     PERFORM 8142-SET-C1041-TBL-INDEXES.
143610*
143620   8141-READ-I1041P-FILE.
143630     READ I1041P-FILE
143640       AT END
143650         MOVE 'E' TO WS-I1041P-FILE-FLAG
143660       NOT AT END
143670         IF I1041P-979-INST-SEQ LESS WS-I1041P-INST-SEQ
143680           DISPLAY '* I1041P SEQUENCE ERROR "'
143690                 WS-I1041P-INST-SEQ '"' UPON SYSOUT
143700           DISPLAY '            FOLLOWED BY "'
143710                 I1041P-979-INST-SEQ '" *' UPON SYSOUT
143720           GO TO 9900-DISPLAY-ABORT
143730         END-IF
143740         MOVE I1041P-979-INST-SEQ TO WS-I1041P-INST-SEQ
143750       END-READ.
143760*
143770   8142-SET-C1041-TBL-INDEXES.
143780     SET IX-WS-C1041-TBL-EMPTY TO WS-C1041-TBL-ENT-CT.
143790     SET IX-WS-C1041-TBL-EMPTY UP BY 1.
143800     SET IX-WS-C1041-TBL-CURR TO +1.
143810     PERFORM
143820         WITH TEST BEFORE
143830         UNTIL (IX-WS-C1041-TBL-CURR NOT LESS
143840                   IX-WS-C1041-TBL-EMPTY)
143850             OR (WS-C1041-TBL-HC (IX-WS-C1041-TBL-CURR)
143860                   NOT EQUAL SPACES)
143870             OR (WS-C1041-TBL-MBC (IX-WS-C1041-TBL-CURR)
143880                   NOT EQUAL SPACES)
143890       SET IX-WS-C1041-TBL-CURR UP BY 1
143900     END-PERFORM.
143910     SET IX-WS-C1041-TBL-M1 TO IX-WS-C1041-TBL-CURR.
143920     PERFORM
143930         WITH TEST BEFORE
143940         UNTIL (IX-WS-C1041-TBL-CURR NOT LESS
143950                   IX-WS-C1041-TBL-EMPTY)
143960             OR (WS-C1041-TBL-HC (IX-WS-C1041-TBL-CURR)
143970                   NOT EQUAL SPACES)
143980       SET IX-WS-C1041-TBL-CURR UP BY 1
143990     END-PERFORM.
144000     SET IX-WS-C1041-TBL-H1 TO IX-WS-C1041-TBL-CURR.
144010*
144020   8150-LOAD-C348-TABLE.
144030     PERFORM
144040         UNTIL END-I348P-FILE
144050       IF I348P-EMPLOYEE-NBR GREATER WS-I348P-EMP-NBR
144060         IF WS-C348-ENTRY-COUNT LESS +1500
144070           MOVE I348P-FIRST-NAME TO WS-SW-FIELD
144080           IF I348P-FIRST-NAME EQUAL SPACE
144090             MOVE +1 TO WS-SW-POINTER
144100           ELSE
144110             MOVE +15 TO WS-SW-POINTER
144120             PERFORM
144130                 WITH TEST BEFORE
144140                 UNTIL WS-SW-BYTE (WS-SW-POINTER) NOT EQUAL SPACE
144150               SUBTRACT 1 FROM WS-SW-POINTER
144160             END-PERFORM
144170             ADD 2 TO WS-SW-POINTER
144180           END-IF
144190           IF I348P-INITIAL NOT EQUAL SPACE
144200             STRING I348P-INITIAL '. ' DELIMITED BY SIZE INTO
144210                   WS-SW-FIELD WITH POINTER WS-SW-POINTER
144220           END-IF
144230           STRING I348P-LAST-NAME DELIMITED BY SIZE INTO
144240                 WS-SW-FIELD WITH POINTER WS-SW-POINTER
144250           ADD 1 TO WS-C348-ENTRY-COUNT
144260           MOVE I348P-EMPLOYEE-NBR TO WS-I348P-EMP-NBR
144270                 WS-C348-TBL-EMP-NBR (WS-C348-ENTRY-COUNT)
144280           MOVE WS-SW-FIELD TO WS-C348-TBL-EMP-NAME
144290                 (WS-C348-ENTRY-COUNT)
144300         ELSE
144310           DISPLAY '* C348 TABLE OVERFLOWED *' UPON SYSOUT
144320           GO TO 9900-DISPLAY-ABORT
144330       ELSE
144340         IF I348P-EMPLOYEE-NBR LESS WS-I348P-EMP-NBR
144350*                * DUPLICATES BYPASSED WITHOUT COMMENT *
144360           DISPLAY '* I348P SEQUENCE ERROR "' WS-I348P-EMP-NBR
144370                 '" "' I348P-EMPLOYEE-NBR '" *' UPON SYSOUT
144380           GO TO 9900-DISPLAY-ABORT
144390         END-IF
144400       END-IF
144410       PERFORM 8160-READ-I348P-FILE
144420     END-PERFORM.
144430     IF WS-C348-ENTRY-COUNT GREATER +1200
144440       DISPLAY 'C348 TABLE OVER 80% FULL.' UPON SYSOUT
144450       MOVE 'Y' TO WS-RETURN-07-FLAG.
144460*
144470   8160-READ-I348P-FILE.
144480     READ I348P-FILE AT END
144490       MOVE 'E' TO WS-I348P-FILE-FLAG.
144500*
144510   8170-LOAD-C1979-TABLE.
144520     PERFORM
144530         UNTIL END-I1979P-FILE
144540       IF I1979P-IGNORE-FLAG NOT EQUAL '*'
144550         IF WS-C1979-ENTRY-COUNT NOT LESS 3000
144560           DISPLAY '* C1979 TABLE OVERFLOWED *' UPON SYSOUT
144570           GO TO 9900-DISPLAY-ABORT
144580         ELSE
144590           ADD 1 TO WS-C1979-ENTRY-COUNT
144600           MOVE I1979P-REC TO
144610                 WS-C1979-TBL-REC (WS-C1979-ENTRY-COUNT)
144620         END-IF
144630       END-IF
144640       PERFORM 8175-READ-I1979P-FILE
144650     END-PERFORM.
144660     IF WS-C1979-ENTRY-COUNT GREATER 2400
144670       DISPLAY 'C1979 TABLE OVER 80% FULL.' UPON SYSOUT
144680       MOVE 'Y' TO WS-RETURN-07-FLAG.
144690*
144700   8175-READ-I1979P-FILE.
144710     READ I1979P-FILE AT END
144720       MOVE 'E' TO WS-I1979P-FILE-FLAG.
144730*
144740   8180-LOAD-8920-TABLE.
144750     PERFORM
144760         UNTIL END-I8920-FILE
144770       IF WS-8920-ENTRY-COUNT NOT LESS 3000
144780         DISPLAY '* 8920 TABLE OVERFLOWED *' UPON SYSOUT
144790         GO TO 9900-DISPLAY-ABORT
144800       ELSE
144810         ADD 1 TO WS-8920-ENTRY-COUNT
144820         MOVE I8920-RECORD TO
144830               WS-8920-TBL-REC (WS-8920-ENTRY-COUNT)
144840       END-IF
144850       PERFORM 8185-READ-I8920-FILE
144860     END-PERFORM.
144870     IF WS-8920-ENTRY-COUNT GREATER 2400
144880       DISPLAY '8920 TABLE OVER 80% FULL.' UPON SYSOUT
144890       MOVE 'Y' TO WS-RETURN-07-FLAG.
144900*
144910   8185-READ-I8920-FILE.
144920     READ I8920-FILE AT END
144930       MOVE 'E' TO WS-I8920-FILE-FLAG.
144940*
144950   8250-LOAD-C761-TABLE.
144960     PERFORM
144970         UNTIL END-I761P-FILE
144980       IF WS-C761-ENTRY-COUNT LESS +8000
144990         ADD 1 TO WS-C761-ENTRY-COUNT
145000         MOVE I761P-RECORD TO WS-C761-TBL-ENTRY
145010               (WS-C761-ENTRY-COUNT)
145020       ELSE
145030         DISPLAY '* C761 TABLE OVERFLOWED *' UPON SYSOUT
145040         GO TO 9900-DISPLAY-ABORT
145050       END-IF
145060       PERFORM 8260-READ-I761P-FILE
145070     END-PERFORM.
145080     IF WS-C761-ENTRY-COUNT GREATER +6400
145090       DISPLAY 'C761 TABLE OVER 80% FULL.' UPON SYSOUT
145100       MOVE 'Y' TO WS-RETURN-07-FLAG.
145110*
145120   8260-READ-I761P-FILE.
145130     READ I761P-FILE AT END
145140       MOVE 'E' TO WS-I761P-FILE-FLAG.
145150*
145160   8280-LOAD-C761A-TABLE.
145170     PERFORM
145180         UNTIL END-I761P2-FILE
145190       IF WS-C761A-ENTRY-COUNT LESS +8000
145200         ADD 1 TO WS-C761A-ENTRY-COUNT
145210         MOVE I761P2-RECORD TO WS-C761A-TBL-ENTRY
145220               (WS-C761A-ENTRY-COUNT)
145230       ELSE
145240         DISPLAY '* C761A TABLE OVERFLOWED *' UPON SYSOUT
145250         GO TO 9900-DISPLAY-ABORT
145260       END-IF
145270       PERFORM 8290-READ-I761P2-FILE
145280     END-PERFORM.
145290     IF WS-C761A-ENTRY-COUNT GREATER +6400
145300       DISPLAY 'C761A TABLE OVER 80% FULL.' UPON SYSOUT
145310       MOVE 'Y' TO WS-RETURN-07-FLAG.
145320*
145330   8290-READ-I761P2-FILE.
145340     READ I761P2-FILE AT END
145350       MOVE 'E' TO WS-I761P2-FILE-FLAG.
145360*
145370   8300-LOAD-C769-TABLE.
145380     PERFORM
145390         UNTIL END-I769P-FILE
145400       IF (WS-C769-ENTRY-COUNT EQUAL +0)
145410           OR (I769P-SEQ-D LESS WS-I769P-SEQ-D)
145420           OR ((I769P-SEQ-D EQUAL WS-I769P-SEQ-D)
145430               AND (I769P-SEQ-A GREATER WS-I769P-SEQ-A))
145440         IF WS-C769-ENTRY-COUNT LESS +16000
145450           ADD 1 TO WS-C769-ENTRY-COUNT
145460           MOVE I769P-RECORD TO WS-C769-TBL-ENTRY
145470                 (WS-C769-ENTRY-COUNT)
145480         ELSE
145490           DISPLAY '* C769 TABLE OVERFLOWED *' UPON SYSOUT
145500           GO TO 9900-DISPLAY-ABORT
145510         END-IF
145520         MOVE I769P-SEQ-FIELDS TO WS-I769P-SEQ-FIELDS
145530       ELSE
145540         DISPLAY '* I769P SEQUENCE ERROR "' WS-I769P-SEQ-FIELDS
145550               '"' UPON SYSOUT
145560         DISPLAY '           FOLLOWED BY "' I769P-SEQ-FIELDS '" *'
145570               UPON SYSOUT
145580         GO TO 9900-DISPLAY-ABORT
145590       END-IF
145600       PERFORM 8310-READ-I769P-FILE
145610     END-PERFORM.
145620     IF WS-C769-ENTRY-COUNT GREATER +12800
145630       DISPLAY 'C769 TABLE OVER 80% FULL.' UPON SYSOUT
145640       MOVE 'Y' TO WS-RETURN-07-FLAG.
145650*
145660   8310-READ-I769P-FILE.
145670     READ I769P-FILE AT END
145680       MOVE 'E' TO WS-I769P-FILE-FLAG.
145690*
145700   8350-LOAD-C781-TABLE.
145710     PERFORM
145720         UNTIL END-I781P-FILE
145730       IF WS-C781-ENTRY-COUNT LESS +8000
145740         ADD 1 TO WS-C781-ENTRY-COUNT
145750         MOVE I781P-MATCH-FIELDS TO WS-C781-MATCH-FIELDS
145760               (WS-C781-ENTRY-COUNT)
145770         MOVE I781P-ASSIGNMENT-FIELDS TO WS-C781-ASSIGNMENT-FIELDS
145780               (WS-C781-ENTRY-COUNT)
145790         MOVE I781P-COMMENT TO WS-C781-COMMENT
145800               (WS-C781-ENTRY-COUNT)
145810         MOVE I781P-CARD-CODE TO WS-C781-CARD-CODE
145820               (WS-C781-ENTRY-COUNT)
145830       ELSE
145840         DISPLAY '* C781 TABLE OVERFLOWED *' UPON SYSOUT
145850         GO TO 9900-DISPLAY-ABORT
145860       END-IF
145870       PERFORM 8360-READ-I781P-FILE
145880     END-PERFORM.
145890     IF WS-C781-ENTRY-COUNT GREATER +6400
145900       DISPLAY 'C781 TABLE OVER 80% FULL.' UPON SYSOUT
145910       MOVE 'Y' TO WS-RETURN-07-FLAG.
145920*
145930   8351-LOAD-C782-TABLE.
145940     PERFORM
145950         UNTIL END-I782P-FILE
145960       IF WS-C782-ENTRY-COUNT LESS +8000
145970         ADD 1 TO WS-C782-ENTRY-COUNT
145980         MOVE I782P-SEQUENCE TO WS-I782P-SEQUENCE
145990               (WS-C782-ENTRY-COUNT)
146000         MOVE I782P-ASSIGNMENT(1) TO WS-I782-ASSIGNMENT
146010                            (WS-C782-ENTRY-COUNT, 1)
146020         MOVE I782P-ASSIGNMENT(2) TO WS-I782-ASSIGNMENT
146030                            (WS-C782-ENTRY-COUNT, 2)
146040         MOVE I782P-ASSIGNMENT(3) TO WS-I782-ASSIGNMENT
146050                            (WS-C782-ENTRY-COUNT, 3)
146060       ELSE
146070         DISPLAY '* C782 TABLE OVERFLOWED *' UPON SYSOUT
146080         GO TO 9900-DISPLAY-ABORT
146090       END-IF
146100       PERFORM 8361-READ-I782P-FILE
146110     END-PERFORM.
146120     IF WS-C782-ENTRY-COUNT GREATER +6400
146130       DISPLAY 'C782 TABLE OVER 80% FULL.' UPON SYSOUT
146140       MOVE 'Y' TO WS-RETURN-07-FLAG.
146150*
146160   8360-READ-I781P-FILE.
146170     READ I781P-FILE AT END
146180       MOVE 'E' TO WS-I781P-FILE-FLAG.
146190*
146200   8361-READ-I782P-FILE.
146210     READ I782P-FILE AT END
146220       MOVE 'E' TO WS-I782P-FILE-FLAG.
146230*
146240   8370-LOAD-C1712-TABLE.
146250     PERFORM
146260         UNTIL END-I1712P-FILE
146270       IF WS-C1712-ENTRY-COUNT LESS +8000
146280         ADD 1 TO WS-C1712-ENTRY-COUNT
146290         MOVE I1712P-REPORT-NUMBER TO WS-C1712-REPORT-NUMBER
146300               (WS-C1712-ENTRY-COUNT)
146310         MOVE I1712P-DATE-FIRST-BILLED TO WS-C1712-DATE-FIRST-BILL
146320               (WS-C1712-ENTRY-COUNT)
146330         MOVE I1712P-DATE-FINAL-BILLED TO WS-C1712-DATE-FINAL-BILL
146340               (WS-C1712-ENTRY-COUNT)
146350         MOVE I1712P-BILL-TO-BC        TO WS-C1712-BC
146360               (WS-C1712-ENTRY-COUNT)
146370         MOVE I1712P-BILL-TO-BRANCH    TO WS-C1712-PRI-BR
146380               (WS-C1712-ENTRY-COUNT)
146390         MOVE I1712P-FREQUENCY         TO WS-C1712-FREQUENCY
146400               (WS-C1712-ENTRY-COUNT)
146410         MOVE I1712P-CONVERSION-TO-DISK TO WS-C1712-DISK
146420               (WS-C1712-ENTRY-COUNT)
146430         MOVE I1712P-ADDITIONAL-SHIPPING TO WS-C1712-SHIPPING
146440               (WS-C1712-ENTRY-COUNT)
146450         MOVE I1712P-ON-GOING-HOURS      TO WS-C1712-HOURS
146460               (WS-C1712-ENTRY-COUNT)
146470         MOVE I1712P-SET-UP-TIME         TO WS-C1712-SET-UP-TIME
146480               (WS-C1712-ENTRY-COUNT)
146490         MOVE I1712P-RUSH-DEVELOPMENT    TO WS-C1712-RUSH-DEVELOPE
146500               (WS-C1712-ENTRY-COUNT)
146510         MOVE I1712P-PAGE-COUNT          TO WS-C1712-PAGE-COUNT
146520               (WS-C1712-ENTRY-COUNT)
146530       ELSE
146540         DISPLAY '* C1712 TABLE OVERFLOWED *' UPON SYSOUT
146550         GO TO 9900-DISPLAY-ABORT
146560       END-IF
146570       PERFORM 8380-READ-I1712P-FILE
146580     END-PERFORM.
146590     IF WS-C1712-ENTRY-COUNT GREATER +6400
146600       DISPLAY 'C1712 TABLE OVER 80% FULL.' UPON SYSOUT
146610       MOVE 'Y' TO WS-RETURN-07-FLAG.
146620*
146630   8380-READ-I1712P-FILE.
146640     READ I1712P-FILE AT END
146650       MOVE 'E' TO WS-I1712P-FILE-FLAG.
146660*
146670   8400-INIT-662P-NBC-TBL.
146680     MOVE 0 TO WS-662P-NBC-ENT-CT.
146690     PERFORM
146700         WITH TEST BEFORE
146710         UNTIL END-I662P-FILE
146720             OR (WS-I662P-BC IS NUMERIC)
146730       IF (SPACE EQUAL I662P-BC AND I662P-PRI-BR AND
146740             I662P-SEC-BR AND I662P-BILL-TYPE)
146750           AND (I662P-EXP-CODE (1:1) NOT EQUAL '*')
146760           AND (I662P-EXP-CODE (2:1) NOT EQUAL '*')
146770           AND (WS-662P-NBC-ENT-CT LESS 300)
146780         ADD 1 TO WS-662P-NBC-ENT-CT
146790         MOVE I662P-EXP-CODE TO
146800               WS-662P-NBC-TBL-EXP-CD (WS-662P-NBC-ENT-CT)
146810         MOVE I662P-EXP-CODE-DESCR TO
146820               WS-662P-NBC-TBL-DESCR (WS-662P-NBC-ENT-CT)
146830       END-IF
146840       PERFORM 3510-READ-I662P-FILE
146850     END-PERFORM.
146860*
146870   8500-LOAD-C850-TABLES.
146880     PERFORM
146890         WITH TEST AFTER
146900         UNTIL END-I850P-FILE
146910       MOVE WS-I850P-SEQ TO WS-PREV-I850P-SEQ
146920       MOVE I850P-INST-TYP TO WS-I850P-INST-TYP
146930       MOVE I850P-INST-NBR TO WS-I850P-INST-NBR
146940       IF WS-I850P-SEQ NOT GREATER WS-PREV-I850P-SEQ
146950         DISPLAY '* I850P SEQUENCE ERROR "' WS-PREV-I850P-SEQ
146960               '" "' WS-I850P-SEQ '" *'
146970         GO TO 9900-DISPLAY-ABORT
146980       END-IF
146990       MOVE I850P-INFO TO WS-C850-ENTRY
147000       IF (WS-C850-INST-TYP EQUAL 'B')
147010           AND (WS-C850-INST-BC IS NUMERIC)
147020*                * VALID BC CARD *
147030         IF WS-C850-BC-ENTRY-COUNT NOT LESS +2000
147040           DISPLAY '* C850 BC TABLE OVERFLOWED *' UPON SYSOUT
147050           GO TO 9900-DISPLAY-ABORT
147060         END-IF
147070         ADD 1 TO WS-C850-BC-ENTRY-COUNT
147080         MOVE WS-C850-ENTRY TO
147090               WS-C850-BC-TBL-ENTRY (WS-C850-BC-ENTRY-COUNT)
147100       ELSE
147110         IF (WS-C850-INST-TYP EQUAL 'H')
147120             AND (WS-C850-INST-HC IS VALID-HC-CHARS)
147130             AND (WS-C850-HC-SPACES EQUAL SPACE)
147140*                * VALID HC CARD *
147150           IF WS-C850-HC-ENTRY-COUNT NOT LESS +2000
147160             DISPLAY '* C850 HC TABLE OVERFLOWED *' UPON SYSOUT
147170             GO TO 9900-DISPLAY-ABORT
147180           END-IF
147190           ADD 1 TO WS-C850-HC-ENTRY-COUNT
147200           MOVE WS-C850-ENTRY TO
147210                 WS-C850-HC-TBL-ENTRY (WS-C850-HC-ENTRY-COUNT)
147220         END-IF
147230       END-IF
147240       PERFORM 8501-READ-I850P-FILE
147250     END-PERFORM.
147260     IF WS-C850-BC-ENTRY-COUNT GREATER +1600
147270       DISPLAY 'C850 BC TABLE OVER 80% FULL.' UPON SYSOUT
147280       MOVE 'Y' TO WS-RETURN-07-FLAG.
147290     IF WS-C850-HC-ENTRY-COUNT GREATER +1600
147300       DISPLAY 'C850 HC TABLE OVER 80% FULL.' UPON SYSOUT
147310       MOVE 'Y' TO WS-RETURN-07-FLAG.
147320*
147330   8501-READ-I850P-FILE.
147340     READ I850P-FILE
147350       AT END
147360         MOVE 'E' TO WS-I850P-FILE-FLAG.
147370*
147380   8510-LOAD-C851-TABLE.
147390     PERFORM
147400         WITH TEST AFTER
147410         UNTIL END-I851P-FILE
147420       IF I851P-CONSID-NBR NOT GREATER WS-I851P-SEQ
147430         DISPLAY '* I851P SEQUENCE ERROR "' WS-I851P-SEQ
147440               '" "' I851P-CONSID-NBR '" *'
147450         GO TO 9900-DISPLAY-ABORT
147460       END-IF
147470       IF WS-C851-ENTRY-COUNT NOT LESS +2000
147480         DISPLAY '* C851 TABLE OVERFLOWED *' UPON SYSOUT
147490         GO TO 9900-DISPLAY-ABORT
147500       END-IF
147510       ADD 1 TO WS-C851-ENTRY-COUNT
147520       MOVE I851P-INFO TO WS-C851-TBL-ENTRY (WS-C851-ENTRY-COUNT)
147530       MOVE I851P-CONSID-NBR TO WS-I851P-SEQ
147540       PERFORM 8511-READ-I851P-FILE
147550     END-PERFORM.
147560     IF WS-C851-ENTRY-COUNT GREATER +1600
147570       DISPLAY 'C851 TABLE OVER 80% FULL.' UPON SYSOUT
147580       MOVE 'Y' TO WS-RETURN-07-FLAG.
147590*
147600   8511-READ-I851P-FILE.
147610     READ I851P-FILE
147620       AT END
147630         MOVE 'E' TO WS-I851P-FILE-FLAG.
147640*
147650   8530-LOAD-I1921P-TABLE.
147660     PERFORM
147670            UNTIL END-I1921P-FILE
147680       IF I1921P-CARD-TYPE EQUAL 'B'
147690         IF I1921P-INSTITUTION IS NUMERIC
147700           IF WS-C1921-ENTRY-BC-COUNT LESS +10000
147710              ADD 1 TO WS-C1921-ENTRY-BC-COUNT
147720              MOVE I1921P-INSTITUTION TO
147730                    WS-C1921-TABLE-BC (WS-C1921-ENTRY-BC-COUNT)
147740           ELSE
147750              DISPLAY '* ' WS-PROGRAM-NUMBER
147760                    ' ABORTED FOR C1921 BC TABLE OVERFLOW *'
147770                    UPON SYSOUT
147780              GO TO 9900-DISPLAY-ABORT
147790           END-IF
147800         ELSE
147810            DISPLAY 'ERROR: I1921P CARD "' I1921P-INFO
147820                  '" REJECTED FOR NON-NUMERIC BC "'
147830                  I1921P-INSTITUTION '"' UPON SYSOUT
147840            GO TO 9900-DISPLAY-ABORT
147850         END-IF
147860       ELSE
147870         IF I1921P-CARD-TYPE EQUAL 'H'
147880           IF (I1921P-HOLDCO-CODE IS VALID-HC-CHARS)
147890                    AND (I1921P-HOLDCO-SPACES EQUAL SPACES)
147900             IF WS-C1921-ENTRY-HC-COUNT LESS +10000
147910                ADD 1 TO WS-C1921-ENTRY-HC-COUNT
147920                MOVE I1921P-HOLDCO-CODE TO
147930                      WS-C1921-TABLE-HC (WS-C1921-ENTRY-HC-COUNT)
147940             ELSE
147950                DISPLAY '* ' WS-PROGRAM-NUMBER
147960                      ' ABORTED FOR C1921 HC TABLE OVERFLOW *'
147970                      UPON SYSOUT
147980                GO TO 9900-DISPLAY-ABORT
147990             END-IF
148000           ELSE
148010              DISPLAY 'ERROR: I1921P CARD "' I1921P-INFO
148020                    '" REJECTED FOR HOLDING COMPANY "'
148030                    I1921P-INSTITUTION
148040                    '" INVALID OR NOT LEFT-JUSTIFIED' UPON SYSOUT
148050              GO TO 9900-DISPLAY-ABORT
148060           END-IF
148070         ELSE
148080            DISPLAY 'ERROR: I1921P CARD "' I1921P-INFO
148090                  '" REJECTED FOR INVALID CARD TYPE "'
148100                  I1921P-CARD-TYPE '"' UPON SYSOUT
148110            GO TO 9900-DISPLAY-ABORT
148120         END-IF
148130       END-IF
148140         PERFORM 8540-READ-I1921P-FILE
148150     END-PERFORM.
148160     IF  WS-C1921-ENTRY-BC-COUNT  GREATER +8000
148170       DISPLAY 'C1921 TABLE OVER 80% FULL.' UPON SYSOUT
148180       MOVE 'Y' TO WS-RETURN-07-FLAG.
148190     IF  WS-C1921-ENTRY-HC-COUNT  GREATER +8000
148200       DISPLAY 'C1921 TABLE OVER 80% FULL.' UPON SYSOUT
148210       MOVE 'Y' TO WS-RETURN-07-FLAG.
148220*
148230   8540-READ-I1921P-FILE.
148240     READ I1921P-FILE AT END
148250       MOVE 'E' TO WS-I1921P-FILE-FLAG.
148260*
148270   8561-READ-I566SUM-FILE.
148280     READ I566SUM-FILE AT END
148290       MOVE 'E' TO WS-I566SUM-FILE-FLAG.
148300     IF NOT END-I566SUM-FILE
148310        IF I566S-REC-SEQ NOT LESS WS-PREV-I566S-SEQ
148320           MOVE I566S-REC-SEQ TO WS-PREV-I566S-SEQ
148330        ELSE
148340           DISPLAY '* I566SUM SEQUENCE ERROR "'
148350                 WS-PREV-I566S-SEQ '" "' I566S-REC-SEQ '" *'
148360                 UPON SYSOUT
148370           GO TO 9900-DISPLAY-ABORT.
148380*
148390   8600-LOAD-556-TABLE.
148400     PERFORM
148410         UNTIL WS-I556-END-OF-FILE
148420       IF WS-556-ENTRY-COUNT LESS +16000
148430         MOVE I556-KEY TO WS-556-KEY
148440         MOVE I556-DATE-OF-LAST-UPDATE TO WS-556-UPDATE
148450         MOVE I556-SUMMARY-FIELDS TO WS-556-SUM-FLDS
148460         MOVE I556-MATCH-FIELDS TO WS-556-MATCH-FLDS
148470         ADD 1 TO WS-556-ENTRY-COUNT
148480         MOVE WS-556-REC TO WS-556-TBL-ENTRY (WS-556-ENTRY-COUNT)
148490       ELSE
148500         DISPLAY '* 556 TABLE OVERFLOWED *' UPON SYSOUT
148510         GO TO 9900-DISPLAY-ABORT
148520       END-IF
148530       PERFORM 8610-READ-I556-FILE-NEXT
148540     END-PERFORM.
148550     IF WS-556-ENTRY-COUNT GREATER +12800
148560       DISPLAY '556 TABLE OVER 80% FULL.' UPON SYSOUT
148570       MOVE 'Y' TO WS-RETURN-07-FLAG.
148580*
148590   8610-READ-I556-FILE-NEXT.
148600     READ I556-FILE NEXT RECORD.
148610     IF (NOT WS-I556-SUCCESSFUL)
148620         AND (NOT WS-I556-END-OF-FILE)
148630       DISPLAY '* VSAM ERROR ON I556 READ NEXT. FILE STATUS = '
148640             WS-I556-FILE-STATUS '. *' UPON SYSOUT
148650       GO TO 9900-DISPLAY-ABORT.
148660*
148670   8650-LOAD-561-TABLE.
148680     PERFORM
148690         UNTIL WS-I561-END-OF-FILE
148700       IF I561-BILLING-BC NOT EQUAL SPACE AND
148710             I561-PRODUCTION-BC
148720         IF WS-561-ENTRY-COUNT LESS +60000
148730           ADD 1 TO WS-561-ENTRY-COUNT
148740           MOVE I561-BILLING-BC TO WS-561-BILLING-BC
148750                 (WS-561-ENTRY-COUNT)
148760           MOVE I561-RECORD-KEY TO WS-561-RECORD-KEY
148770                 (WS-561-ENTRY-COUNT)
148780         ELSE
148790           DISPLAY '* 561 TABLE OVERFLOWED *' UPON SYSOUT
148800           GO TO 9900-DISPLAY-ABORT
148810         END-IF
148820       END-IF
148830       PERFORM 2020-READ-I561-FILE-NEXT
148840     END-PERFORM.
148850     IF WS-561-ENTRY-COUNT GREATER +48000
148860       DISPLAY '561 TABLE OVER 80% FULL.' UPON SYSOUT
148870       MOVE 'Y' TO WS-RETURN-07-FLAG.
148880*
148890   8670-LOAD-C1907-TABLE.
148900     PERFORM
148910         UNTIL END-I1907P-FILE
148920       IF WS-C1907-ENTRY-COUNT LESS +9000
148930         ADD 1 TO WS-C1907-ENTRY-COUNT
148940         MOVE I1907P-RECORD TO WS-C1907-TBL-REC
148950               (WS-C1907-ENTRY-COUNT)
148960       ELSE
148970         DISPLAY '* C1907 TABLE OVERFLOWED *' UPON SYSOUT
148980         GO TO 9900-DISPLAY-ABORT
148990       END-IF
149000       PERFORM 8680-READ-I1907P-FILE
149010     END-PERFORM.
149020     IF WS-C1907-ENTRY-COUNT GREATER +7200
149030       DISPLAY 'C1907 TABLE OVER 80% FULL.' UPON SYSOUT
149040       MOVE 'Y' TO WS-RETURN-07-FLAG.
149050*
149060   8680-READ-I1907P-FILE.
149070     READ I1907P-FILE AT END
149080       MOVE 'E' TO WS-I1907P-FILE-FLAG.
149090*
149100   8700-LOAD-563-TABLE.
149110     PERFORM
149120         UNTIL WS-I563-END-OF-FILE
149130       IF I563-CHANGE-BC NOT EQUAL SPACE AND I563-BC
149140         IF WS-563-ENTRY-COUNT LESS +3500
149150           ADD 1 TO WS-563-ENTRY-COUNT
149160           MOVE I563-CHANGE-BC TO WS-563-CHANGE-BC
149170                 (WS-563-ENTRY-COUNT)
149180           MOVE I563-RECORD-KEY TO WS-563-RECORD-KEY
149190                 (WS-563-ENTRY-COUNT)
149200         ELSE
149210           DISPLAY '* 563 TABLE OVERFLOWED *' UPON SYSOUT
149220           GO TO 9900-DISPLAY-ABORT
149230         END-IF
149240       END-IF
149250       PERFORM 2220-READ-I563-FILE-NEXT
149260     END-PERFORM.
149270     IF WS-563-ENTRY-COUNT GREATER +2800
149280       DISPLAY '563 TABLE OVER 80% FULL.' UPON SYSOUT
149290       MOVE 'Y' TO WS-RETURN-07-FLAG.
149300*
149310   8750-LOAD-567-TABLE.
149320     PERFORM
149330         UNTIL WS-I567-END-OF-FILE
149340       IF I567-CHANGE-BC NOT EQUAL SPACE AND I567-BC
149350         IF WS-567-ENTRY-COUNT LESS +200
149360           ADD 1 TO WS-567-ENTRY-COUNT
149370           MOVE I567-CHANGE-BC TO WS-567-CHANGE-BC
149380                 (WS-567-ENTRY-COUNT)
149390           MOVE I567-RECORD-KEY TO WS-567-RECORD-KEY
149400                 (WS-567-ENTRY-COUNT)
149410         ELSE
149420           DISPLAY '* 567 TABLE OVERFLOWED *' UPON SYSOUT
149430           GO TO 9900-DISPLAY-ABORT
149440         END-IF
149450       END-IF
149460       PERFORM 2520-READ-I567-FILE-NEXT
149470     END-PERFORM.
149480     IF WS-567-ENTRY-COUNT GREATER +160
149490       DISPLAY '567 TABLE OVER 80% FULL.' UPON SYSOUT
149500       MOVE 'Y' TO WS-RETURN-07-FLAG.
149510*
149520   8800-LOAD-575-TABLE.
149530     PERFORM
149540         UNTIL END-I575-FILE
149550       IF I575-SEQUENCE GREATER WS-I575-SEQUENCE
149560         IF WS-575-ENTRY-COUNT LESS +50000
149570           ADD 1 TO WS-575-ENTRY-COUNT
149580           MOVE I575-REC TO WS-575-TBL-ENTRY (WS-575-ENTRY-COUNT)
149590         ELSE
149600           DISPLAY '* 575 TABLE OVERFLOWED *' UPON SYSOUT
149610           GO TO 9900-DISPLAY-ABORT
149620         END-IF
149630         MOVE I575-SEQUENCE TO WS-I575-SEQUENCE
149640       ELSE
149650         DISPLAY '* I575 SEQUENCE ERROR "' WS-I575-SEQUENCE '" "'
149660               I575-SEQUENCE '" *' UPON SYSOUT
149670         GO TO 9900-DISPLAY-ABORT
149680       END-IF
149690       PERFORM 8810-READ-I575-FILE
149700     END-PERFORM.
149710     IF WS-575-ENTRY-COUNT GREATER +40000
149720       DISPLAY '575 TABLE OVER 80% FULL.' UPON SYSOUT
149730       MOVE 'Y' TO WS-RETURN-07-FLAG.
149740*
149750   8810-READ-I575-FILE.
149760     READ I575-FILE AT END
149770       MOVE 'E' TO WS-I575-FILE-FLAG.
149780*
149790   8850-LOAD-877-TABLE.
149800     PERFORM
149810         UNTIL END-I877-FILE
149820       IF I877-RECORD-KEY GREATER WS-I877-RECORD-KEY
149830         IF WS-877-ENTRY-COUNT LESS +70000
149840           ADD 1 TO WS-877-ENTRY-COUNT
149850           MOVE I877-REC TO WS-877-TBL-ENTRY (WS-877-ENTRY-COUNT)
149860         ELSE
149870           DISPLAY '* 877 TABLE OVERFLOWED *' UPON SYSOUT
149880           GO TO 9900-DISPLAY-ABORT
149890         END-IF
149900         MOVE I877-RECORD-KEY TO WS-I877-RECORD-KEY
149910       ELSE
149920         DISPLAY '* I877 SEQUENCE ERROR "' WS-I877-RECORD-KEY
149930               '" "' I877-RECORD-KEY '" *' UPON SYSOUT
149940         GO TO 9900-DISPLAY-ABORT
149950       END-IF
149960       PERFORM 8860-READ-I877-FILE
149970     END-PERFORM.
149980     IF WS-877-ENTRY-COUNT GREATER +56000
149990       DISPLAY '877 TABLE OVER 80% FULL.' UPON SYSOUT
150000       MOVE 'Y' TO WS-RETURN-07-FLAG.
150010*
150020   8860-READ-I877-FILE.
150030     READ I877-FILE AT END
150040       MOVE 'E' TO WS-I877-FILE-FLAG.
150050*
150060   8870-LOAD-1130P-TABLE.
150070*
150080     SET IX-WS-1130P-TBL TO +1.
150090     PERFORM
150100         UNTIL END-1130P-FILE
150110     IF WS-1130P-ENTRY-COUNT LESS +70000
150120       ADD 1 TO WS-1130P-ENTRY-COUNT
150130       MOVE I1130P-CONSID-NBR TO
150140            WS-1130P-TBL-CONSID-NBR (IX-WS-1130P-TBL)
150150       MOVE I1130P-PRODUCT-CODE TO
150160            WS-1130P-TBL-PRODUCT-CODE (IX-WS-1130P-TBL)
150170       MOVE I1130P-NAME TO WS-1130P-TBL-NAME (IX-WS-1130P-TBL)
150180       MOVE I1130P-PRODUCT-DESC TO
150190            WS-1130P-TBL-PRODUCT-DESC (IX-WS-1130P-TBL)
150200       SET IX-WS-1130P-TBL UP BY +1
150210     ELSE
150220       DISPLAY '* 1130P TABLE OVERFLOWED *' UPON SYSOUT
150230       GO TO 9900-DISPLAY-ABORT
150240     END-IF
150250     MOVE I1130P-CONSID-NBR TO WS-1130P-CONSID-NBR
150260     PERFORM 8880-READ-I1130P-FILE
150270     END-PERFORM.
150280     IF WS-1130P-ENTRY-COUNT GREATER +56000
150290       DISPLAY '1130P TABLE OVER 80% FULL.' UPON SYSOUT
150300       MOVE 'Y' TO WS-RETURN-07-FLAG.
150310*
150320*
150330   8880-READ-I1130P-FILE.
150340*
150350     READ I1130P-FILE AT END
150360       MOVE 'E' TO WS-1130P-FILE-FLAG.
150370*
150380*
150390   8900-LOAD-896-TABLE.
150400     PERFORM
150410         UNTIL END-I896-FILE
150420       IF I896-SEQUENCE GREATER WS-I896-SEQUENCE
150430         IF WS-896-ENTRY-COUNT LESS +122000
150440           ADD 1 TO WS-896-ENTRY-COUNT
150450           MOVE I896-REC TO WS-896-TBL-ENTRY (WS-896-ENTRY-COUNT)
150460         ELSE
150470           DISPLAY '* 896 TABLE OVERFLOWED *' UPON SYSOUT
150480           GO TO 9900-DISPLAY-ABORT
150490         END-IF
150500         MOVE I896-SEQUENCE TO WS-I896-SEQUENCE
150510       ELSE
150520         DISPLAY '* I896 SEQUENCE ERROR "' WS-I896-SEQUENCE
150530               '" "' I896-SEQUENCE '" *' UPON SYSOUT
150540         GO TO 9900-DISPLAY-ABORT
150550       END-IF
150560       PERFORM 8910-READ-I896-FILE
150570     END-PERFORM.
150580     IF WS-896-ENTRY-COUNT GREATER +97600
150590       DISPLAY '896 TABLE OVER 80% FULL.' UPON SYSOUT
150600       MOVE 'Y' TO WS-RETURN-07-FLAG.
150610*
150620   8910-READ-I896-FILE.
150630     READ I896-FILE AT END
150640       MOVE 'E' TO WS-I896-FILE-FLAG.
150650*
150660   8950-LOAD-1637-TABLE.
150670     PERFORM
150680         UNTIL WS-I1637-END-OF-FILE
150690       IF WS-1637-ENTRY-COUNT LESS +26
150700         ADD 1 TO WS-1637-ENTRY-COUNT
150710         MOVE I1637-KEY TO WS-1637-KEY (WS-1637-ENTRY-COUNT)
150720         MOVE I1637-DESCRIPTION TO
150730               WS-1637-DESCRIPTION (WS-1637-ENTRY-COUNT)
150740       ELSE
150750         DISPLAY '* 1637 TABLE OVERFLOWED *' UPON SYSOUT
150760         GO TO 9900-DISPLAY-ABORT
150770       END-IF
150780       PERFORM 8960-READ-I1637-FILE-NEXT
150790     END-PERFORM.
150800     IF WS-1637-ENTRY-COUNT GREATER +20
150810       DISPLAY '1637 TABLE OVER 80% FULL.' UPON SYSOUT
150820       MOVE 'Y' TO WS-RETURN-07-FLAG.
150830*
150840   8960-READ-I1637-FILE-NEXT.
150850     READ I1637-FILE NEXT RECORD.
150860     IF (NOT WS-I1637-SUCCESSFUL)
150870         AND (NOT WS-I1637-END-OF-FILE)
150880       DISPLAY '* VSAM ERROR ON I1637 READ NEXT. FILE STATUS = '
150890             WS-I1637-FILE-STATUS '. *' UPON SYSOUT
150900       GO TO 9900-DISPLAY-ABORT.
150910*
150920   9000-CLOSE.
150930     CLOSE IPARM-FILE.
150940     PERFORM 9610-CLOSE-I550-FILE.
150950     IF NOT WS-I550-SUCCESSFUL
150960       DISPLAY 'VSAM ERROR ON I550 CLOSE. FILE STATUS = '
150970             WS-I550-FILE-STATUS '.' UPON SYSOUT
150980       MOVE 'Y' TO WS-RETURN-04-FLAG.
150990     PERFORM 9400-PASS2-CLOSE.
151000     IF RETURN-07
151010       MOVE 07 TO RETURN-CODE WS-RETURN-CODE
151020     ELSE
151030       IF RETURN-04
151040         MOVE 04 TO RETURN-CODE WS-RETURN-CODE.
151050     DISPLAY WS-RETURN-CODE-LINE UPON SYSOUT.
151060*
151070   9400-PASS2-CLOSE.
151080     MOVE ALL '====  END OF REPORT  ====' TO PRINTER1-RECORD.
151090     IF WS-LINE-COUNT LESS +087
151100       MOVE +2 TO WS-LINE-SPACER
151110       PERFORM 0600-WRITE-PRINTER1-RECORD
151120     ELSE
151130       PERFORM 0800-WRITE-PRINTER1-TOP.
151140     IF PRINT-DUPLEX AND ODD-NUMBERED-PAGE
151150       MOVE SPACE TO PRINTER1-RECORD
151160       PERFORM 0800-WRITE-PRINTER1-TOP.
151170     PERFORM 9500-FINAL-SEQUENCE-CHECKS.
151180     PERFORM 9600-CLOSE-VSAM-FILES.
151190     CLOSE PRINTER1-FILE I149P-FILE I120P-FILE I225P-FILE
151200           I233P-FILE I262P-FILE I285P-FILE I348P-FILE I506P-FILE
151210           I589P-FILE I660P-FILE I662P-FILE I663P-FILE I751P-FILE
151220           I761P-FILE I761P2-FILE I769P-FILE I781P-FILE
151230           I782P-FILE I850P-FILE I851P-FILE I996P-FILE
151240           I1041P-FILE I1122P-FILE I1130P-FILE I1712P-FILE
151250           I1907P-FILE I1961P-FILE I1967P-FILE I1979P-FILE
151260           IMAIL-FILE I566SUM-FILE I575-FILE I871-FILE I877-FILE
151270           I896-FILE I906SEQ-FILE I1475-FILE I8920-FILE.
151280*
151290   9500-FINAL-SEQUENCE-CHECKS.
151300     PERFORM 1210-READ-IMAIL-FILE
151310         WITH TEST BEFORE
151320         UNTIL END-IMAIL-FILE.
151330     PERFORM 7010-READ-I149P-FILE
151340         WITH TEST BEFORE
151350         UNTIL END-I149P-FILE.
151360     PERFORM 7110-READ-I120P-FILE
151370         WITH TEST BEFORE
151380         UNTIL END-I120P-FILE.
151390     PERFORM 6136-READ-I225P-FILE
151400         WITH TEST BEFORE
151410         UNTIL END-I225P-FILE.
151420     PERFORM 2910-READ-I233P-FILE
151430         WITH TEST BEFORE
151440         UNTIL END-I233P-FILE.
151450     PERFORM 3110-READ-I262P-FILE
151460         WITH TEST BEFORE
151470         UNTIL END-I262P-FILE.
151480     PERFORM 5110-READ-I589P-FILE
151490         WITH TEST BEFORE
151500         UNTIL END-I589P-FILE.
151510     PERFORM 3410-READ-I660P-FILE
151520         WITH TEST BEFORE
151530         UNTIL END-I660P-FILE.
151540     PERFORM 3510-READ-I662P-FILE
151550         WITH TEST BEFORE
151560         UNTIL END-I662P-FILE.
151570     PERFORM 3310-READ-I663P-FILE
151580         WITH TEST BEFORE
151590         UNTIL END-I663P-FILE.
151600     PERFORM 4110-READ-I751P-FILE
151610         WITH TEST BEFORE
151620         UNTIL END-I751P-FILE.
151630     PERFORM 2610-READ-I996P-FILE
151640         WITH TEST BEFORE
151650         UNTIL END-I996P-FILE.
151660     PERFORM 3610-READ-I1122P-FILE
151670         WITH TEST BEFORE
151680         UNTIL END-I1122P-FILE.
151690     PERFORM 5610-READ-I1967P-FILE
151700         WITH TEST BEFORE
151710         UNTIL END-I1967P-FILE.
151720     PERFORM 4210-READ-I871-FILE
151730         WITH TEST BEFORE
151740         UNTIL END-I871-FILE.
151750     PERFORM 6870-READ-I906SEQ-FILE
151760         WITH TEST BEFORE
151770         UNTIL END-I906SEQ-FILE.
151780     PERFORM 5510-READ-I1475-FILE
151790         WITH TEST BEFORE
151800         UNTIL END-I1475-FILE.
151810*
151820   9600-CLOSE-VSAM-FILES.
151830     PERFORM 9620-CLOSE-I550T-FILE.
151840     IF NOT WS-I550T-SUCCESSFUL
151850       DISPLAY 'VSAM ERROR ON I550T CLOSE. FILE STATUS = '
151860             WS-I550T-FILE-STATUS '.' UPON SYSOUT
151870       MOVE 'Y' TO WS-RETURN-04-FLAG.
151880*
151890     PERFORM 9630-CLOSE-I552-FILE.
151900     IF NOT WS-I552-SUCCESSFUL
151910       DISPLAY 'VSAM ERROR ON I552 CLOSE. FILE STATUS = '
151920             WS-I552-FILE-STATUS '.' UPON SYSOUT
151930       MOVE 'Y' TO WS-RETURN-04-FLAG.
151940*
151950     PERFORM 9640-CLOSE-I552T-FILE.
151960     IF NOT WS-I552T-SUCCESSFUL
151970       DISPLAY 'VSAM ERROR ON I552T CLOSE. FILE STATUS = '
151980             WS-I552T-FILE-STATUS '.' UPON SYSOUT
151990       MOVE 'Y' TO WS-RETURN-04-FLAG.
152000*
152010     PERFORM 9650-CLOSE-I554-FILE.
152020     IF NOT WS-I554-SUCCESSFUL
152030       DISPLAY 'VSAM ERROR ON I554 CLOSE. FILE STATUS = '
152040             WS-I554-FILE-STATUS '.' UPON SYSOUT
152050       MOVE 'Y' TO WS-RETURN-04-FLAG.
152060*
152070     PERFORM 9660-CLOSE-I554T-FILE.
152080     IF NOT WS-I554T-SUCCESSFUL
152090       DISPLAY 'VSAM ERROR ON I554T CLOSE. FILE STATUS = '
152100             WS-I554T-FILE-STATUS '.' UPON SYSOUT
152110       MOVE 'Y' TO WS-RETURN-04-FLAG.
152120*
152130     PERFORM 9670-CLOSE-I556-FILE.
152140     IF NOT WS-I556-SUCCESSFUL
152150       DISPLAY 'VSAM ERROR ON I556 CLOSE. FILE STATUS = '
152160             WS-I556-FILE-STATUS '.' UPON SYSOUT
152170       MOVE 'Y' TO WS-RETURN-04-FLAG.
152180*
152190     PERFORM 9680-CLOSE-I561-FILE.
152200     IF NOT WS-I561-SUCCESSFUL
152210       DISPLAY 'VSAM ERROR ON I561 CLOSE. FILE STATUS = '
152220             WS-I561-FILE-STATUS '.' UPON SYSOUT
152230       MOVE 'Y' TO WS-RETURN-04-FLAG.
152240*
152250     PERFORM 9690-CLOSE-I562-FILE.
152260     IF NOT WS-I562-SUCCESSFUL
152270       DISPLAY 'VSAM ERROR ON I562 CLOSE. FILE STATUS = '
152280             WS-I562-FILE-STATUS '.' UPON SYSOUT
152290       MOVE 'Y' TO WS-RETURN-04-FLAG.
152300*
152310     PERFORM 9700-CLOSE-I563-FILE.
152320     IF NOT WS-I563-SUCCESSFUL
152330       DISPLAY 'VSAM ERROR ON I563 CLOSE. FILE STATUS = '
152340             WS-I563-FILE-STATUS '.' UPON SYSOUT
152350       MOVE 'Y' TO WS-RETURN-04-FLAG.
152360*
152370     PERFORM 9720-CLOSE-I565-FILE.
152380     IF NOT WS-I565-SUCCESSFUL
152390       DISPLAY 'VSAM ERROR ON I565 CLOSE. FILE STATUS = '
152400             WS-I565-FILE-STATUS '.' UPON SYSOUT
152410       MOVE 'Y' TO WS-RETURN-04-FLAG.
152420*
152430     PERFORM 9730-CLOSE-I567-FILE.
152440     IF NOT WS-I567-SUCCESSFUL
152450       DISPLAY 'VSAM ERROR ON I567 CLOSE. FILE STATUS = '
152460             WS-I567-FILE-STATUS '.' UPON SYSOUT
152470       MOVE 'Y' TO WS-RETURN-04-FLAG.
152480*
152490     PERFORM 9740-CLOSE-I759-FILE.
152500     IF NOT WS-I759-SUCCESSFUL
152510       DISPLAY 'VSAM ERROR ON I759 CLOSE. FILE STATUS = '
152520             WS-I759-FILE-STATUS '.' UPON SYSOUT
152530       MOVE 'Y' TO WS-RETURN-04-FLAG.
152540*
152550     PERFORM 9761-CLOSE-I864-FILE.
152560     IF NOT WS-I864-SUCCESSFUL
152570       DISPLAY 'VSAM ERROR ON I864 CLOSE. FILE STATUS = '
152580             WS-I864-FILE-STATUS '.' UPON SYSOUT
152590       MOVE 'Y' TO WS-RETURN-04-FLAG.
152600*
152610     PERFORM 9770-CLOSE-I979-FILE.
152620     IF NOT WS-I979-SUCCESSFUL
152630       DISPLAY 'VSAM ERROR ON I979 CLOSE. FILE STATUS = '
152640             WS-I979-FILE-STATUS '.' UPON SYSOUT
152650       MOVE 'Y' TO WS-RETURN-04-FLAG.
152660*
152670     PERFORM 9780-CLOSE-I1637-FILE.
152680     IF NOT WS-I1637-SUCCESSFUL
152690       DISPLAY 'VSAM ERROR ON I1637 CLOSE. FILE STATUS = '
152700             WS-I1637-FILE-STATUS '.' UPON SYSOUT
152710       MOVE 'Y' TO WS-RETURN-04-FLAG.
152720*
152730     PERFORM 9785-CLOSE-I8935-FILE.
152740     IF NOT WS-I8935-SUCCESSFUL
152750       DISPLAY 'VSAM ERROR ON I8935 CLOSE. FILE STATUS = '
152760             WS-I8935-FILE-STATUS '.' UPON SYSOUT
152770       MOVE 'Y' TO WS-RETURN-04-FLAG.
152780*
152790     PERFORM 9786-CLOSE-I8935T-FILE.
152800     IF NOT WS-I8935T-SUCCESSFUL
152810       DISPLAY 'VSAM ERROR ON I8935T CLOSE. FILE STATUS = '
152820             WS-I8935T-FILE-STATUS '.' UPON SYSOUT
152830       MOVE 'Y' TO WS-RETURN-04-FLAG.
152840*
152850     PERFORM 9787-CLOSE-I8950-FILE.
152860     IF NOT WS-I8950-SUCCESSFUL
152870       DISPLAY 'VSAM ERROR ON I8950 CLOSE. FILE STATUS = '
152880             WS-I8950-FILE-STATUS '.' UPON SYSOUT
152890       MOVE 'Y' TO WS-RETURN-04-FLAG.
152900*
152910     PERFORM 9790-CLOSE-I442-FILE.
152920     IF NOT WS-I442-SUCCESSFUL
152930       DISPLAY 'VSAM ERROR ON I442 CLOSE. FILE STATUS = '
152940             WS-I442-FILE-STATUS '.' UPON SYSOUT
152950       MOVE 'Y' TO WS-RETURN-04-FLAG.
152960*
152970     PERFORM 9795-CLOSE-I1840-FILE.
152980     IF NOT WS-I1840-SUCCESSFUL
152990       DISPLAY 'VSAM ERROR ON I1840 CLOSE. FILE STATUS = '
153000             WS-I1840-FILE-STATUS '.' UPON SYSOUT
153010       MOVE 'Y' TO WS-RETURN-04-FLAG.
153020*
153030   9610-CLOSE-I550-FILE.
153040     MOVE SPACE TO WS-I550-FILE-FLAG.
153050     CLOSE I550-FILE.
153060*
153070   9620-CLOSE-I550T-FILE.
153080     MOVE SPACE TO WS-I550T-FILE-FLAG.
153090     CLOSE I550T-FILE.
153100*
153110   9630-CLOSE-I552-FILE.
153120     MOVE SPACE TO WS-I552-FILE-FLAG.
153130     CLOSE I552-FILE.
153140*
153150   9640-CLOSE-I552T-FILE.
153160     MOVE SPACE TO WS-I552T-FILE-FLAG.
153170     CLOSE I552T-FILE.
153180*
153190   9650-CLOSE-I554-FILE.
153200     MOVE SPACE TO WS-I554-FILE-FLAG.
153210     CLOSE I554-FILE.
153220*
153230   9660-CLOSE-I554T-FILE.
153240     MOVE SPACE TO WS-I554T-FILE-FLAG.
153250     CLOSE I554T-FILE.
153260*
153270   9670-CLOSE-I556-FILE.
153280     MOVE SPACE TO WS-I556-FILE-FLAG.
153290     CLOSE I556-FILE.
153300*
153310   9680-CLOSE-I561-FILE.
153320     MOVE SPACE TO WS-I561-FILE-FLAG.
153330     CLOSE I561-FILE.
153340*
153350   9690-CLOSE-I562-FILE.
153360     MOVE SPACE TO WS-I562-FILE-FLAG.
153370     CLOSE I562-FILE.
153380*
153390   9700-CLOSE-I563-FILE.
153400     MOVE SPACE TO WS-I563-FILE-FLAG.
153410     CLOSE I563-FILE.
153420*
153430   9720-CLOSE-I565-FILE.
153440     MOVE SPACE TO WS-I565-FILE-FLAG.
153450     CLOSE I565-FILE.
153460*
153470   9730-CLOSE-I567-FILE.
153480     MOVE SPACE TO WS-I567-FILE-FLAG.
153490     CLOSE I567-FILE.
153500*
153510   9740-CLOSE-I759-FILE.
153520     MOVE SPACE TO WS-I759-FILE-FLAG.
153530     CLOSE I759-FILE.
153540*
153550   9761-CLOSE-I864-FILE.
153560     MOVE SPACE TO WS-I864-FILE-FLAG.
153570     CLOSE I864-FILE.
153580*
153590   9770-CLOSE-I979-FILE.
153600     MOVE SPACE TO WS-I979-FILE-FLAG.
153610     CLOSE I979-FILE.
153620*
153630   9780-CLOSE-I1637-FILE.
153640     MOVE SPACE TO WS-I1637-FILE-FLAG.
153650     CLOSE I1637-FILE.
153660*
153670   9785-CLOSE-I8935-FILE.
153680     MOVE SPACE TO WS-I8935-FILE-FLAG.
153690     CLOSE I8935-FILE.
153700*
153710   9786-CLOSE-I8935T-FILE.
153720     MOVE SPACE TO WS-I8935T-FILE-FLAG.
153730     CLOSE I8935T-FILE.
153740*
153750   9787-CLOSE-I8950-FILE.
153760     MOVE SPACE TO WS-I8950-FILE-FLAG.
153770     CLOSE I8950-FILE.
153780*
153790   9790-CLOSE-I442-FILE.
153800     MOVE SPACE TO WS-I442-FILE-FLAG.
153810     CLOSE I442-FILE.
153820*
153830   9795-CLOSE-I1840-FILE.
153840     MOVE SPACE TO WS-I1840-FILE-FLAG.
153850     CLOSE I1840-FILE.
153860*
153870*
153880   9800-CLOSE-OPENED-VSAM.
153890     IF OPENED-I550-FILE
153900       PERFORM 9610-CLOSE-I550-FILE.
153910     IF OPENED-I550T-FILE
153920       PERFORM 9620-CLOSE-I550T-FILE.
153930     IF OPENED-I552-FILE
153940       PERFORM 9630-CLOSE-I552-FILE.
153950     IF OPENED-I552T-FILE
153960       PERFORM 9640-CLOSE-I552T-FILE.
153970     IF OPENED-I554-FILE
153980       PERFORM 9650-CLOSE-I554-FILE.
153990     IF OPENED-I554T-FILE
154000       PERFORM 9660-CLOSE-I554T-FILE.
154010     IF OPENED-I556-FILE
154020       PERFORM 9670-CLOSE-I556-FILE.
154030     IF OPENED-I561-FILE
154040       PERFORM 9680-CLOSE-I561-FILE.
154050     IF OPENED-I562-FILE
154060       PERFORM 9690-CLOSE-I562-FILE.
154070     IF OPENED-I563-FILE
154080       PERFORM 9700-CLOSE-I563-FILE.
154090     IF OPENED-I565-FILE
154100       PERFORM 9720-CLOSE-I565-FILE.
154110     IF OPENED-I567-FILE
154120       PERFORM 9730-CLOSE-I567-FILE.
154130     IF OPENED-I759-FILE
154140       PERFORM 9740-CLOSE-I759-FILE.
154150     IF OPENED-I979-FILE
154160       PERFORM 9770-CLOSE-I979-FILE.
154170     IF OPENED-I1637-FILE
154180       PERFORM 9780-CLOSE-I1637-FILE.
154190     IF OPENED-I8935-FILE
154200       PERFORM 9785-CLOSE-I8935-FILE.
154210     IF OPENED-I8935T-FILE
154220       PERFORM 9786-CLOSE-I8935T-FILE.
154230     IF OPENED-I442-FILE
154240       PERFORM 9790-CLOSE-I442-FILE.
154250     IF OPENED-I1840-FILE
154260       PERFORM 9795-CLOSE-I1840-FILE.
154270*
154280   9900-DISPLAY-ABORT.
154290     DISPLAY '* ' WS-PROGRAM-NUMBER ' * RUN ABORTED *'
154300           UPON SYSOUT.
154310     PERFORM 9800-CLOSE-OPENED-VSAM.
154320     MOVE 16 TO RETURN-CODE WS-RETURN-CODE.
154330     DISPLAY WS-RETURN-CODE-LINE UPON SYSOUT.
154340     STOP RUN.
154350*
154360*
